List<List> soups = [
  [
    'ఓట్స్ సూప్‌',
    'గుమ్మడి సూప్‌',
    'క్యాప్సికమ్ సూప్‌',
    'మటన్ పాయా సూప్‌',
    'చికెన్ మష్రుమ్ సూప్',
    'రెడ్ లెంటిల్- కోకోనట్ మిల్క్ సూప్',
    'వెజిటబుల్ పాస్తా సూప్‌',
    'కార్నప్లోర్ వెజిటెబుల్ సూప్',
    'టొమాటో సూప్‌',
    'క్యారెట్ సూప్‌',
    'క్యారెట్-కార్న్(మొక్కజొన్న) సూప్',
    'కొత్తిమీర లెమన్ సూప్'
  ],
  [
    "ఓట్స్ సూప్",
    "images/oats.jpg",
    '''
ఓట్స్: 2tbsp
పాలు: 1cup
ఉల్లిపాయలు: 1/4cup(సన్నగా తరిగి పెట్టుకోవాలి)
వెల్లుల్లి రెబ్బలు: 2(సన్నగా తరిగి పెట్టుకోవాలి)
ఉప్పు: రుచికి సరిపడా
పెప్పర్: కొద్దిగా
నూనె: కొద్దిగా
కొత్తిమీర తరుగు కొద్దిగా''',
    '''
Step-1: పాన్ లో కొద్దిగా నూనె వేసి వేడి చేయాలి. వేడయ్యాక అందులో ఉల్లిపాయ ముక్కలు, వెల్లుల్లు ముక్కలు వేసి బ్రౌన్ కలర్ వచ్చే వరకూ వేగించుకోవాలి.

Step-2: అంతలోపు వేరుగా ఒక గిన్నెలో నీళ్ళు పోసి అందులో రెండు టేబుల్ స్పూన్ల ఓట్స్ వేసి ఉడికించుకోవాలి. చిక్కగా ఉడికిన తర్వాత అందులో పాలు మిక్స్ చేయాలి. 5నిముషాలు ఉడికించాలి.

Step-3: ఇప్పుడు, అందులో రోస్ట్ చేసుకొన్న ఉల్లిపాయ ముక్కలు మరియు వెల్లుల్లి ముక్కలు, ఉప్పు మరియు పెప్పర్ పౌడర్ వేసి బాగా మిక్స్ చేయాలి.

Step-4: చివరగా కొత్తిమీర తరుగుతో ఓట్స్ సూప్ ను గార్నిష్ చేయాలి. అంతే ఓట్స్ సూప్ రెడీ .

ఈ స్పైసీ ఓట్స్ సూప్ ను వేడి వేడిగా సర్వ్ చేస్తే చాలా రుచికరంగా ఉంటుంది. చలికాలంలో మరింత స్పైసీగా ఉండాలంటే ఒకటి రెండు పచ్చిమిర్చిని జోడిచవచ్చు.''',
  ],
  [
    "గుమ్మడి సూప్‌",
    "images/soup1.jpg",
    ''' 
   ఆలివ్ నూనె - 2 టేబుల్ స్పూన్లు
   ఉల్లిపాయలు - 2 ( సన్నగా కోయాలి) 
   గుమ్మడికాయ - 1 కేజీ 
   వెజిటబుల్ స్టాక్ లేదా చికెన్ స్టాక్ - 2-3 కప్పులు
   డబుల్ క్రీము - 1 ప్యాక్ ( అముల్ క్రీమ్ )
''',
    '''
  Step-1: సాస్ పాన్ పొయ్యి మీద పెట్టి రెండు స్పూన్ల ఆలివ్ ఆయిల్ వేసి వేడెక్కాక ఉల్లిపాయ ముక్కలు వేసి 5 నిముషాలు వేగించాలి. అయితే ఉల్లిపాయ రంగు మారకూడదు. 
 
  Step-2: గుమ్మడికాయ లేదా స్క్వాష్ చేర్చి 8 నుంచి 10 నిముషాలు ఉడికించాలి. మృదువుగా మరియు గోల్డ్ కలర్ వచ్చే వరకు వేగించాలి. 
 
  Step-3: వెజిటబుల్ స్టాక్ లేదా చికెన్ స్టాక్ పోసి ఆ తర్వాత ఉప్పు,మిరియాల పొడి కలపాలి. 
 
  Step-4: బాగా మరిగించాలి. స్క్వాష్ మృదువుగా అయ్యేవరకు సిమ్ లో 10 నిముషాలు ఉడికించాలి. 
 
  Step-5: పాన్ లో డబుల్ క్రీమ్ వేసి వేడి చేసి బ్లెండ్ చేయాలి. 
 
  Step-6: అదనపు వెల్వెట్ కోసం జల్లెడ ద్వారా సూప్ పోయవచ్చు. 
 
  Step-7: ఇప్పుడు సూప్ ని 2 నెలల వరకు ఫ్రోజెన్ చేయవచ్చు. 
 
  Step-8: క్రోటన్లు చేయడానికి బ్రేడ్ ని చిన్న చిన్న ముక్కలుగా కట్ చేయాలి. 
 
  Step-9: ఫ్రై పాన్ లో ఆలివ్ ఆయిల్ వేసి బ్రేడ్ ముక్కలను వేగించాలి. 
 
  Step-10: ఆ తర్వాత గుమ్మడికాయ గింజలను వేసి కొంచెం సేపు ఫ్రై చేయాలి. 
 
  Step-11: వీటిని ఒక రోజు ముందుగా తయారుచేస్తారు కాబట్టి ఎయిర్టైట్ కంటైనర్లో నిల్వ చేయాలి. 
 
  Step-12: రీ హీట్ చేసినప్పుడు అవసరమైతే సూప్ రుచి కోసం మరియు అందం కోసం క్రోటన్లు మరియు గుమ్మడికాయ విత్తనాలను సూప్ మీద జల్లవచ్చు. 
 
  Step-13: స్క్వాష్ ని తొలగించి, గింజలను లేత నుండి బాగా రోస్ట్ చేయాలి.  
 
  Step-14: చివర చీజ్ వేసి కరిగే వరకు ఉడికించాలి. 

  INSTRUCTIONS: 
  1. అదనపు రుచి మరియు సువాసన కోసం వెల్లుల్లి పాడ్స్ ఉపయోగించవచ్చు. 
  2. మంచి రుచి కోసం రెగ్యులర్ గుమ్మడికాయ కన్నా బటర్ నట్ స్క్వాష్ ఉపయోగించవచ్చు.
''',
  ],
  [
    "క్యాప్సికమ్ సూప్",
    "images/oats.jpg",
    '''
  ఎర్రని క్యాప్సికం-22 
  ఆయిల్-ఒక టేబుల్ స్పూన్ 
  టమాటాలు-4 
  వెల్లుల్లి-ఒక రెమ్మ 
  బిర్యానీ ఆకులు-2 
  నీళ్ళు-3 కప్పులు 
  వెన్న తక్కువ ఉన్న పాలు-అర కప్పు 
  కార్న్ ఫ్లోర్-ఒకటిన్నర టేబుల్ స్పూన్ 
  ఉప్పు-తగినంత 
  పంచదార-చిటికెడు 
  నల్ల మిరియాలపొడి-గార్నిషింగ్ కోసం తగినంత''',
    '''
  Step-1: తాజా ఎర్రని క్యాప్సికం తీసుకుని దానికి నలువైపులా నూనె రాసి స్టవ్ మీద బయట నల్లగా అయ్యేవరకూ కాల్చాలి. ఆరోగ్యకరమైనవని మీరు భావించే ఈ ఆహారాలు మధుమేహ వ్యాధిగ్రస్తులకు ప్రాణహాని కలిగిస్తాయి! 
  
  Step-2: ఒక గిన్నెలో నీళ్ళు తీసుకుని కాల్చిన క్యాప్సికం అందులో వేసి చల్లారాకా చేత్తో నల్లని భాగాన్ని తొలగించాలి. 
  
  Step-3: ఇలా కాల్చుకున్న అన్ని క్యాప్సికంల నుండీ నల్లని భాగాన్ని తొలగించాకా చిన్న ముక్కలుగా కోసుకోవాలి. మరీ చిన్నగా అక్కర్లేదు ఎందుకంటే దీనిని మళ్ళీ మిక్సీలో వేస్తాము కదా.తరిగేటప్పుడు గింజలు తొలగించడం మర్చిపోవద్దు. 
  
  Step-4: ఒక ప్యాన్ తీసుకుని అందులో నూనె వేసి వేడి చేసి అందులో తరిగిన టమాటా ముక్కలు, మీకు వాసన నచ్చేటట్లయితే ఒక వెల్లుల్లి రెమ్మ కూడా వెయ్యాలి. 
  
  Step-5: ఇప్పుడు టమాటాలలో మంచి సువాసన కోసం బిర్యానీ ఆకు, తరిగిన క్యాప్సికం ముక్కలు, నీళ్ళు వేసి ఉడికాకా స్టవ్ కట్టెయ్యాలి. 
  
  Step-6: ఈ మిశ్రమం చల్లారాకా మిక్సీలో వేసి గ్రైండ్ చెయ్యాలి. ఎప్పుడూ కూడా మిక్సీ పైవరకూ వేసి గ్రైండ్ చెయ్యకూడదు. ఒక వేళ మిశ్రమం మరీ ఎక్కువ ఉంటే రెండు సార్లు గ్రైండ్ చేసుకోవాలి. 
  
  Step-7: గ్రైండ్ చేసిన మిశ్రమాన్ని ఒక గిన్నెలో తీసుకోవాలి. స్టవ్ మీద మూకుడు పెట్టి వేడెక్కాకా దానిలో ఈ మిశ్రమాన్ని వెయ్యాలి. ఇప్పుడు పాలల్లో కార్న్ ఫ్లోర్ వేసి ఉండలు లేకుండా కలిపి దానిని సూప్ మిశ్రమంలో వేసి బాగా కలపాలి. ఇందులో రుచికి తగినంత ఉప్పు వేసి సూప్ రుచి చూసి పుల్లగా ఉందనుకుంటే చిటికెడు పంచదార కలపాలి. 
  
  Step-8: సూప్ చిక్కబడగానే స్టవ్ కట్టేసి సూపుని సర్వింగ్ బౌల్లోకి తీసుకుని పైన మిరియాల పొడి చల్లి సర్వ్ చెయ్యడమే.
  '''
  ],
  [
    "మటన్ పాయా సూప్",
    "images/paya.JPG",
    ''' 
  కాల్చిన మేకకాళ్లు: 4 
  ఉల్లిపాయలు: 4 
  అల్లంవెల్లుల్లి పేస్ట్: 2tbsp 
  కారం: 2tsp 
  ధనియాలపొడి: 3tsp 
  టొమాటోలు: 1/2kg 
  చింతపండు: నిమ్మకాయంత 
  కార్న్ ఫ్లోర్(జొన్నపిండి): 4tbsp 
  గరంమసాలా: 1/2tbsp 
  కొత్తిమీర: 1cup 
  పుదీనా: 1cup 
  పచ్చిమిర్చి: 8 
  ఉప్పు: రుచికి తగినంత''',
    '''
  Step-1: ముందుగా మేకకాళ్లను శుభ్రంగా కడిగి చాకుతో పైన గాట్లు పెట్టి తరవాత ముక్క విరగక్కుండానే నలిగినట్టుగా కొట్టించాలి. 
  
  Step-2:  ఈ ముక్కల్ని ప్రెషర్‌పాన్‌లో వేసి 7 గ్లాసుల నీళ్లు పోయాలి. అందులోనే రెండు ఉల్లిపాయలు, నాలుగు పచ్చిమిర్చి సన్నగా తరిగి వేయాలి. ఉప్పు, ధనియాలపొడి, పసుపు కూడా వేసి మూతపెట్టి 4విజిల్స్‌ వచ్చేవరకూ ఉడికించాలి. తరవాత మంట తగ్గించి సిమ్‌లో అరగంటసేపు ఉంచాలి. ఇప్పుడు ఇవి మెత్తగా ఉడుకుతాయి. 
  
  Step-3: మిగిలిన రెండు ఉల్లిపాయలు, పచ్చిమిర్చి సన్నగా తరగాలి. 
  
  Step-4: ఇప్పుడు ఒక పాన్ లో నూనె వేసి కాగాక ఉల్లి, పచ్చిమిర్చి ముక్కలు వేసి ఎర్రగా వేయించాలి. తరవాత అల్లంవెల్లుల్లి, కారం, ధనియాలపొడి, జొన్నపిండి వేసి బాగా వేయించాలి. 
  
  Step-5: ఆ తరవాత టొమాటో ముక్కలు, చింతపండు రసం పోయాలి. ఇప్పుడు ఉడికించిన కాళ్లను రసంతో సహా, కొత్తిమీర, పుదీనా తరుగుకూడా వేసి మరో రెండు నిమిషాలు మరిగించి దించాలి. అంతే మటన్ పాయ రెడీ. 
     కాల్షియం లోపంతో బాధపడేవాళ్లకి ఇది ఎంతో మంచిది.'''
  ],
  [
    "చికెన్ మష్రుమ్ సూప్",
    "images/chicksoup.JPG",
    ''' 
     బోన్ లెస్ చికెన్: 250grms 
     చికెన్ స్టాక్: 4cup 
     మష్రుమ్: 10(రెండుగా కట్ చేయలి) 
     ఉల్లిపాయలు: 4(పచ్చకాడు సపరేట్ గా కట్ చేయాలి) 
     పచ్చిమిర్చి: 2(కట్ చేసినవి) 
     మిరియాలు: 10(పొడి చేసుకోవాలి) 
     కొత్తిమీర: ఒకకట్ట(సన్నగా కట్ చేసుకోవాలి) 
     బట్టర్: 1tbsp 
     ఉప్పు: రుచికి సరిపడా''',
    ''' 
     Step-1: ముందుగా కుక్కర్ లో చికెన్ వేసి, అందులో నీళ్ళు పోసి 2 విజిల్స్ వచ్చే వరకూ ఉడికించుకోవాలి. 
    
     Step-2: తర్వాత స్టౌ ఆఫ్ చేసి కుక్కర్ లో చికెన్ ముక్కలను వేరుగా తీసుకోవాలి. చికెన్ ఉడికించిన నీళ్ళు పక్కన పెట్టుకోవాలి. 
    
     Step-3: తర్వాత పాన్ లో కొద్దిగా బట్టర్ వేసి కరిగిన తర్వాత పెప్పర్ పొడి వేసి ఒక సెకన్ వేగిన తర్వాత ఉల్లిపాయ ముక్కలు వేసి 5 నిముషాలు వేగించుకవాలి. 
    
     Step-4: తర్వాత అందులో మష్రుమ్ కూడా వేసి వేగించాలి. తర్వాత అందులో పచ్చిమిర్చి, అల్లం, ఉల్లిపాయ కాడలు మరియు పక్కన పెట్టుకొన్న సన్నని చికెన్ పీసులు వేసి బాగా మిక్స్ చేసి 2నిముషాలు వేగించుకోవాలి. 
    
     Step-5: తర్వాత అందులో నాలుగు కప్పులు, పోసి రెండు నిముషాలు ఉడికించుకోవాలి . ఇప్పుడు అందులో ఉప్పు వేసి బాగా మిక్స్ చేసి కొత్తిమీర తరుగు కూడా వేసి 10నిముషాలు తక్కువ మంట మీద ఉడికించుకోవాలి. అంతే చికెన్ మష్రూమ్ సూప్ రెడీ.
''',
  ],
  [
    "రెడ్ లెంటిల్- కోకోనట్ మిల్క్ సూప్",
    "images/oats.jpg",
    '''
రెడ్ లెంటిల్ /ఎర్రకందిపప్పు: 1cup 
ఆలివ్ 
నూనె: 3tbsp 
వెల్లుల్లి రెబ్బలు: 2-3(సన్నగా తరిగి పెట్టుకోవాలి) 
ఉల్లిపాయ: 1cup(సన్నగా తరిగి పెట్టుకోవాలి) 
జలపెన్యో పెప్పర్: 2 (సన్నగా కట్ చేసునవి) 
క్యారెట్ ½ కప్ (తరిగినవి) 
పచ్చిబఠానీ: ½cup 
టమోటా హిప్ పురీ: ½ cup 
ఉప్పు : రుచికి సరిపడా 
పసుపు: ½tsp 
కారం ½ tsp(సరిపడా) 
నిమ్మకాయ రసం : 2tbsp 
కొబ్బరి పాలు - 1cup
''',
    ''' 
Step-1: ముందుగా మందపాటి పాన్ లో ఆలివ్ ఆయిల్ వేసి, వేడి చేయాలి. 

Step-2: తర్వాత అందులో అల్లం వెల్లుల్లి పేస్ట్ వేసి బ్రౌన్ కలర్ వచ్చే వరకూ వేయించుకోవాలి. 

Step-3: తర్వాత అందులో ఉల్లిపాయలు మరియు పెప్పర్ వేసి ఒక నిముషం వేయించుకోవాలి. 

Step-4: తర్వాత అందులో క్యారెట్, పచ్చిబఠానీ, ఎర్రకందిపప్పు, టమోటో గుజ్జు, ఉప్పు, కారం మరియు పసుపు వేయాలి. 

Step-5: తర్వాత అందులో 6కప్పుల నీరు పోసి మూత పెట్టి పప్పు మెత్తగా ఉడికే వరకూ ఉడికించుకోవాలి. 

Step-6: చివరిగా అందులో కొబ్బరి పాలు మరియు నిమ్మరసం వేసిబాగా మిక్స్ చేసి వేడి వేడిగా సర్వ్ చేయాలి.'''
  ],
  [
    "వెజిటబుల్ పాస్తా సూప్‌",
    "images/pasta.jpg",
    ''' 
  ఉడికించిన పాస్తా: 1cup 
  క్యారట్ ముక్కలు: 1/2cup 
  బీన్స్‌ముక్కలు: 1/4cup 
  ఉల్లిపాయ: 1( తరుగు) 
  క్యాప్సికమ్: 1( తరుగు) 
  ఉల్లికాడల తరుగు: 2tbsp 
  ఉప్పు: రుచికి తగినంత 
  మిరియాలపొడి: 1tsp వెన్న: 1tsp''',
    ''' 
  Step-1: పాన్ లో వెన్న వేడయ్యాక అందులో కూరగాయ ముక్కలను వేసి పచ్చివాసన పోయేవరకు వేయించాలి. 
 
  Step-2: తర్వాత అందులో నాలుగు కప్పుల నీరు, పాస్టా, ఉప్పు, మిరియాలపొడి వేసి మరిగించి దింపేయాలి. 
 
  Step-3: ఫైనల్ గా ఉల్లికాడల తరుగుతో గార్నిష్ చేసి సర్వ్ చేయాలి అంతే పాస్తా సూప్ రెడీ.'''
  ],
  [
    "కార్నప్లోర్ వెజిటెబుల్ సూప్",
    "images/soup1.jpg",
    ''' 
  కార్న్ ప్లోర్: 3tbsp 
  క్యారెట్: 1(తురుము) 
  పచ్చిమిర్చి: 4(తురుములేదా చిన్నగా కట్ చేసిన పీసులు) 
  బీన్స్: 1(తురుములేదా చిన్నగా కట్ చేసిన పీసులు) 
  క్యాబేజి: 10grms1(తురుము) 
  ఉల్లిగడ్డ: 2పెద్దవి 
  కాలీఫ్లవర్: 10grms1(తురుము) 
  ఉప్పు: తగినంత 
  మిరియాలపొడి: 1/2tsp 
  అజినా మొటో(చైనా ఉప్పు): తగినంత 
  సెలరీ: 1/2tsp 
  బిర్యానీ ఆకులు:2 
  లెమన్ గ్రాస్: 1/2tsp''',
    '''
  Step-1: మొదటగా కట్ చేసి, తరుమి పెట్టుకొన్న క్యారెట్, బీన్స్, ఉల్లిగడ్డ, కాలీఫ్లవర్, క్యాబేజి, వేడినీళ్లలో వేసి ఓ పదినిమిషాలు ఉడకనివ్వాలి. నీళ్లను వడగట్టి, దాంట్లో ఉప్పు, మిరియాలపొడి వేసి బాగా కలపాలి. 
 
  Step-2: చిన్న పాన్ తీసుకొని అందులో కొద్దిగా నీళ్ళు పోసి, వేడి అయ్యాక కార్న్ ప్లోర్ ను కొద్దిగా నీళ్ళలో కలిపి వేడినీటిలో పోసి అతి తక్కువ మంట మీద ఉడకనివ్వాలి, తర్వాత ముందుగా తయారు చేసుకొన్న మిశ్రమాన్ని అందులో వేసి వీటిని కొద్ది సేపు ఉడకనివ్వాలి. 
  
  Step-3: చివరలో బిర్యానీ ఆకులు వేసి కాసేపు ఉంచాలి. ఇప్పుడు అందులో ఉన్న కూరగాయలన్నీ తీసేయాలి. ఆ నీటిని వెజి స్టాక్ అంటారు. ఈ స్టాక్ చిక్కపడే వరకు అలాగే ఉండనివ్వాలి. ఇప్పుడు దాంట్లో ఉప్పు, మిరియాలపొడి, పచ్చిమిర్చి, అజినామొటో వేసి 2నిమిషాలు ఉడకనివ్వాలి. వేడి.. వేడి సూప్ మీ నోరూరిస్తుంది.

'''
  ],
  [
    "టొమాటో సూప్",
    "images/tomato.jpg",
    ''' 
  టమాటాలు: 8 
  నీళ్లు: 4cups 
  మిరియాల పొడి : 1tsp 
  కారం: 1tsp 
  జీలకర్ర పొడి: 1tsp 
  అల్లం వెల్లుల్లి పేస్ట్: 1tsp 
  ఉప్పు: రుచికి తగినంత
''',
    ''' 
Step-1: ముందుగా టమాటోలను శుభ్రంగా కడిగి, రెండు విజల్స్ వచ్చే వరకూ కుక్కర్ లో ఉడికించి పక్కన పెట్టుకోవాలి. 

Step-2: తర్వాత వీటిని మిక్సీలో వేసి మెత్తగా బ్లెండ్ చేసుకోవాలి. 

Step-3: ఇప్పుడు ఈ మిశ్రమానికి నీటిని కలిపి స్టౌ మీద పెట్టాలి. బాగా మరుగుతుండగా మిరియాల పొడి, కారం, జీలకర్ర పొడి, అల్లం , వెల్లుల్లి పేస్ట్, ఉప్పు వేసి బాగా కలపాలి. 

Step-4: మంట తగ్గించి మరో పది నిమిషాల పాటు మరిగించి దించేసుకోవాలి. పుదీనా చల్లుకుని వేడి వేడిగా సేవిస్తే చాలా రుచిగా ఉంటుంది. అంతే టమోటో సూప్ రెడీ...

'''
  ],
  [
    "క్యారెట్ సూప్",
    "images/carrot.jpg",
    ''' 
  క్యారెట్స్ : 5-7 
  టమోటో: 2tbsp(ఒక టమోటోను గుజ్జుగా తయారుచేసుకోవాలి) 
  బ్లాక్ పెప్పర్ పౌడర్: కొద్దిగా 
  ఉప్పు: రుచికి సరిపడా 
  గరం మసాలా 
  బటర్ 
  కొత్తిమీర: గార్నిషింగ్ కోసం
''',
    ''' 
Step-1: ముందుగా క్యారెట్ మీ పొట్టు తొలగించాలి. ఇప్పుడు క్యారెట్స్ ను తురిమి, ఒక బౌల్లో వేసి పక్కన పెట్టుకోవాలి. 

Step-2: ఇప్పుడు ఒక బౌల్లో క్యారెట్ తురుము మరియు టమోటోను వేసి కొద్దిగా నీళ్ళు పోసి, మెత్తగా ఉడికించి తర్వాత మిక్సీలో వేసి మెత్తగా పేస్ట్ చేసుకోవాలి. 

Step-3: తర్వాత పాన్ లో బటర్ వేసి కరిగిన తర్వాత అందులో అల్లం మరియు టమోటో,క్యారెట్ పేస్ట్ కూడా ఒక నిముషం వేగిన తర్వాత అందులో ఉప్పు, గరం మసాలా, కూడా వేసి బాగా మిక్స్ చేయాలి. 

Step-4: ఒక నిముషం ఉడికించి, తర్వాత స్టౌ ఆఫ్ చేయాలి. తర్వాత దీన్ని సూప్ బౌల్లోనికి మార్చుకొని, బ్లాక్ పెప్పర్ పౌడర్ మరియు కొత్తిమీర తరుగుతో గార్నిష్ చేసుకోవాలి. అంతే స్పెషల్ క్యారెట్ సూప్ రెడీ...

'''
  ],
  [
    "క్యారెట్-కార్న్(మొక్కజొన్న) సూప్",
    "images/carrot.jpg",
    '''
  క్యారెట్: 3cups(ఉడికించి చిదిమిపెట్టుకొన్నది) 
  స్వీట్ కార్న్: 1/4cup(ఉడికించి చిదిమిపెట్టుకొన్నది) 
  ఉల్లిపాయముక్కలు: 1tbsp 
  సెలరే: 1/4cup 
  వెజిటేబుల్ స్టాక్: 4cup(అన్నిరకాల కూరగాయ ముక్కలను ఉడికించిన నీళ్ళు) 
  టబాస్కో సాస్: 1tbsp 
  నిమ్మరసం: 2tsp 
  నూనె: 1tbsp 
  క్రీమ్: 1/2cup 
  పాలు: 1/2cup 
  ఉప్పు: రుచికి తగినంత 
  పెప్పర్ పౌడర్ లేదా కారం: తగినంత''',
    ''' 
  Step-1: ముందుగా పాన్ లో నూనె వేసి వేడయ్యాక ఉల్లిపాయ ముక్కలు, కొత్తిమీర తరుగు వేసి రెండు నిమిషాలు వేగనివ్వాలి. 

  Step-2: తర్వాత అందులో ఉడికించి గుజ్జు చేసి పెట్టుకొన్న క్యారెట్, కార్న్ ను పోసి తక్కువ మట్టలో ఉడికించాలి. 

  Step-3: ఇప్పుడు అందులోనే టబాస్కో సాస్, ఉప్పు, పెప్పర్ పౌడర్, వెజిటెబల్ స్టాక్ వేసి బాగా కాగనివ్వాలి. 

  Step-4: కొద్దిసేపటి తర్వాత పాలు, క్రీమ్ వేసి రెండు నిమిషాలు పాటు కాగనివ్వాలి. 

  Step-5: చివరగా నిమ్మరసం కలిపి పక్కకు దింపుకొని హాట్ హాట్ గా సర్వ్ చేయాలి.

'''
  ],
  [
    "కొత్తిమీర లెమన్ సూప్",
    "images/coria.jpg",
    ''' 
  సన్నగా తరిగిన కొత్తిమీర: 2tbsp 
  ఉల్లిపాయ: 1 (చిన్నముక్కలుగా తరిగి పెట్టుకోవాలి) 
  స్ప్రింగ్ ఉల్లిపాయ(ఉల్లికాడలు): 1 (సన్నగా తరిగాలి) 
  అల్లం: 1 అంగుళం (చిన్న ముక్కలుగా చేయాలి) 
  వెల్లుల్లిపాయ: 1(సన్నగా కట్ చేయాలి) 
  నిమ్మరసం: 2tbsp 
  వెజిటబుల్ స్టాక్: 4 cups 
  మిరియాలు: 4-5 (పొడి చేసుకోవాలి) 
  ఉప్పు: రుచికి సరిపడా 
  వెన్న: 1tsp
''',
    ''' 
Step-1: ఫ్రైయింగ్ పాన్ లో బటర్ వేసి కరిగిన తర్వాత అందులో, ఉల్లిపాయలు, అల్లం, వెల్లుల్లి, మరియు ఉల్లికాడ ముక్కలు అన్నింటిని వేసి మీడియం మంట మీద వేయించుకోవాలి. 

Step-2: మొత్తం అన్నీ వేగుతూ లైట్ గా, మెత్తగా అయ్యే వరకూ వేయించుకోవాలి. 5నిముషాలు వేయించాలి. 

Step-3: ఇప్పుడు అందులో వెజిటేబుల్ స్టాక్(కూరగాయ ముక్కలు ఉడికించుకొన్న నీరు)పోసి బాగా ఉడికించాలి . 

Step-4: 5నిముషాల తర్వాత కొత్తిమీర, నిమ్మరసం, ఉప్పు, బ్లాక్ పెప్పర్ పొడి వేసి అన్నింటిని మిక్స్ చేయాలి. 

Step-5: సూప్ చిక్కగా మారే సమయంలో స్టౌ ఆఫ్ చేసి తర్వాత వేడి వేడిగా సర్వ్ చేయాలి. సర్వ్ చేసి ముందు బటర్ ను గార్నిస్ చేయాలి.
'''
  ]
];
List<List> tiffin = [
  [
    'నిమ్మకాయ పులిహోర ‌',
    'మామిడికాయ పులిహోర‌',
    'రవ్వ పులిహోర‌',
    '‌పాలక్ పనీర్ ఇడ్లీ',
    'మసాలా దోశ',
    'రవ్వ దోశ‌',
    'పాలక్ పెసరట్టు',
    'సేమియా ఉప్మా',
    'మిక్డ్స్ వెజిటేబుల్ వడలు',
    'సోయా పాలక్ పరాటా',
    'మైసూర్ బోండా‌',
    'వెజ్ కిచిడీ',
  ],
  [
    "నిమ్మకాయ పులిహోర",
    "images/lemon.jpg",
    ''' 
  బియ్యం: 2cups 
  నిమ్మకాయ: 1(కట్ చేసి రసం తీసి పెట్టుకోవాలి) 
  కరివేపాకు: రెండు రెబ్బలు 
  పచ్చిమిరపకాయలు: 4-6 
  ఆవాలు: 1tsp 
  వేరుశగ(పల్లీలు): 1tbsp 
  మినప్పప్పు: 1 tbsp 
  పచ్చిశెనగపప్పు: 1tbsp 
  పసుపు: 1/4 tsp 
  ఇంగువ: చిటికెడు 
  మెంతి పొడి: చిటికెడు 
  ఉప్పు: రుచికి తగినంత 
  కొత్తిమిర: 2 రెమ్మలు 
  నూనె: తగినంత''',
    ''' 
  Step-1: మొదటగా పులిహోరకు ఎప్పుడు కూడా బియ్యం కడిగి కనీసం పదినిమిషాలనుండి అరగంట వరకు నాననివ్వాలి. తర్వాత బియ్యం కడిగి, నానబెట్టి కాస్త ఉప్పు కలిపి పొడిపొడిగా అన్నం వండాలి. 

  Step-2: ఒక ప్లేట్ లో అన్నం తీసి చల్లారనివ్వాలి. 

  Step-3: తర్వాత పచ్చిమిరపకాయలు నిలువగా చీల్చి పెట్టుకోవాలి. అల్లం చిన్నముక్కలుగా కట్ చేసుకోవాలి. 

  Step-4: స్టౌ వెలిగించి అందులో నూనె వేడి చేసి ఇంగువ వేయాలి. అది కరిగాక ఆవాలు వేసి చిటపటలాడాక పచ్చిమిరపకాయలు, మినప్పప్పు, పచ్చిశెనగపప్పు, పల్లీలు, అల్లం ముక్కలు వేసి కొద్దిగా వేపాలి. 

  Step-5: ఇప్పుడు పసుపు, కరివేపాకు వేసి కలిపి దింపేయాలి. ఈ పోపును కొద్దిగా ఉప్పు కలిపిన అన్నంలో వేయాలి. దానితో పాటు నిమ్మరసం, సన్నగా తరిగిన కొత్తిమిర కూడా వేసి మొత్తం బాగా కలియబెట్టాలి. అంతే నిమ్మ సువాసనతో కూడి రుచికరమైన పులిహోర రెడీ...

l'''
  ],
  [
    "మామిడికాయ పులిహోర",
    "images/lemon.jpg",
    ''' 
  రైస్: 3cups( అన్నం పొడి పొడిగా వండుకొని పక్కన పెట్టుకోవాలి) 
  పచ్చిమామిడికాయ తురుము: 11/2 cup(పొట్టు తీసేసి సన్నగా తురుముకోవాలి) 
  వేరుశెనగలు: 5-6tbsp( వేగించినవి) 
  జీడిపప్పు :2tbsp(రోస్ట్ చేసుకోవాలి) 
  ఉప్పు: రుచికి సరిపడా 
  పోపు కోసం: 
  నూనె: 1 1/2tbsp 
  ఆవాలు: 1tbsp 
  శెనగపప్పు: 1tbsp 
  ఉద్దిపప్పు: tbsp 
  ఎండు మిర్చి: 3-4 
  పచ్చి మిర్చి: 6-8(మద్యలోకి కట్ చీలికగా కట్ చేసి పెట్టుకోవాలి) 
  తురిమిన అల్లం: 1tsp 
  ఇంగువ: 1/4 tsp 
  పసుపు: 1/4 tsp 
  కరివేపాకు: రెండు రెమ్మలు

''',
    ''' 
Step-1: ముందుగా మందపాటి పాన్ స్టౌ మీద పెట్టి అందులో నూనె వేసి వేడయ్యాక అందులో ఆవాలు వేయాలి. 

Step-2: ఆవాలు చిటపలాడిన తరవ్ాత అందులో శెనగపప్పు, ఉద్దిబాళ్ళు, వేసి లైట్ బ్రౌన్ కలర్ వచ్చే వరకూ వేయించుకోవాలి. వెంటవెంటనే అందులో పచ్చిమిర్చి, ఎండు మిర్చి ముక్కలు, అల్లం తురుము, కరివేపాకు, అల్లం, పసుపు మరియు ఇంగువ వేసి, కొన్ని సెకండ్లు తక్కువ మంట మీద వేగించుకోవాలి. 

Step-3: పోపు వేగిన తర్వాత అందులో పచ్చిమామిడి తురుము వేసి మరోకొన్ని నిముషాలు ఫ్రై చేసుకోవాలి. 

Step-4: తర్వాత అందులోనే రోస్ట్ చేసి పెట్టుకొన్న వేరుశెనగలు మరియు జీడిపప్పు వేసి మిక్స్ చేసి స్టౌ ఆఫ్ చేసి పక్కన పెట్టుకోవాలి. 

Step-5: ఇప్పుడు ముందుగా వండి పెట్టుకొన్న అన్నంను పోపులో వేసి, ఉప్పు చిలకరించి మొత్తం మిశ్రమాన్ని కలగలుపుకోవాలి. ఒకసారి కలిపిన తర్వాత ఉప్పు సరిపోయిందో లేదో తెలుకొని సరిపడా వేసి మిక్స్ చేసి అడ్జెస్ట్ చేసుకోవాలి. 

Step-6: అంతే మామిడికాయ పులిహోర రెడీ. మామిడికాయ పులిహోరతో పాటు సైడ్ గా వడియాలు, పెరుగు లేదా పచ్చడితో సర్వ్ చేస్తే చాలా రుచికరంగా ఉంటుంది.

'''
  ],
  [
    "రవ్వ పులిహోర",
    "images/ravapuli.jpg",
    ''' 
  రవ్వ: 2cups 
  నిమ్మకాయ: 1 
  ఉల్లిపాయ: 1(అవసరమైతే) 
  ఎండుమిరపకాయలు: 3 
  పచ్చిమిర్చి: 4 
  ఆవాలు: 1 tsp 
  జీలకర్ర: 1/4 tsp 
  శెనగపప్పు: 1 tsp 
  మినప్పప్పు: 1 tsp 
  కరివేపాకు: 2రెబ్బలు 
  పసుపు: 1/4 tsp 
  ఉప్పు: తగినంత 
  నెయ్యి: 2 tbsp 
  నూనె: 3 tbsp''',
    ''' 
  Step-1: ముందుగా స్టౌ మీద పాన్ పెట్టి అందులో ఒక చెంచాడు నెయ్యి వేసి వేడి చేసి చిన్న మంటపై రవ్వను కమ్మటి వాసన వచ్చేవరకు వేయించాలి. 

  Step-2: తర్వాత రవ్వను తీసి పక్కన పెట్టి అదే ప్యాన్ లో నూనె వేడి చేసి ఆవాలు, జీలకర్ర వేసి చిటపటలాడాక ఎండుమిరపకాయలు, పచ్చిమిర్చి, శెనగపప్పు, మినప్పప్పు, కరివేపాకు, వేసి కొద్దిగా రంగు మారేవరకు వేయించాలి. 

  Step-3: ఇప్పుడు అందులో పసుపు వేసి రెండు కప్పుల రవ్వకు ఒకటిన్నర కప్పు నీళ్లు పోసి తగినంత ఉప్పువేసి మరిగించాలి. మంట తగ్గించి మరుగుతున్న నీళ్లలో రవ్వ మెల్లిగా పొస్తూ ఉండలు కట్టకుండా కలుపుతో ఉండాలి. మూతపెట్టి కొద్దిసేపు మగ్గనివ్వాలి. 

  Step-4: ఆ తరవాత గరిటతో మొత్తం రవ్వను పొడిపొడిగా చేయాలి. నీళ్లు ఎక్కువగా పోస్తే మెత్తగా ఉప్మాలా అవుతుంది. అందుకే ఇక్కడ జాగ్రత్తపడితే చాలు. ఇందులో నిమ్మరసం పిండి, కొంచెం కొత్తిమిర, నెయ్యివేసి బాగా కలిపి పదినిమిషాల తరవాత వడ్డించాలి. అంతే రవ్వ పులిహోర రెడీ..

'''
  ],
  [
    "పాలక్ పనీర్ ఇడ్లీ",
    "images/idli.jpg",
    ''' 
  పాలకూర: 1cup 
  పనీర్: 1/2cup 
  మినపప్పు: 1cup 
  బియ్యం: 1cup 
  పచ్చిమిర్చి: 4-6 
  టమోట: 1 
  ఉప్పు: రుచికి తగినంత 
  జీడిపప్పు: 1/2cup''',
    ''' 
  Step-1: ముందుగా మినపప్పు, బియ్యం విడివిడిగా కడిగి నానబెట్టుకోవాలి. పప్పు, బియ్యాన్ని ఎక్కువసేపు నానబెడితే ఇడ్లీ మొత్తగా వస్తుంది. 

  Step-2: బియ్యం, పప్పు బాగా నాని తర్వాత రుబ్బుకొని ఉప్పు కలిపి పెట్టుకోవాలి. మరుసటి రోజు ఉదయాన్నే ఈ మిశ్రమంలో చిటికెడు బేకింగ్ సోడ, టమోట ముక్కలు, పచ్చిమిర్చి ముక్కలు, సన్నగా తరిగి వేసుకోవాలి. 

  Step-3: ఇందులోనే పాలకూర, పనీర్ ని కూడా వేసుకుని కలుపుకోవాలి. ఇప్పుడు ఇడ్లీ పాత్ర లోపల నూనె రాసి ఇడ్లీ ప్లేట్ లో ఇడ్లీల పిండి నింపి దాని పై జీడిపప్పులను సర్ది, ఇడ్లీ కుక్కర్ పెట్టి, ఆవిరి మీద ఉడికించుకోవాలి. అంతే పాలక్ పనీర్ ఇడ్లీ రెడీ. పాలక్ పనీర్ ఇడ్లీకి పుదీనా చట్నీ మంచి కాంబినేషన్ ఇలా చేయడం వల్ల వెరైటీ ఇడ్లీగా రుచికి రుచి, ఆరోగ్యానికి ఆరోగ్యం....
'''
  ],
  [
    "మసాలా దోశ",
    "images/dosha.JPG",
    ''' 
  బియ్యం: 2cups 
  అల్లం మిర్చి పేస్టు: 1tbsp 
  ఉల్లి ముక్కలు: 1cup 
  కారం: 1tsp 
  మైదా పిండి: 1cup 
  పుల్ల మజ్జిగ: 1glass 
  ఉప్పు: రుచికి తగినంత 
  పసుపు :చిటికెడు''',
    ''' 
  Step-1: ముందుగా బియ్యం నానబెట్టి శుభ్రం చేసి మెత్తగా పిండి రుబ్బు కోవాలి. 

  Step-2: ఈ పిండికి మైదా, అల్లం, మిర్చి పేస్టు, ఉల్లిపాయ ముక్కలు, ఉప్పు , కారం, పసుపు వేసి అన్ని కలిసేలా కలిపి మజ్జిగ పోసుకుని జారుగా చేసుకోవాలి. 

  Step-3: తర్వాత స్టౌ మీద పాన్ పెట్టి పెన్నం మీద పిండితో రవ్వ దోసె మాదిరిగా వేసి సరిపడ నూనె వేసి రెండు వైపులా కాల్చాలి. 

  Step-4: ఈ స్పైసీ మసాలా దోసెను వేడిగా కొబ్బరి చెట్నీ లేదా అల్లం చెట్నిలతో సర్వ్ చెయ్యాలి. చాలా రుచిగా ఉంటుంది.

'''
  ],
  [
    "రవ్వ దోశ",
    "images/dosha.JPG",
    '''
బియ్యం పిండి: 1cup
మైదా: 1cup
సూజి(రవ్వ): 1cup
శెనగపిండి: 1/4(అవసరమనుకొంటేనే)
పచ్చిమిర్చి: 4-6
కరివేపాకు: రెండు రెమ్మలు
క్యారెట్ తురుము: 1tbsp
జీలకర్ర: 1/2tsp
ఉప్పు : రుచికి సరిపడా
నూనె: సరిపడా''',
    '''
Step-1: ముందుగా పచ్చిమిర్చిని శుభ్రం చేసుకొని చిన్న చిన్న ముక్కలుగా కట్ చేసి పెట్టుకోవాలి. అలాగే కరివేపాకును కూడా కట్ చేసి పెట్టుకోవాలి. 

Step-2: తర్వాత మిక్సింగ్ బౌల్ తీసుకొని అందులో బియ్యం పిండి, మైదా, సూజి(సన్న రవ్వ), శెనగపిండి, పచ్చిమిర్చి, క్యారెట్ తురుము, కరివేపాకు తురుము, జీలకర్ర పొడి, ఉప్పు, తగినన్ని నీళ్ళు పోసి(అప్రాక్సిమేట్ గా ఒక ఆరు కప్పులు)దోసె పిండిలా జారుడుగా కలుపుకోవాలి. 

Step-3: ఇప్పుడు పది పదిహేను నిమిషాల తర్వాత స్టౌ వెలిగించి, దోసె పాన్ పెట్టి వేడయ్యాక దోసె పోసుకొని పాన్ పూర్తిగా దోసెను రౌండ్ గా దిద్దుకొని పైన కొద్దిగా నూనె చల్లుకొని రెండు వైపులా బ్రౌన్ కలర్ వచ్చేంత వరకూ తక్కువ మంట మీద కాల్చుకోవాలి. 

Step-4: తర్వాత సర్వింగ్ ప్లేట్ లోనికి తీసుకొని మీకు ఇష్టమైన చట్నీ మరియు సాంబార్ తో వేడి వేడిగా సర్వ్ చేయాలి.

'''
  ],
  [
    "పాలక్ పెసరట్టు",
    "images/palak.JPG",
    ''' 
 పాలకూర: 5 కట్టలు 
 పెసరపప్పు: 1cup 
 బియ్యం: 1cup 
 ఉల్లిపాయలు: 3 
 టమోటలు: 3 
 పచ్చిమిర్చి: 6-8 
 చాట్ మసాలా: 1tsp 
 ఇంగువ: చిటికెడు 
 కొత్తిమీర తురుము: 1cup 
 కరివేపాకు: రెండు రెమ్మలు 
 ఉప్పు: రుచికి తగినంత 
 వెన్న: కొద్దిగా''',
    '''
 Step-1: ముందుగా బియ్యం, పెసరపప్పును నాలుగు నుండి ఆరు గంటలసేపు నానబెట్టుకోవాలి. 

 Step-2: తర్వాత పాలకూరను శుభ్రంగా కడిగిన తర్వాత చిన్ని చిన్న కట్ చేసి పెట్టుకోవాలి. దాంతో పాటు ఉల్లిపాయలు, టమోటాలు, పచ్చిమిర్చి కూడా తరిగి పక్కన పెట్టుకోవాలి. 

 Step-3: ఇప్పుడు మిక్సీలో నానబెట్టిన పెసరపప్పు, బియ్యం, పచ్చిమిర్చి, టమోటో, ఉప్పు, చిటికెడు ఇంగువ, కరివేపాకు, కొద్దిగా నీళ్ళు పోసి దోసె పిండిలా పేస్ట్ చేసుకోవాలి. 

 Step-4: తర్వాత రుబ్బుకొన్న బియ్యం పిండిలో కట్ చేసి పెట్టుకొన్న ఉల్లిపాయ, కొత్తమిర తురుము, పాలాకును సగం..సగం కలిపి పెట్టుకోవాలి. 

 Step-5: చిన్న బౌల్ తీసుకొని అందులో మిగినల సగం ఉల్లిపాయ తరుగు, కొత్తిమిర తరుగు, చాట్ మసాలను వేసి బాగా మిక్స్ పక్కన పెట్టుకోవాలి. 

 Step-6: ఇప్పుడు స్టౌ పై పాన్ పెట్టి నూనె రాసి వేడయ్యాక పెసర పిండి మిక్స్ పేస్ట్ ను దోసెలా పెనంపైన వేయాలి. తర్వాత వెంటనే దోసె పై ఉల్లిపాయ, చాట్ మసాలా మిశ్రమాన్ని చల్లుకొని కొద్దిగా నూనె వేసుకొని దోసె దోరగా కాలనివ్వాలి. దోసెను ప్లేట్ లోకి సర్వ్ చేసే ముందు కొద్దిగా వెన్న రాసి, హాట్ హాట్ గా సర్వ్ చేయాలి. అంతే పాలక్ పెసరట్టు రెడీ....

'''
  ],
  [
    "సేమియా ఉప్మా",
    "images/semya.jpg",
    ''' 
సేమియా (వెర్మిసెల్లి) - 2 cups 
నీరు: 1 ½cups 
ఉల్లిపాయ: 1 (చిన్న ముక్కలుగా తరిగినవి) 
గ్రీన్ బటానీలు: ½cup 
క్యారట్: 1 (సన్నగా తరిగినవి) 
టమోటో: 1 (చిన్న ముక్కలుగా తరిగినవి) 
పచ్చిమిర్చి: 2 (చిన్న ముక్కలుగా తరిగినవి) 
పసుపు: ¼ tsp 
ఆవాలు: 1tsp 
మినపప్పు: 1tsp 
శెనగపప్పు: ½ tsp 
కరివేపాకు: 6-7 
ఎండు మిర్చి: 1 
ఉప్పు: రుచికి సరిపడా 
ఆయిల్: 2tbsp''',
    ''' 
 Step-1: ముందుగా పాన్ వేడి చేసి అందులో నూనె వేసి లైట్ గా కాగిన తర్వాత అందులో సేమియా వేసి గోల్డ్ బ్రౌన్ కలర్ వచ్చే వరకూ వేయించుకోవాలి. 

 Step-2: తర్వాత వేరే ప్లేట్ లోనికి తీసుకొని పక్కన పెట్టుకొని చల్లారనివ్వాలి. 

 Step-3: తర్వాత అందులో ఒక టేబుల్ స్పూన్ నూనె వేసి కాగిన తర్వాత అందులో ఆవాలు, ఎండు మరి్చి, ఉద్దిపప్పు, శెనగపప్పు, కరివేపాకు వేసి ఒక నిముషం వేగించుకోవాలి.

 Step-4: తర్వాత అందులోనే ఉల్లిపాయలు కూడా వేసి మరో 5నిముషాలు మీడియం మంట మీద వేగించుకోవాలి. 

 Step-5: తర్వాత అందులో కొద్దిగా పసుపు, క్యారెట్, గ్రీన్ పీస్, పచ్చిమిర్చి మరియు టమోటో ముక్కలు కూడా వేసి మరో 5-6నిముషాలు వేగించుకోవాలి. 

 Step-6: మొత్తం మిశ్రమం వేగిన తర్వాత అందులో ముందుగా వేయించి పెట్టుకొన్న సేమియా, ఉప్పు, మరియు నీళ్ళు పోసి మొత్తం మిశ్రమాన్ని మిక్స్ చేయాలి. 

 Step-7: తర్వాత మూత పెట్టి 5-10నిముషాులు ఉడికించుకోవాలి. 

 Step-8: ఉడికిన తర్వాత మూత తీసి నీరు మొత్తం పూర్తిగా ఇమిరిపోయే వరకూ సిమ్ లో పెట్టి ఉడికించుకోవాలి . 

 Step-9: ఒక సారి నీరు మొత్తం డ్రై అయిన తర్వాత స్టౌ ఆఫ్ చేయాలి అంతే టేస్టీ అండ్ ఈజీ సేమియా ఉప్మా రెడీ. ఈ డిష్ ను కొబ్బరి చట్నీతో ఎంజాయ్ చేయవచ్చు.

'''
  ],
  [
    "మిక్డ్స్ వెజిటేబుల్ వడలు",
    "images/vada.JPG",
    ''' 
బీన్స్ ముక్కలు: 1cup 
క్యారెట్ ముక్కలు: 1/4cup 
పాలకూర: 1 1cup 
కొత్తిమీర: 1cup 
క్యాబేజీ: 1/2cup 
పచ్చిబఠాణీలు: 1/4cup 
గరం మసాల: 2tbsp 
పచ్చిమిర్చి: 6-8 
అల్లం వెల్లిల్లి పేస్ట్: 2tbsp 
బియ్యం పిండి: 1/2kg 
శెనగపిండి: 1 cup 
ఉప్పు: రుచికి తగినంత 
కరివేపాకు: 1/2cup 
నూనె: వేయించడానికి సరిపడా''',
    ''' 
Step-1: ముందుగా కరివేపాకు, కొత్తిమీర, పాలకూరలను శుభ్రం గా కడిగి, సన్నగా తరిగి పెట్టుకోవాలి. 

Step-2: తర్వాత పచ్చిబఠాణీలు, క్యారెట్స్, క్యాబేజీ, బీన్స్, ముక్కల్ని కొద్దిగా ఉప్పు వేసి కుక్కర్ లో ఒక విజిల్ వచ్చే వరకూ ఉడించి పెట్టుకోవాలి. 

Step-3: ఇప్పుడు ఒక వెడల్పాటి గిన్నెలో బియ్యం పిండి, శెనగపిండి, తరిగిన పాలకూర, కరివేపాకు, కొత్తిమీర, గరం మసాలా, పచ్చిమిర్చి, తగినంత ఉప్పు, ఉడికించిన క్యారెట్, క్యాబేజీ, బీన్స్ ముక్కలను కొద్దికొద్దిగా నీరు పోసుకుంటూ గారెల పిండిలా కలపాలి. 

Step-4: తర్వాత పాన్ లో నూనె వేసి వేడయ్యాక కలిపి పెట్టుకొన్న పిండిని గారెల్లా చేసుకుని, నూనెలో వేయించి బ్రౌన్ కలర్ వచ్చే వరకూ వేయించాలి. 

Step-5: అంతే వెజ్ గారెలు రెడీ. ఈ గారెల్ని టొమాటో సాస్ తోగానీ, కొబ్బరి చట్నీతో గానీ తింటే చాలా రుచిగా ఉంటాయి. ఆరోగ్యానికి మంచిది. సాయంత్రంవేళల్లో స్నాక్స్ లా తినడానికి బాగుంటాయి.
'''
  ],
  [
    "సోయా పాలక్ పరాటా",
    "images/parata.jpg",
    ''' 
సోయా పిండి: 1/2kg 
పాలకూర: 4కట్టలు 
పచ్చిమిర్చి: రుచికి సరిపడా 
అల్లం: 2tsp 
దనియాల పొడి: 1/2tsp 
గరం మసాలా: 1/2tsp 
నిమ్మరసం: 1tsp 
ఉప్పు: రుచికి సరిపడా 
నూనె: వేయించడానికి''',
    ''' 
Step-1: ముందుగా పాలకూరను శుభ్రంగా కడిగి చిన్న ముక్కలుగా చేయాలి. పచ్చిమిర్చి కూడా సన్నని ముక్కలుగా కోయాలి. వీటన్నింటిని సోయాపిండిలో వేసి కలిపి చపాతి ముద్దలా చేసుకోవాలి. 

Step-2: ఇప్పుడు ఈ ముద్దపై తడిబట్ట కప్పి అరగంట పాటు కప్పి నాననివ్వాలి. తర్వాత దీనిని చిన్న ఉండలుగా చేసుకోవాలి. 

Step-3: తర్వాత చపాతీల్లా వత్తుకొని, పాన్ మీద కొద్దిగా ఆయిల్ వేసి రెండువైపులా కాల్చుకోవాలి. అంతే సోయా పాలక్ పరోటా రెడీ. దీన్ని పెరుగు పచ్చడితో వేడిగా తింటే చాలా రుచిగా ఉంటుంది.

'''
  ],
  [
    "మైసూర్ బోండా",
    "images/biyyam1.jpg",
    ''' 
  మైదా: 3cups 
  బియ్యపు పిండి: 1cup 
  సూజి(రవ్వ): 1/4cup 
  ఉప్పు: రుచికి తగినంత 
  పెరుగు: 1cup 
  ఉల్లిపాయ ముక్కలు: 1/2cup 
  అల్లం ముక్కలు: కొద్దిగా 
  పచ్చిమిర్చి: 4-6(ముక్కలుగా) 
  కొబ్బరి ముక్కలు: 1tbsp 
  జీలకర్ర: 1tsp 
  కొత్తిమీరం: కొద్దిగా 
  వంటసోడా: 1tsp 
  నూనె: వేయించటానికి సరిపడా''',
    ''' 
  step-1: మైదాను జల్లించి ఒకగిన్నెలో వేసి, బియ్యపు పిండి, టీ స్పూన్ నూనె, ఉప్పు, పెరుగు, సూజీ, వంటసోడా, ఉల్లి ముక్కలు, అల్లం ముక్కలు, మిర్చి ముక్కలు, కొత్తిమీర, జీలకర్ర వేసి చిక్కగా బజ్జి పిండిలా కలపాలి. 

  Step-2: దీనిని అరగంట పక్కన పెట్టాలి. 

  Step-3: ఇప్పుడు స్టౌ పైన పాన్ పెట్టి నూనె సోసి వేడి చేయ్యాలి. నూనె కాగాక మైదాపిండిని చిన్నచిన్న ఉండలుగా చేతితో తీసి నూనెలో దోరగా వేగాక ఒక ప్లేటులోకి తీసుకోవాలి. వీటిని వేడిగా ఉన్నప్పుడు ఏ పచ్చడితో తిన్న రుచిగా ఉంటాయి.

'''
  ],
  [
    "వెజ్ కిచిడీ",
    "images/ravapuli.jpg",
    ''' 
బాస్మతి బియ్యం: 2cups 
పెసరపప్పు : 1cup 
లవంగాలు: 5 
అల్లం వెల్లులి ముద్ద: 2tsp 
బఠాణీలు : 150grms 
క్యారట్ : 1 
ఉల్లిగడ్డలు: 3 
కారం: 1tsp 
పసుపు : 1tps 
జీలకర : 1tsp 
ఆవాలు : 1tsp 
బే ఆకులు: 2 
గరం మసాలా: 1tsp 
నూనె : తగినంత 
నీరు : తగినంత 
ఉప్పు: రుచికి సరిపడా''',
    ''' 
Step-1: ముందుగా బియ్యం, పప్పు కలిపి గంటసేపు నానబెట్టాలి. 

Step-2:తర్వాత ఒక పాత్రలో నూనె పోసి కాగిన తర్వాత జీలకర్ర, ఆవాలు వేసి చిటపటలాడాక మిగిలిన మసాలా దినుసులన్నీ వేయాలి. 

Step-3: ఇప్పుడు కూరగాయ ముక్కలు, బఠాణీలు వేయించాలి. తర్వాత బియ్యం, పప్పు వేసి పది నిమిషాలు వేయించి అందులో ఐదు కప్పుల నీరు పోసి ప్రెషర్ కుక్కర్‌లో మూడు విజిల్స్ వచ్చే వరకూ ఉడికిస్తే ‘వెజిటబుల్ కిచిడీ'రెడీ. పెరుగు రైతాతో కలిపి తింటే మంచి రుచిగా ఉంటది.
'''
  ]
];
List<List> veg = [
  [
    'పెసరపప్పు ఆకుకూర కర్రీ',
    'టొమాటో కుర్మా',
    'టొమాటో గ్రేవీ‌',
    'టొమాటో-పన్నీర్ కూర',
    'ఉసిరికాయ పప్పు',
    'మునగాకు పప్పు‌',
    'దొండకాయ గుత్తికూర',
    'ఆలూ చిక్కుడు కాయ ఫ్రై',
    'బెండకాయ ఫ్రై',
    'గుత్తి వంకాయ కర్రీ',
    'చిక్కుడు డోక్లీ',
    'కాకరకాయ వేపుడు కర్రీ',
    'పన్నీర్ క్యాప్సికమ్ మసాలా',
  ],
  [
    "పెసరపప్పు ఆకుకూర కర్రీ",
    "images/aaku2.jpg",
    ''' 
  పెసరపప్పు - 1 cup 
  ఆకుకూర - 3 cups(మీకు నచ్చినది) 
  ఉల్లిపాయ- 2 (సన్నగా తరిగి పెట్టుకోవాలి) 
  వెల్లుల్లి- 4-5రెబ్బలు 
  అల్లం: 1 piece 
  పచ్చిమిర్చి- 5 (మద్యలోకి కట్ చేసుకోవాలి) 
  టమోటోలు- 2 (సన్నగా తరిగి పెట్టుకోవాలి) 
  పసుపు- 1/2 tsp 
  జీలకర్ర - 1/2 tsp 
  గరం మసాలా- 1 tsp 
  కోకనట్ మిల్క్ - 3/4 cup 
  ఉప్పు: రుచికి సరిపడా 
  నూనె- 2 tbsp 
  ఇంగువ: చిటికెడు నీళ్ళు- 2 cups''',
    ''' 
  Step-1: ముందుగా ప్రెజర్ కుక్కర్లో కొద్దిగా నూనె వేసిన వేడి అయిన తర్వాత అందులో పోపుదినుసులు, ఇంగువ, పసుపు, అల్లం, వెల్లుల్లి, పచ్చిమిర్చి, ఉల్లిపాయ ముక్కలు వేసి మీడియం మంట మీద ఫ్రై చేసుకోవాలి. 

  Step-2: పోపు వేగిన తర్వాత అందులో టమోటో ముక్కలు కూడా వేసి కొద్దిమెత్తబడే వరకూ ఫ్రై చేయాలి. 

  Step-3: ఇప్పుడు అందులోనే పప్పు, నీళ్ళు, ఉప్పు వేసి మొత్తం మిశ్రమాన్ని కలగలుపుకొని, మూత పెట్టి రెండు మూడు విజిల్స్ వచ్చే వరకూ ఉడికించుకోవాలి. 

  Step-4: ఉడికిన తర్వాత మూత తీసి మొత్తం మిశ్రమాన్ని కలుపుకోవాలి. 

  Step-5: ఇప్పుడు అందులో శుభ్రం చేసి, కట్ చేసి పెట్టుకొన్న ఆకుకూర, కొబ్బరి పాలు, లేదా క్రీమ్, కొద్దిగా గరం మసాలా వేసి ఉడికించుకోవాలి. 

  Step-6: అవసరం అయితే కొద్దిగా నీళ్ళు కూడా మిక్స్ చేసి తిరిగి ఉడికించుకోవాలి. 

  Step-7: ఆకుకూర మొత్తగా ఉడికేవరకూ 10నిముషాలుఉడికించుకొని తర్వాత స్టౌ ఆఫ్ చేయాలి. అంతే ఆకుకూర పెసరపప్పు రెడీ.'''
  ],
  [
    "టొమాటో కుర్మా",
    "images/tomato.jpg",
    '''
  టమోటో: 4(చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  ఉల్లిపాయలు: 1 (చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  పచ్చిమిర్చి: 2 (chopped) 
  అల్లం: 1చిన్న ముక్క 
  వెల్లుల్లి రెబ్బలు: 5 (చితగొట్టుకోవాలి) 
  పసుపు: 1/2tsp 
  కారం: 1tsp 
  ధనియాల పొడి: 1tsp 
  గసగసాలు: 1tsp 
  సోంపు: 1tsp 
  జీలకర్ర: 1tsp 
  కొబ్బరి తరుము: 2tbsp 
  జీడిపప్పు: 8 
  ఆవాలు: 1/2tsp 
  కరివేపాకు: రెండు రెమ్మలు 
  ఉప్పు: రుచికి సరిపడా 
  నూనె: 2tbsp''',
    ''' 
  Step-1: ముందుగా గసగసాలు, జీలకర్ర, సోంపు, కొబ్బరి తురుము, జీడిపప్పు మిక్సీలో వేసి కొద్దిగా నీళ్లు పోసి మెత్తగా పేస్ట్ తయారు చేసుకోవాలి. 

  Step-2: తర్వాత డీప్ బాటమ్ పాన్ లో నూనె వేసి, కాగినత తర్వాత ఆవాలు వేసి చిటపటలాడిన తర్వాత కరివేపాకు, మరియు పచ్చిమిర్చి వేసి వేగించాలి. 

  Step-3: తర్వాత ఉల్లిపాయ ముక్కకూడా వేసి 3-4నిముషాల పాటు వేగించుకోవాలి. ఉల్లిపాయ ముక్కలు బ్రౌన్ కలర్ కు మారిన తర్వాత అల్లం, వెల్లుల్లి ని వేసి మరో రెండు నిముషాలు వేగిస్తూ బాగా మిక్స్ చేయాలి. 

  Step-4: ఇప్పుడు అందులోనే టమోటో ముక్కలు మరియు ఉప్పు తో పాటు పసుపు, కారం మరియు ధనియాల పొడి వేసి, అన్ని బాగా కలగలుపుతూ మరో 5నిముషాల పాటు తక్కువ మంట మీద ఉడికించుకోవాలి. 

  Step-5: ఈ వేగించే మిశ్రంమీద ఆయిల్ తేలుతూ గ్రేవీలా తయారవుతుంది. ఇప్పుడు రెండు కప్పుల నీళ్ళు పోసి బాగా ఉడికించాలి. ఇప్పుడు అందులో ముందుగా పేస్ట్ చేసి పెట్టుకొన్నగసగసలా మిశ్రమాన్ని మిక్స్ చేసి బాగా కలగలిపి మరో ఐదునిముషాల పాటు ఉడికించాలి. మద్య మద్యలో కలుపుతుండాలి. అంతే టమోటో కుర్మా రెడీ. ఈ టమోటో కుర్మాను దోసకి చాలా టేస్టీగా ఉంటుంది. అంతే కాదు లెమన్ రైస్ మరియు పులావ్ వంటి వాటి చాలా బాగా ఉంటుంది.

'''
  ],
  [
    "టొమాటో గ్రేవీ",
    "images/tomato.jpg",
    '''
ఎండు మిర్చి: 4 
ధనియాలు: 2tsp 
జీలకర్ర: 1/2tsp 
మిరియాలు: 1tsp 
వాము: 1/2tsp 
దాల్చిన చెక్క: కొద్దిగా 
లవంగాలు: 3 
యాలకులు: 3 
అనాసపువ్వు: 1

పేస్ట్ కోసం కావల్సిన పదార్థాలు: 

పెద్ద ఉల్లిపాయలు: 4 
పచ్చిమిర్చి: 4 
వెల్లుల్లి రెబ్బలు: 6 
అల్లం: చిన్న ముక్క

గ్రేవీకోసం కావల్సిన పదార్థాలు: 

టమోటోలు: 4-5 
కొబ్బరి పేస్ట్: 2tsp 
బిర్యానీ ఆకులు: 2 
కస్తూరీ మేథీ: 1/2tsp 
కారం: 1tsp 
ధనియాలపొడి : 1tsp 
పసుపు: 1/4tsp 
కరివేపాకు: రెండు రెమ్మలు 
కొత్తిమీర తరుగు కొద్దిగా 
నూనె : సరిపడా 
ఉప్పు : రుచికి తగినంత''',
    '''
 Step-1: ముందుగా మిక్సీ జార్ లో ఎండుమిర్చి, ధనియాలు, జీలకర్ర, మిరియాలు, వాము, దాల్చిన చెక్క, లవంగాలు, యాలకులు, అనాసపువ్వు వేసి మసాలా పొడిని తయారుచేసుకోవాలి. 

 Step-2: తర్వాత పేస్ట్ కోసం సిద్దంగా పెట్టుకొన్న పదార్థాలను వేరే జార్ లో వేసి పేస్ట్ లా చేసి పక్కన పెట్టుకోవాలి . 

 Step-3: ఇప్పుడు పాన్ లో నూనె వేడి చేసి బిర్యానీ ఆకులు, కస్తూరీమేథీ, కరివేపాకు వేసి, ఒక నిముషం వేగించుకోవాలి. 

 Step-4: ఆ తర్వాత ఉల్లిపాయ పేస్ట్ వేసి అది వేగాక టమోటో ముక్కలు, కారం, ధనియాలపొడి, పసుపు, రుచికి సరిపడా ఉప్పు వేసి మీడియం మంట మీద వేగిస్తుంటే ఇది గ్రేవీలా తయారవుతుంది. 

 Step-5: గ్రేవీలా ఉడికే సమయంలో అందులోనే కొబ్బరి పేస్ట్, ముందుగా తయారుచేసుకొన్న మసాలా పేస్ట్ వేసి బాగా కలగలిపి, 5నిముషాలు ఉడికించి 5 నిముషాల తర్వాత దింపేసుకోవాలి. 

 Step-6: అవసరం అయితే కొద్దిగా నీళ్ళు పోసి కొద్దిగా పల్చగా కూడా తయారుచేసుకోవచ్చు. 

Step-7: అంతే టమోటో గ్రేవీ రిసిపి రెడీ. దీన్ని రోటీలతో కలిపి తింటే చాలా టేస్ట్ గా ఉంటుంది. వెరైటీ కావాలనుకుంటే టమోటో గ్రేవీలోనే కొన్ని రకాల కూరగాయముక్కలు లేదా ఉడికించిన మటన్ లేదా చిక్న్ లేదా కోడిగుడ్లు జత చేసి ఉడికించుకోవచ్చు.

'''
  ],
  [
    "టొమాటో-పన్నీర్ కూర",
    "images/paneer.jpg",
    '''
  పనీర్: 250gms (మీడియం సైజ్ ముక్కలుగా కట్ చేసుకోవాలి) 
  ఉల్లిపాయ: 2 
  టమోటా: 2 
  పసుపు: 1tsp 
  కారం: 1tsp 
  గరం మసాలా: ½tsp 
  పచ్చిమిరపకాయలు: 4 
  టమోటా సాస్: 1tsp 
  బిర్యానీ ఆకు: 1 
  జీలకర్ర: ½tsp 
  ఉప్పు: రుచికి సరిపడా 
  నూనె: 2tbsp''',
    '''
  Step-1: ముందుగా ఫ్రైయింగ్ పాన్ లో నూనె వేసి, వేడయ్యాక అందులో పన్నీర్ ముక్కలు వేసి మంట మీడియంగా పెట్టి 5-10నిముషాలు వేగించుకోవాలి. అవి బ్రౌన్ కలర్ వచ్చే వరకూ వేగించుకోవాలి. తర్వాత వీటిని ఒక ప్లేట్ లోనికి తీసి పక్కన పెట్టుకోవాలి. 

  Step-2: తర్వాత మిక్సీలో ఉల్లిపాయ, మరియు పచ్చిమిర్చి వేసి మెత్తని పేస్ట్ లా తయారు చేసుకోవాలి. 

  Step-3: తర్వాత అదే ఫ్రైయింగ్ పాన్ లో మరికొద్దిగా నూనె వేసి, బిర్యానీ ఆకు, జీలకర్ర వేసి వేగించుకోవాలి. పుల్లని త్రేన్పులను తొలగించడానికి పసుపును ఎలా ఉపయోగించాలి. 

  Step-4: ఇప్పుడు అందులోనే ఉల్లిపాయ, పచ్చిమిర్చి పేస్ట్ వేసి రెండు నిముషాలు వేగించుకోవాలి. 

  Step-5: అంతలోపుటమోటోను గుజ్జుగా తయారు చేసుకోవాలి(మిక్సీలో పేస్ట్ చేసుకోవాలి) 

  Step-6: తర్వాత వేగుతున్న మిశ్రమంలో కొద్దిగా ఉప్పు, పసుపు వేయడం వల్ల టమోటో త్వరగా ఉడుకుతుంది.  

  Step-7: ఒకసారి గా ఉల్లిపాయ పేస్ట్ బ్రౌన్ కలర్ కు మారగానే, టమోటో గుజ్జును అందులో వేయాలి. అలాగే కారం, టమోటో సాస్, మరియు గరం మసాలా వేసి, బాగా మిక్స్ చేస్తూ వేగించుకోవాలి. 

  Step-8: ఎక్కువ మంట పెట్టి 2-3నిముషాలు ఉడకనివ్వాలి. తర్వాత మంటను మీడియంగా పెట్టి, అందులో పన్నీర్ క్యూబ్స్ వేసి మరో ఐదు నిముషాలు ఉడికించుకోవాలి. అంతే పన్నీర్ టమోటో గ్రేవీ రెడీ. చివరగా కొత్తిమీర ఆకులతో గార్నిస్ చేసి, వేడి వేడిగా సర్వ్ చేయాలి. రోటీ, రైస్, చపాతీలకు మంచి కాంబినేష్.

'''
  ],
  [
    "ఉసిరికాయ పప్పు",
    "images/aaku2.jpg",
    ''' 
కందిపప్పు: 100grm
ఉసిరికాయలు: 10
నూనె: తగినంత
పసుపు: చిటికెడు
ఇంగువ: చిటికెడు
ఉప్పు: రుచికి సరిపడా
పచ్చిమిర్చి: 4
ఎండుమిర్చి: 4
ఆవాలు: 1tsp
జీలకర్ర: 1tsp
మినప్పప్పు: 1tsp
కరివేపాకు: రెండు రెమ్మలు
కొత్తిమీర: రెండు రెమ్మలు''',
    ''' 
Step-1: ముందుగా ఉసిరికాయలను ముక్కలు చేసుకోవాలి. 

Step-2: తర్వాత కందిపప్పు, ఉసిరిముక్కలను విడివిడిగా ఉడకబెట్టాలి. 

Step-3: ఇప్పుడు పాన్ లో నూనె వేసి వేడయ్యాక మినప్పప్పు, ఆవాలు, జీలకర్ర, ఇంగువ, పసుపు, ఎండుమిర్చి, పచ్చిమిర్చి, కరివేపాకు వేసి దోరగా వేగించుకోవాలి. 

Step-4: తరవాత పక్కన పెట్టుకున్న ఉడికించుకున్న ఉసిరిముక్కలను అందులో వేసి ఒకసారి దోరగా వేయించాలి. చివరగా ఉడికించుకున్న పప్పు, ఉప్పులను అందులో వేసి కొత్తిమీరతో గార్నిష్ చేయాలి అంతే ఉసిరికాయ పప్పు రెడీ.

'''
  ],
  [
    "మునగాకు పప్పు",
    "images/aaku2.jpg",
    ''' 
మునగాకు : 1cup 
కందిపప్పు : 1/2cup 
చింతపండు : కొద్దిగా 
పచ్చిమిర్చి : 8 (పొడవుగా కట్ చేయాలి) 
ధనియాలు : 1tsp 
నూనె : తగినంత 
మిరియాలు : 6గింజలు 
జీలకర్ర : టీ స్పూను 
వెల్లుల్లిరేకలు : 10 
కరివేపాకు : రెండు రెమ్మలు 
ఉప్పు: రుచికి తగినంత 
పసుపు : తగినంత''',
    ''' 
Step-1: ముందుగా ఒక గిన్నెలో కందిపప్పు, మునగాకు వేసి కుకర్‌లో పెట్టి మెత్తగా ఉడికించాలి. ఈ మిశ్రమం చల్లారిన తరవాత మిక్సీలో వేసి మెత్తగా గ్రైండ్ చేసుకోవాలి. 

Step-2: స్టౌ మీద ఒక మందపాటి గిన్నెను ఉంచి అందులో చింతపండురసం, ఉప్పు, పసుపు, కందిపప్పు మునగాకు మిశ్రమం వేసి బాగా మరిగించాలి. 

Step-3: తర్వాతఒక బాణలిలో ఆవాలు, ఎండుమిర్చి, పచ్చిమిర్చి, కరివేపాకు వేసి వేయించి పక్కన ఉంచుకోవాలి. తరవాత అందులోనే మరికాస్త నూనె వేసి కాగాక ధనియాలు, జీలకర్ర, మిరియాలు వేసి కొద్దిగా వేగాక తీసి పక్కన ఉంచుకోవాలి. 

Step-4: చల్లారిన తరవాత వాటిని మిక్సీలో వేసి మెత్తగా గ్రైండ్ చేశాక, అందులోనే వెల్లుల్లి వేసి మరోమారు తిప్పి తీసేయాలి. చివరగా మరుగుతున్న చారులో ఈ పొడి, తాలింపు వేసి ఒక్క పొంగు రానిచ్చి దింపేయాలి. అంతే మునగాకు పప్పుచారు రెడీ.

'''
  ],
  [
    "దొండకాయ గుత్తికూర",
    "images/dondakay.jpg",
    ''' 
దొండకాయలు: 20 
జీలకర్ర: 1tsp 
శనగపప్పు: 5tsp 
ఎండుమిర్చి: 4 
వెల్లుల్లి :5 రెబ్బలు 
ఉప్పు: రుచికి సరిపడా 
నూనె: 2tsp 

తాలింపు కోసం: 

నూనె: కావలసినంత 
ఆవాలు: 1/2tsp 
జీలకర్ర: 1/2tsp 
మినప్పప్పు: 1/2tsp 
కరివేపాకు: రెండు రెమ్మలు''',
    ''' 
Step-1: మొదటగా జీలకర్ర, శనగపప్పు, ఎండుమిర్చి దోరగా వేగించి పక్కన పెట్టుకోవాలి. 

Step-1: తర్వాత కొద్ది ఆరకా, జిలకర్ర, శనగపప్పు, ఎండుమిర్చి, వెల్లుల్లి, ఉప్పు కలిపి పొడి కొట్టి, ఒక టీ స్పూను నూనె కలపాలి. 

Step-1: దొండకాయలకు(మూడొంతులు)నిలువుగా కత్తితో పెట్టి ఈ మిశ్రమం అందులో కూరి అరగంట పక్కనుంచాలి. 

Step-1: పాన్ లో నూనె వేడెక్కాక ఈ దొండకాయల్ని సన్నని సెగమీద మగ్గించాలి. తర్వాత మరో పాన్ లో తాలింపు వేసి మగ్గిన దొండకాయల్ని విరక్కుండా వేగించి దించేయాలి అంతే దొండకాయ గుత్తికూర రెడీ.

'''
  ],
  [
    "ఆలూ చిక్కుడు కాయ ఫ్రై",
    "images/chikkudkay.jpg",
    '''
ఆలు: 5-6 (పొట్టు తీసి, శుభ్రంగా కడిగి సన్నగా కట్ చేసుకోవాలి) 
చిక్కుడు కాయలు: 1/2kg(మద్యకు కట్ చేసి పెట్టుకోవాలి) 
పచ్చిమిర్చి: 2(తరిగినవి) 
ఉల్లిపాయ: 1(సన్నగా తరిగిపెట్టుకోవాలి) 
పసుపు: 1tsp 
మెంతిపొడి: చిటికెడు 
కారం: 1tsp 
ధనియాల పొడి: ½tsp 
జీలకర్ర: 1tsp 
కరివేపాకు: రెండు రెమ్మలు 
వెల్లుల్లి రెబ్బలు: 4 
ఉప్పు: రుచికి సరిపడా 
ఆయిల్: 1tbsp''',
    ''' 
Step-1: ముందుగా ఫ్రైయింగ్ పాన్ లో కొద్దిగా నూనె వేసి, అందులో జీలకర్ర వేసి ఒక నిముషం వేగించుకోవాలి. తర్వాత ఉల్లిపాయ, పచ్చిమిర్చి, కరివేపాకు వేసి ఉల్లిపాయలు బ్రౌన్ కలర్ వచ్చే వరకూ వేగించుకోవాలి. 

Step-2:  తర్వాత అందులోనే కట్ చేసిన పెట్టుకొన్నబంగాళదుంప ముక్కలు వేసి, మీడయం మంట మీద 5నిముషాలు ఫ్రై చేసుకోవాలి. 

Step-3:  తర్వాత అందులో కట్ చేసిన చిక్కుడు కాయ వేసి, మిక్స్ చేస్తూ మరో 3నిముషాలు ఫ్రై చేసుకోవాలి. అలాగే అందులో ఉప్పు మరియు పసుపు, మెంతిపొడి, వెల్లుల్లి రెబ్బలు కూడా వేసి వేయించాలి. 

Step-4:  తర్వాత మంట పూర్తిగా తగ్గించి 6-10నిముషాలు ఫ్రై చేసుకోవాలి. పాన్ కు మూత పెట్టి, ఉడికించుకోవాలి. మద్య మద్యలో కలియబెడుతుండాలి. 

Step-5:  ఆలూ ఉడికే లోపు, చిక్కుడు కాయ కూడా మెత్తబడుతాయి. తర్వాత అందులో కారం, ధనియాల పొడి కూడా వేసి, అన్నింటిని మిక్స్ చేసి, స్టౌ ఆఫ్ చేసుకోవాలి. అంతే డ్రై అండ్ క్రిస్పీ ఆలూ అండ్ బోర్డ్ బీన్స్ ఫ్రై రెడీ. దీన్ని రోటీలకు సైడ్ డిష్ గా మరియు రైస్ -దాల్ కు సైడ్ డిష్ గా సర్వ్ చేయవచ్చు.'''
  ],
  [
    "బెండకాయ ఫ్రై",
    "images/bendakay.jpg",
    '''
బెండకాయ: 250grms(చివర్లు కట్ చేసి, మద్యలో నుండి కట్ చేసుకోవాలి) 
ఉల్లిపాయ: 1(సన్నగా కట్ చేసుకోవాలి) 
టమోటో: 1(సన్నగా తరిగిపెట్టుకోవాలి) 
కారం: tsp 
ఆమ్చూర్ పౌడర్ (డ్రై మ్యాంగో పౌడర్): 1tsp 
గరం మసాల: 1tsp 
కాలౌంజి: 1/2tsp 
ఇంగువ: చిటికెడు 
గోధుమపిండి: 2tbps 
నూనె: 2tbsp 
ఉప్పు: రుచికి సరిపడా''',
    ''' 
Step-1: ముందుగా బెండాకాయలను శుభ్రం చేసి మీకు కావల్సిన సైజ్ లో కట్ చేసుకోవాలి. 

Step-2: ఇప్పుడు బెండకాయలకు ఉప్పుపౌడర్ మసాలా, కారం, ఆమ్య్చూర్ పౌడర్ మరియు గరం మసాలా వేసి మ్యారినేట్ చేసి పెట్టుకోవాలి. 

Step-3: ఇలా మ్యారినేట్ చేసి పెట్టుకొన్న బెండకాయల ముక్కలను 10-15నిముషాలు పక్కన పెట్టుకోవాలి. అంతలోనూ ఉల్లిపాయలు మరియు టమోటోలు వంటి వాటిని కట్ చేసి పెట్టుకోవాలి. 

Step-4: 15నిముషాల తర్వాత పాన్ లో నూనె వేసి వేడి అయ్యక , చిటికెడు ఇంగువ మరియు క్యారమ్ సీడ్స్(అజినోమ్యాటో)వంటివి వేసి వేగించుకోవాలి. 

Step-5: ఇప్పుడు ఉల్లిపాయ ముక్కలు వేసి మీడియం మంట మీద 2-3నిముషాలు వేగించుకోవాలి. 

Step-6: తర్వాత మ్యారినేట్ చేసి బెండకాయ ముక్కల మీద శెనగపిండి చిలకరించి బాగా మిక్స్ చేయాల. వీటిని వేగుతున్న మసాలాలో వేసి 10 నిముషాలు బాగా ఫ్రై చేసుకోవాలి. 

Step-7: బెండకాయ ముక్కలు 10నిముషాలు వేగిన తర్వాత అందులో ఉప్పు వేసి 5 నిముషాలు మీడియం మంట మీద ఫ్రై చేసుకోవాలి. మెత్తగా ఉడికేవరకూ మంటన్ సిమ్ లో పెట్టి ఫ్రై చేసుకోవాలి. అంతే ఇండియన్ స్టైల్ బెండకాయ ఫ్రై రెడీ రోటీలకు సైడ్ డిష్ గా సర్వ్ చేయవచ్చు.

'''
  ],
  [
    "గుత్తి వంకాయ కర్రీ",
    "images/vankay.jpg",
    ''' 
  చిన్న వంకాయలు: 1/2kg 
  పల్లీలు: 50grms 
  నువ్వులు: 50grms 
  ధనియాలు: 2tsp 
  అల్లం వెల్లుల్లి పేస్టు: 2tsp 
  కారం: 11/2tsp 
  ఉప్పు: రుచికి తగినంత 
  ఉల్లిపాయలు: 2 
  కొబ్బరి తురుము: 2tsp 
  చింతపండు: 50grms 
  పసుపు: 1/4tsp 
  
  గ్రేవీ కోసం: 
  
  కొబ్బరి తురుము, 
  పల్లిల పొడి, 
  అల్లం వెల్లులి పేస్టు, 
  చింతపండు, 
  కారం, 
  పసుపు, 
  ఉప్పు, 
  ఉల్లిపాయలు, కలిపి మిక్సిలో వేసి మెత్తటి పేస్ట్ లా తయారుచేసుకోవాలి.

  పోపు కోసం: 

  ఎండు మిర్చి: 5 
  ఆవాలు: ఒక టీ స్పూన్ 
  మినపప్పు : ఒక టీ స్పూన్ 
  పచ్చి సెనగ పప్పు : ఒక టీ స్పూన్ 
  నూనె: కావలసినంత''',
    ''' 
  Step-1: తొడిమలు తీయకుండా వంకాయలను నాలుగు బాగాలుగా గాట్లు పెట్టి నీళ్ళలో వెయ్యాలి . పల్లీలు, నువ్వులను విడి విడిగా వేయించి పొడి చేసి పెట్టుకోవాలి. 

  Step-2: గాటు పెట్టిన వంకాయలను పల్లి , నువ్వుల పొడితో నింపాలి . 

  Step-3: స్టౌ పై పాన్ పెట్టి, పోపు దినుసులు, ఉల్లిపాయలు వేసి కాసేపు వేయించిన తరువాత స్టఫ్ చేసిన వంకాయలు అందులో వేయాలి. అయిదు నిమిషాలు బాగా వేగిన తరువాత గ్రేవి కోసం తయారు చేసుకొన్న మసాల పేస్ట్ ను, కొద్దిగా నీరు పోసి ఉడికించాలి బాగా వుడికినట్టు అనిపించాక చింతపండు రసం పోసి మరికొద్దిసేపు ఉడకనివ్వాలి. చివరగా కొత్తిమీరతో గార్నిష్ చేసుకోవాలి. చపాతి తో గాని, రైస్ తో గాని సర్వే చేసుకుంటే బాగుంటుంది.
'''
  ],
  [
    "చిక్కుడు డోక్లీ",
    "images/chikkudkay.jpg",
    '''
  చిక్కుడుకాయలు: 1/2kg 
  మెంతికూర తురుము: 1/2cup 
  కొత్తిమీర తురుము: 2tbsp 
  గోధుమపిండి: 1/2cup 
  నూనె: తగినంత 
  ఇంగువ: 1/2tsp 
  షాజీరా: 1/2tsp 
  పచ్చిమిర్చి తురుము: 1tsp 
  అల్లం తురుము: 1tsp 
  నిమ్మరసం: 1tsp 
  ఉప్పు: రుచికి సరిపడా 
  పంచదార: రుచికోసం కొద్దిగా
''',
    ''' 
Step-1: ముందుగా చిక్కుడకాయలు కడిగి చివర్లు తుంచి రెండు ముక్కలుగా కట్ చేసి పెట్టుకోవాలి. 

Step-2: తర్వాత గోధుమపిండిలో సన్నగా తరిగిన మెంతికూర, చిటికెడు పసుపు, కాస్త ఇంగువ, షాజీరా, ఉప్పు, టేబుల్ స్పూన్ నూనె, కొద్దిగా నీళ్లు పోసి కలపాలి. వీటిని చిన్న చిన్న ఉండలుగా చేసుకోవాలి. ఇవే డోక్లీలు. 

Step-3: ఇప్పుడు పాన్ లో నూనె వేసి కాగిన తర్వాత ఇంగువ, చిక్కుడు కాయలముక్కలు వేయాలి. ఇందులో షాజీరా, అల్లం తురుము, పచ్చిమిర్చి తురుము, ఉప్పు వేసి కలిపి మూతపెట్టాలి. 

Step-4: చిక్కుడు కాయముక్కలు కాస్త మెత్తబడ్డాక ఒకటిన్నర కప్పు నీళ్లు పోసి పైన మూత పెట్టి అందులో అరకప్పు నీళ్లు పోయాలి. అవి ఆవిరయిపోతే మళ్లీ పోసి ఉడికించాలి. ముక్కలన్నీ ఉడికిన తర్వాత డోక్లీలు వేసి అవసరమైతే కాసిన్ని నీళ్లు పోసి మూత పెట్టి ఉడికించాలి. 

Step-5: పైన ప్లేట్ లో నీళ్లు ఆవిరయిపోతే మళ్లీ పోసి కాసేపు ఉడికించాలి. డోక్లీలు గ్రేవీలో ఉడికి మంచి వాసన వస్తుండగా కొత్తిమీర కలిపి దించాలి.
'''
  ],
  [
    "కాకరకాయ వేపుడు కర్రీ",
    "images/kakarkay.jpg",
    ''' 
  కాకరకాయ: 6 (సన్నగా రౌండ్ గా కట్ చేసుకోవాలి) 
  పచ్చిశెనగపప్పు: 1tbsp 
  జీలకర్ర : ½ tsp 
  ఆవాలు: ½ tsp 
  కరివేపాకు: 7-8 
  వెల్లుల్లి రెబ్బలు: 5 
  ఎండు మిర్చి: 3 
  కొబ్బరి తురుము: ½cup 
  పసుపు పొడి: ½tsp 
  ఎర్ర కారం పొడి: 1tsp 
  ఉప్పు: రుచికి సరిపడా 
  నూనె: 2tbsp 
  నూనె: డీప్ ఫ్రైకి సరిపడా''',
    '''
  Step-1: ముందుగా కాకరకాయను సన్నగా గుండ్రంగా తరిగి, ఉప్పు నీటిలో వేసి కడిగి పక్కన పెట్టుకోవాలి. తర్వాత పసుపు, ఉప్పు కొద్దిగా చిలకరించి 10-15 మ్యారినేట్ చేసి పక్కన పెట్టుకోవాలి. 

  Step-2: తర్వాత కాకరకాయ ముక్కలను చేతిలోకి తీసుకొని రసాన్ని పిండేసి, తర్వాత పక్కన పెట్టుకోవాలి. 

  Step-3: ఇప్పుడు డీప్ ఫ్రైయింగ్ పాన్ లో కొద్దిగా నూనె కాగిన తర్వాత అందులో కాకరకాయ ముక్కలు వేసి 4-5నిముషాలు మీడియం మంట మీద ఫ్రై చేసుకోవాలి. అవి క్రిస్పీగా మరియు బ్రౌన్ కలర్ లోకి మారగానే మరో ప్లేట్ లోకి తీసి పక్కన పెట్టుకోవాలి. 

  Step-4: తర్వాత మిక్సీ జార్ లో కొబ్బరి తురుము, వెల్లుల్లి మరియు కారం వేసి మొత్తగా పౌడర్ చేసుకోవాలి. 

  Step-5: ఇప్పుడు మరో పాన్ స్టౌ మీద పెట్టి, కొద్దిగా నూనె వేసి వేడి చేయాలి. తర్వాత అందులో జీలకర్ర, శెనగపప్పు, ఆవాలు, ఎండు మిర్చి, కరివేపాకు ఒకదాని తర్వాత ఒకటి వేసి ఒక నిముషం ఫ్రై చేసుకోవాలి. 

  Step-6: తర్వాత మిక్సీలో గ్రైండ్ చేసుకొన్న కొబ్బరి మిశ్రమాన్ని కూడా వేసి మరో 5నిముషాలు నిధానంగా ఫ్రై చేసుకోవాలి. 

  Step-7: ఇప్పుడు అందులో ముందుగా డీఫ్ ఫ్రై చేసి పెట్టుకొన్న కాకరకాయ ముక్కలు కూడా వేసి మొత్తం ఫ్రై చేసుకోవాలి. 

  Step-8: కొద్దిగా ఉప్పు వేసి మరికొన్ని సెకడ్లు ఫ్రై చేసుకోవాలి. ఒక సారిగా మొత్తం వేగిన తర్వాత స్టౌ ఆఫ్ చేసి, సర్వ్ చేయాలి. అంతే క్రిస్పీ కాకరకాయ ఫ్రై రెడీ. దీన్ని ప్లెయిన్ రైస్ మరియు దాల్ కాంబినేషన్ తో సర్వ్ చేయవచ్చు.'''
  ],
  [
    "పన్నీర్ క్యాప్సికమ్ మసాలా",
    "images/paneer.jpg",
    ''' 
  గ్రీన్ పీస్: 2 cup 
  పన్నీర్: 200 gms 
  కొబ్బరి - 1 cup 
  క్యాప్సికమ్ - 1 cup 
  అల్లం వెల్లుల్లి పేస్ట్ - 1tbsp 
  కారం - 3 to 4 
  పచ్చిమిర్చి - 3 to 4 
  ధనియాలపొడి - 1 tbsp 
  బట్టర్ - 2 tbsp 
  దాల్చిన చెక్క - 1 stick 
  గసగసాలు - 2 tbsp 
  జీడిపప్పు- 10 to 12 
  ఉప్పు రుచికి సరిపడా''',
    ''' 
  Step-1: ముందుగా ప్రెజర్ కుక్కర్లో నీళ్ళు పోసి పచ్చిబఠానీలు వేసి మూత పెట్టి రెండు విజిల్స్ వచ్చే వరకూ ఉడికించుకోవాలి. 

  Step-2: తర్వాత మిక్సీ జార్ లో , కొబ్బరి, జీడిపప్పు, దాల్చిన చెక్క, గసగసాలు, ఎండుమిర్చి, పచ్చిమిర్చి మరియు నీళ్ళు వేసి మెత్తగా పేస్ట్ చేసుకోవాలి. 

  Step-3: పాన్ లో బట్టర్ వేసి కాగిన తర్వాత అందులో పన్నీర్ ముక్కలు వేసి బ్రౌన్ కలర్ వచ్చే వరకూ ఫ్రై చేసుకోవాలి. 

  Step-4: తర్వాత అందులో అల్లం వెల్లుల్లి పేస్ట్, సన్నగా తరిగిన క్యాప్సికమ్, ధనియాపౌడర్ వేసి ఫ్రై చేసుకోవాలి. 

  Step-5: ఇప్పుడు అందులో పచ్చిబఠానీలు మరియు మసాలా పేస్ట్ వేసి మిక్స్ చేస్తూ ఫ్రై చేసుకోవాలి. 

  Step-6: మసాలా వేగిన తర్వాత అందులో కొద్దిగా నీళ్ళు పోసి, రుచికి సరిపడా ఉప్పు వేసి ఉడికించుకోవాలి. అంతే గ్రీన్ పీస్ పన్నీర్ గ్రేవీ రెడ. 

  Step-7: ఇది చపాతీ మరియు రోటీలకు చాల అద్భుతమైన టేస్ట్ ను ఇస్తుంది.
'''
  ]
];
List<List> nonveg = [
  [
    'నాటుకోడి కూర‌',
    'చికెన్ కర్రీ',
    'చిల్లీ చికెన్‌',
    '‌చికెన్ పకోడి',
    'చికెన్ లాలీపాప్‌',
    'చికెన్ రోస్ట్',
    'మటన్ బిర్యానీ‌',
    '‌మటన్ వేపుడు',
    'చేపల కూర',
    'మలబార్ మీన్(చేపల) బిర్యానీ‌',
    'రొయ్యల ఇగురు',
    'ఎగ్ దమ్ బిర్యాని',
    'చేప ఇగురు పులుసు'
  ],
  [
    "నాటుకోడి కూర",
    "images/kodi.JPG",
    '''
    చికెన్: 1 kg(మీడియం సైజ్ ముక్కలుగా కట్ చేసుకోవాలి) 
    ఉల్లిపాయలు: 3 (చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
    అల్లం-వెల్లుల్లి పేస్ట్: 1tbsp 
    టమోటాలు: 2 (చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
    పెరుగు: 2tbsp 
    పచ్చిమిరపకాయలు: 3- 4 (చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
    ధనియాలు: 1tbsp 
    జీలకర్ర: ½tbsp 
    ఎండు కొబ్బరి తురుము: 2tbsp 
    వెల్లుల్లి: 3-6 రెబ్బలు 
    పసుపు: 1tsp 
    కారం: ½tsp 
    గరం మసాలా పొడి: 1tsp 
    ఉప్పు: రుచికి సరిపడా 
    నూనె: 3tbsp 
    కొత్తిమీర: 2tbsp(సన్నగా తరిగి పెట్టుకోవాలి) 
    నీళ్ళు: 1cup''',
    ''' 
    Step-1: ముందుగా స్టౌ మీద ఫ్రైయింగ్ పాన్ పెట్టి, అందులో ధనియాలు, జీలకర్ర, కొబ్బరి తురుము మరియు వెల్లుల్లుపాయలు వేసి లైట్ బ్రౌన్ కలర్ వచ్చేవరకూ రోస్ట్ చేసుకోవాలి. తర్వాత ఒక ప్లేట్ లోకి తీసుకొని, చల్లారిన తర్వాత మిక్సీలో వేసి మెత్తగా పేస్ట్ చేసుకోవాలి. అవసరం అయితే కొద్దిగా నీళ్ళు కలుపుకోవచ్చు. 

    Step-2: చికెన్ శుభ్రంగా కడిని పక్కన పెట్టుకోవాలి.  

    Step-3: ఇప్పుడు పాన్ వేడిచేసి, నూనె వేసి కాగిన తర్వాత అందులో ఉల్లిపాయ ముక్కలు వేసి మీడియం మంట మీద బ్రౌన్ కలర్ వచ్చే వరకూ వేగించుకోవాలి. 

    Step-4: తర్వాత అందులో అల్లం వెల్లుల్లిపేస్ట్, పసుపు, కారం, వేసి బాగా మిక్స్ చేస్తూ 5నిముషాలు వేగించుకోవాలి. 

    Step-5: ఇప్పుడు అందులోనే టమోటో ముక్కలు, మిరియాల పేస్ట్, గరం మసాలా పౌడర్, పెరుగు, ఉప్పు వేసి బాగా మిక్స్ చేస్తూ, వేగించుకోవాలి. తర్వాత 5-10 ఉడికించుకోవాలి.  

    Step-5: ఇప్పుడు అందులో చికెన్ ముక్కలు కూడా వేసి బాగా మిక్స్ చేయాలి. మసాలా చికెన్ ముక్కలకు పట్టేలా మిక్స్ చేస్తూ వేగించుకోవాలి. 

    Step-6: తర్వాత అందులో నీళ్ళు పోసి మిక్స్ చేయాలి. మూత పెట్టి మీడియం మంట మీద 20నిముషాలు ఉడికించుకోవాలి. 

    Step-7: ఒక్కసారిగా చికెన్ ముక్కలు ఉడికించుకొన్న తర్వాత మూత తీసి కొత్తిమీర తరుగుతో గార్నిష్ చేసి వేడి వేడిగా సర్వ్ చేయాలి.'''
  ],
  [
    "చికెన్ కర్రీ",
    "images/kodi.JPG",
    '''
అరకిలో చికెన్
1 ఉల్లిపాయ
1 టమాట
2 పచ్చిమిర్చి
కొద్దిగ కర్వేపాకు
6 స్పూన్లు నూనె
1 స్పూన్ కారం
అరటీస్పూన్ పసుపు
1 టీస్పూన్ ఉప్పు
అరటీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్
అరటీస్పూన్ ఆవాలు
అరటీస్పూన్ జీలకర్ర
అరటీస్పూన్ గరం మసాల
    ''',
    '''

Step1: ముందుగా చికెన్ శుభ్రంగా కడిగి అందులో ఉప్పు, కారం, పసుపు, అల్లంవెల్లుల్లి పేస్ట్ వేసి కలిపి పక్కన పెట్టాలి.

Step2: ఉల్లిపాయ, టమాటలు సన్నగా తరిగి పెట్టుకోవాలి.

Step3: పాన్ లో నూనె వేసి అందులో ఆవాలు, జీలకర్ర, కర్వేపాకు, ఉల్లిపాయముక్కలు, పచ్చిమిర్చి, అల్లం వెల్లుల్లిపేస్ట్ వేసి దోరగా వేయించుకోవాలి.

Step4: ఇందులో టాటాలు వేసి మగ్గిన తరువాత సిద్దం చేసుకున్న చికెన్ వేసి కలిపి మూత పెట్టి ఉడికించాలి.

Step5: చికెన్ పూర్తిగా ఉడికిన తరువాత అందులో గరం మసాల వేసి దించాలి. అంతే ఎంతో రుచికరమైన ఆంధ్రా చికెన్ కర్రీ రెడీ.

''',
  ],
  [
    "చిల్లీ చికెన్",
    "images/chillichick.jpg",
    ''' 
చికెన్ (ఎముకలు లేకుండా): 500grms
అల్లం వెల్లుల్లి పేస్ట్ : 2tsp
నిమ్మ రసం: 2(రెండు కాయల నుండి పిండినది)
గుడ్డు: 1
చికెన్ స్టాక్: 1cup
టొమాటో కెచప్: 2tbsp
రెడ్ చిల్లి సాస్: 1tbsp
సోయ్ సాస్: 2tbsp
అల్లం: 1 అంగుళం (సన్నగా తరిగినవి)
పచ్చిమిర్చి: 2(సన్నగా తరిగినవి)
వెల్లుల్లి రెబ్బలు : 5-6(సన్నగా తరిగినవి)
స్ప్రింగ్ ఉల్లిపాయ: 1cup(సన్నగా తరిగినవి)
కార్న్ పిండి: 1cup
మైదా: ½ cup
వినెగార్: 2tbsp
నూనె: 3tbsp
ఉప్పు: రుచికి సరిపడా''',
    ''' 
Step-1: ముందుగా చికెన్ ముక్కలకు అల్లం వెల్లుల్లిపేస్ట్, నిమ్మరసం, ఉప్పు వేసి బాగా మిక్స్ చేసి 15 మ్యారినేట్ చేసి పక్కన పెట్టుకోవాలి. 

Step-2: ఆ తర్వాత ఒక గుడ్డును పగులగొట్టి ఎగ్ వైట్, మరియు పచ్చసొన కూడా చికెన్ లో వేసి బాగా మిక్స్ చేసి మరో పదిమేను నిముషాలు పక్కన పెట్టుకోవాలి. 

Step-3: ఇప్పుడు ఒక కప్పులో కార్న్ ఫ్లోర్ మరియు మైదా, ఉప్పు కూడా వేసి బాగా మిక్స్ చేసి పెట్టుకోవాలి. 

Step-4: తర్వాత ఫ్రైయింగ్ పాన్ లో నూనె వేసి వేడి చేయాలి. తర్వాత కార్న్ ఫ్లోర్ మైదామిశ్రమంలో చికెన్ ముక్కలకు వేసి అన్నివైపులా పౌడర్ ను పట్టించి నూనెలో వేయాలి. 

Step-5: చికెన్ ముక్కలు అన్నివైపులా ఫ్రై అవుతూ బ్రౌన్ కలర్ వచ్చే వరకూ వేగించుకొని తర్వాత పక్కన తీసి పెట్టుకోవాలి. 


Step-6: తర్వాత అదే పాన్ లో మరికొద్దిగా నూనె వేసి కాగిన తర్వాత అల్లం, వెల్లుల్లి, పచ్చిమిర్చి ముక్కలు మరియు స్ప్రింగ్ ఆనియన్(చిన్న ఉల్లిపాయలు)వేసి మీడియం మంట మీద 5నిముషాలు ఫ్రై చేసుకోవాలి. 

Step-7: మంట తగ్గించి అందులోనే వెనిగర్, చిల్లీ సాస్, సోయా సాన్ మరయిు టమోటో కెచప్ కూడా వేసి మొత్తాన్ని నిధానంగా మిక్స్ చేస్తూ ఒకనిముషము ఫ్రై చేసి, ఆతర్వాత అందులో చికెన్ స్టాక్ (చికెన్ ఉడికించుకొన్న నీళ్ళు)పోయాలి. 

Step-8: మొత్తం పదార్థాలన్నీ బాగా కలగలపాలి తర్వాత అందులో ఫ్రై చేసుకొన్న చికెన్ ముక్కలను వేయాలి. సాస్ ఇంకా నీళ్ళనీళ్ళగా ఉంటే, అందులో ఒక టీస్పూన్ కార్న్ ఫ్లోర్ వేయాలి. తర్వాత ఆనియన్ గ్రీన్స్ తో చిల్లీ చికెన్ ను గార్నిష్ చేయాలి. మొత్తాన్ని బాగా మిక్స్ చేయడం వల్ల గ్రీన్ కలర్ గా కనబడుతుంది . ఎక్కువ సాల్ట్ ను యాడ్ చేయకూడదు. ఎందుకంటే సాస్ అన్నింటిలోనూ ఇంతకుమునుపే సాల్ట్ యాడ్ చేసి ఉంటుంది. అంతే జ్యూసి మరియు స్పైసీ చిల్లీ చికెన్ రెడీ. దీన్ని ఫ్రైడ్ రైస్ లేదా నూడిల్స్ తో సర్వ్ చేస్తే చాలా టేస్టీగా ఉంటుంది.
'''
  ],
  [
    "‌చికెన్ పకోడి",
    "images/chick.jpg",
    ''' 
చికెన్: 1kg 
జీలకర: వేయించి పొడి చేసింది : 1/2tsp 
కారం: 1tsp 
ఉప్పు: రుచికి సరిపడా 
నిమ్మ ఉప్పు(లెమన్ డ్రెస్స్): 1tsp 

పిండి తయారీకి కావల్సినవి :

నీరు : 1cup 
శనగపిండి: 1cup 
బేకింగ్ పౌడర్: 1/2tsp 
కారం: 1/2tsp 
ఉప్పు: రుచికి సరిపడా 
కరివేపాకులు : నాలుగు రెమ్మలు 
పచ్చిమిర్చి: 2 (సన్నగా తరిగినవి)''',
    ''' 
Step-1: ముందుగా ఒక కప్పు నీటిలో కొద్దిగా ఉప్పు వేసి చికెన్ ముక్కలు ఉడకబెట్టాలి. 

Step-2: ఉడికిన తరువాత నీటిని పూర్తిగా వడపోసి జిలకర పొడి, ఉప్పు, నిమ్మ ఉప్పు, కారంలో బాగా కలుపుకుని పక్కన పెట్టుకోవాలి. 

Step-3: తరవాత ఒక గిన్నెలో శనగపిండిని బజ్జీలపిండిలా చిక్కగా కలుపుకొవాలి. 

Step-4: అందులోనే కరివేపాకు, తరిగిన పచ్చిమిర్చి, కారం, ఉప్పు తగినంత, బేకింగ్ పౌడర్ కలిపి చికెన్ ముక్కలను పిండిలో ముంచి నూనెలో బంగారు రంగు వచ్చే వరకు వేయించుకోవాలి. అంతే వేడి వేడి చికెన్ పకోడా రెడీ.
'''
  ],
  [
    "చికెన్ లాలీపాప్",
    "images/loli.jpg",
    ''' 
  చికెన్: 12 ముక్కలు 
  ఉల్లిపాయ: 4tsp(పేస్ట్) 
  వెల్లుల్లి: 1tsp(పేస్ట్) 
  అల్లం: 1 tsp(పేస్ట్) 
  పెప్పర్ పౌడర్: 1tsp 
  కారం: 1tsp 
  ఉప్పు: రుచికి సరిపడా

  కొట్టు కోసం కావలసినవి :
  
  మొక్కజొన్న పిండి: 3tbsp 
  మైదా: 2tbsp 
  బేకింగ్ సోడా: చిటికెడు 
  ఆయిల్: 3 టేబుల్ స్పూన్లు 
  ఉప్పు: రుచికి సరిపడా''',
    ''' 
  Step-1: ముందుగా మీరు చికెన్ లాలీపప్స్ ను శుభ్రంగా కడిగి, దాని మీద పసుపు, ఉప్పు చిలకరించి పక్కన పెట్టుకవోాలి. 

  Step-2: తర్వాత ఒక మిక్సింగ్ బౌల్ తీసుకొని, అందులో ఉల్లిపాయ పేస్ట్, అల్లం, వెల్లుల్లి పేస్ట్ వేసి మిక్స్ చేయాలి. ఈ పేస్ట్ మిశ్రమానికి పెప్పర్ పౌడర్ కూడా వేసి బాగా మిక్స్ చేయాలి. 

  Step-3: ఇప్పుడు ఈ పేస్ట్ ను ఉపయోగించి చికెన్ లాలీపప్పుకు ఫుల్ గా మ్యారినేట్ చేసి పెట్టుకోవాలి. చికెన్ మ్యారినేట్ చేసిన తర్వాత 15నిముషాలు పక్కన పెట్టుకోవాలి. 

  Step-4: మరో బౌల్లో, కార్న్ ఫ్లోర్, మరియు మైద, బేకింగ్ సోడా, ఉప్పు మరియు నీళ్ళు పోసి, చిక్కగా కలిపి పెట్టుకోవాలి. 

  Step-5: తర్వాత ఈ చిక్కటి పిండిని మ్యారినేట్ చేసిన చికెన్ లాలీపప్స్ కు మ్యారినేట్ చేయాలి. ఇలా అన్ని చికెన్ ముక్కలకు పట్టించిన తర్వాత మరో 10 నిముషాలు పక్కన పెట్టుకోవాలి.

  Step-6: నూనె వేడి అయ్యాక, చికెన్ లాలీపప్స్ ను ఫ్రైయింగ్ పాన్ లో వేసి ఫ్రై చేయాలి . అన్ని అవైపులా బ్రౌన్ కలర్ వచ్చే వరకూ తిప్పుతూ పూర్తిగా ఫ్రై చేయాలి. 

  Step-7: చికెన్ లాలీపప్ప్ గోల్డ్ బ్రౌన్ కలర్ లోనికి మారుతున్నప్పుడు, ఆయిల్ నుండి చికెన్ తీసి, ఆయిల్ పీల్చుకొనే పేర్ మీద వేయాలి. అంతే మీ చికెన్ లాలీపప్స్ రెడీ . ఈ రుచికరమైన చికెన్ లాలీపప్ప్ ను చైనీస్ ఫ్రైడ్ రైస్ తో తినాలి. మరింత స్పైసీ టేస్ట్ కోరుకుంటున్నట్లైతే బ్లాక్ పెప్పర్ పౌడర్ వేసి మీర అందించాలి.
'''
  ],
  [
    "చికెన్ రోస్ట్",
    "images/chillichick.jpg",
    ''' 
  చికెన్: 500gms 
  కరివేపాకు: రెండు రెమ్మలు 
  ధనియా (ధనియా పౌడర్): 2tsp 
  కాశ్మీరీ కారం పొడి: 1tsp 
  అల్లం వెల్లుల్లి పేస్ట్ : 2tbsp 
  ఉప్పు: రుచికి సరిపడా 
  పంచదార: 1tsp 
  పెప్పర్ పొడి: 2tsp 
  గరం మసాలా పొడి: 1tsp 
  జీలకర్ర పొడి: 2 tsp 
  ఎండు మిర్చి: 2 
  నెయ్యి: 7tbsp + 2tsp 
  కొత్తిమీర: 1/2cup(సన్నగా తరిగి పెట్టుకోవాలి) 
  చింతపండు గుజ్జు: 1tbsp 
  టమోటో గుజ్జు: 1cup''',
    ''' 
  Step-1: ముందుగా పాన్ లో కొద్దిగా నెయ్యివేసి వేడయ్యాక అందులో కరివేపాకు, ఎండుమిర్చి, జీలకర్ర, అల్లం,వెల్లుల్లి పేస్ట్ ఒకదాని తర్వాత ఒకటి వేసి మీడియం మంట మీద ఫ్రై చేసుకోవాలి. 

  Step-2: తర్వాత అందులో టమోటో గుజ్జు వేసి 5 నిముషాలు ఫ్రై చేసుకోవాలి. 

  Step-3: 5 నిముషాల తర్వాత ధనియాలపొడి, కాశ్మీర్ రెడ్ చిల్లీ పౌడర్ వేసి మిక్స్ చేస్తూ ఫ్రై చేసుకోవాలి. మసాల నుండి నెయ్యి సపరేట్ గా పైకి తేలే వరకూ ఫ్రై చేసుకోవాలి. 

  Step-4: ఇప్పుడు అందులోనే మరో రెండు చెంచాల నెయ్యి వేసి, చికెన్ ముక్కలు, ఉప్పు, గరం మసాలా మరియు పెప్పర్ పౌడర్ వేసి మరో 5-10నిముషాలు ఫ్రై చేసుకోవాలి. 

  Step-5: ఇప్పుడు కొత్తిమీర సగభాగాన్ని ఉడుకుతున్న చికెన్ మీద చిలకరించుకోవాలి. అలాగే పంచదార కూడా చిలకరించి మూత పెట్టి తక్కువ మంట మీద 10 నిముషాలు ఉడికించుకవోాలి.

  Step-6: 10నిముషాల తర్వాత మూత తీసి చింత పండు గుజ్జు వేసి మూత పెట్టి మరో 5నిముషాలు, చికెన్ మెత్తగా ఉడికే వరకూ ఉడికించుకవోాలి. 7. చికెన్ ఉడికన తర్వాత స్టౌ ఆఫ్ చేసి మిగిలిన కొత్తిమీర తరుగుతో గార్నిష్ చేయాలి. అంతే చికెన్ గీ రోస్ట్ రెడీ . ఈ రుచికరమైన చికెన్ రిసిపిని దోసె మరియు చపాతీలతో సర్వ్ చేయాలి.
'''
  ],
  [
    "మటన్ బిర్యానీ",
    "images/mutton.jpg",
    ''' 
మాంసం - 1 kg
బాస్మతీ బియ్యం - 1 kg
ఉల్లిపాయలు -250 grms
పెరుగు - 250 grms
అల్లం వెల్లుల్లి ముద్ద - 3 tsp
కొత్తిమిర - 1/2 cup
పుదీన - 1/2 cup
పచ్చిమిర్చి - 3
పసుపు - తగినంత
కారం పొడి - 2 tsp
ఏలకులు - 4
లవంగాలు - 8
దాల్చిన చెక్క - 2
షాజీర - 2 tsp
గరం మసాలా పొడి - 2 tsp
కేసర్ రంగు - 1/4 tsp
పాలు - 1 cup
ఉప్పు తగినంత
నూనె - తగినంత''',
    ''' 
Step-1: ముందుగా నూనె వేడి చేసి సన్నగా తరిగిన ఉల్లిపాయలు ఎర్రగా వేయించి పెట్టుకోవాలి. అలాగే తరిగిన కొత్తిమిర ,పుదీనా కూడా. కొద్దిగా పచ్చివి తీసి పక్కన పెట్టుకోవాలి. 

Step-2: తర్వాత వేయించిన ఉల్లిపాయ,కొత్తిమిర,పుదీనా,పెరుగు,కారంపొడి, పసుపు,మాంసానికి తగినంతఉప్పు వేసి మిక్సిలో మెత్తగా ముద్ద చేసుకొనిపెట్టుకోవాలి. 

Step-3: ఒక గిన్నెలో శుభ్రపరచిన మాంసం, నూరిన ముద్ద, పచ్చి కొత్తిమిర, పుదీనా, పచ్చిమిరపకాయలు,గరం మసాలా వేసి బాగా కలియబెట్టి కనీసం గంట నాననివ్వాలి. 

Step-4: తర్వాత బియ్యం కడిగి పదినిమిషాలు నాననిస్తే చాలు. మందపాటి గిన్నె తీసుకొని నూనె వేసి దానిమీద నానబెట్టిన మాంసం, మసాలా వేసి సమానంగా అడుగున పరచి పక్కన పెట్టుకోవాలి. 

Step-5: ఇంకో పెద్ద గిన్నెలో బియ్యానికి మూడింతలు నీళ్ళు పోసి అన్నానికి తగినంత ఉప్పు వేసి మరిగించాలి. నీరు మరిగేటప్పుడు ఏలకులు,లవంగాలు,దాల్చిన చెక్క ముక్కలు, షాజీర వేయలి. 

Step-6: తర్వాత బియ్యంలోని నీరంతా వడకట్టాలి. మరుగుతున్న నీటిలో ఈ బియ్యం వేసి సగం ఉడకగానే గంజి వార్చి తర్వాత సగం ఉడికిన అన్నంను మాంసంపై సమానంగా పరవాలి.పైన కొన్ని ఎర్రగా వేయించిన ఉల్లిపాయలు, సన్నగా తరిగిన కొత్తిమిర, పుదీనా కొద్దిగా, నెయ్యి, పాలు, కేసర్ రంగు వేసి, తడిపిన గోధుమపిండిని చుట్టలాగా చేసుకుని గిన్నె అంచులపై మొత్తం పెట్టి దానిమీద సమానమైన మూత పెట్టాలి. 

Step-7: పొయ్యిమీద ఇనప పెనం పెట్టి వేడి చేసి దానిపై ఈ గిన్నె పెట్టి దాని మీద బరువైన ఎదైనా వస్తువు పెట్టాలి. దీనివల్ల ఆవిరి బయటకు పోకుండా ఉంటుంది. అరగంట తర్వాత ఇది తయారై ఘుమఘుమలతో గోధుమ పిండిని చీల్చుకుని ఆవిరి బయటకొస్తుంది. 

Step-8: అంతే ఉడికించిన గ్రుడ్లతో అలంకరించుకోవాలి. 

Step-9: దీనికి కాంబినేషన్ పెరుగు పచ్చడి, గుత్తి వంకాయ కూర చాలా రుచిగా ఉంటాయి.
'''
  ],
  [
    "మటన్ వేపుడు",
    "images/muttonfry.jpg",
    ''' 
బోన్‌లెస్ మటన్ : 500grms 
తరిగిన ఉల్లిపాయలు : 1cup 
కారం : 1tsp ఉప్పు : రుచికి సరిపడా 
పసుపు : 1/4tsp 
అల్లం వెల్లల్లి పేస్టు : 2tbsp 

బఘార్ కోసం కావలసినవి: 

నూనె : 2tbsp 
జీలకర్ర : 1tsp 
కరివేపాకు, కొత్తిమీర, పుదీనా, పచ్చిమిర్చి : 4 
మిరియాల పొడి : 1/2tsp 
గరం మసాల పౌడర్ : 1/2tsp 
నిమ్మరసం : 2tsp''',
    ''' 
Step-1: ముందుగా ఓ పాత్రలోకి మాంసం ముక్కలు ఉల్లిపాయ ముక్కలు కారం ఉప్పు అల్లం వెల్లుల్లి పేస్టు పసుపులను వేసి బాగా కలిపి సరపడా నీటిని పోసి ప్రెజర్ కుక్కర్‌లో ఐదు నిమిషాల పాటు ఉడికించాలి. తర్వాత స్టౌ ఆఫ్ చేసి మాంసం ముక్కలను తడి ఆరే వరకూ పక్కకు పెట్టుకోవాలి. 

Step-2: ఇప్పుడు స్టౌ వెలిగించి దానిపై పాన్ పెట్టి అందులో సరిపడా నూనె వేసి జీలకర్ర కరివేపాకు కొత్తిమీర పుదీనా పచ్చిమిర్చి(మధ్యలో కత్తిరించినవి)లను వేసి ఒక రెండు మూడు నిముషాలు ఫ్రై చేసుకోవాలి. 

Step-3: ఇప్పుడు అందులోకి పక్కన పెట్టుకున్న మాంసంను కూడా వేసి బాగా కలియబెట్టాలి. 

Step-4: ఈ మిశ్రమం మొత్తం ఫ్రై అవుతుండా, అందులోనే మిరియాల పొడి, గరం మసాల పొడి నిమ్మరసం వేసి బాగా కలిపి మరో 5నుండి 10 నిమిషాల పాటు తక్కువ మంట మీద ఉడికించాలి. ముక్కలు బాగా వేగాయని నిర్ధారించుకున్నాక దించేసుకోవాలి. అంతే రంజాన్ స్పెషల్ మటన్ ఫ్రై రెడీ.'''
  ],
  [
    "చేపల కూర",
    "images/fish.jpg",
    '''
చేపలు - 1/2 కిలోలు (మీకు ఇష్టమైన చేప)
వెన్న - 3 టేబుల్ స్పూన్లు
ఆవాలు - 1 టేబుల్ స్పూన్
చిన్న ఉల్లిపాయ - 5 (సన్నగా తరిగినవి)
టొమాటోస్ - 1 (చిన్న ముక్కలుగా కట్ చేసినవి)
కరివేపాకు - కొద్దిగా
చింతపండు - 1 చిన్న నిమ్మకాయ పరిమాణం
ఉప్పు - రుచికి సరిపడా

పేస్ట్ చేయడానికి కావల్సినవి ...

కొబ్బరి - 1 కప్పు (తరిగినవి)
చిన్న ఉల్లిపాయ - 10

వేయించడానికి మరియు రుబ్బు ...

మిరపకాయలు - 8-10
ధనియాలు - 2 టేబుల్ స్పూన్లు
జీలకర్ర - 1 టేబుల్ స్పూన్''',
    ''' 
Step-1: మొదట చింతపండును 1/2 గంటలు నీటిలో నానబెట్టి, రసం తీసుకొని పక్కన పెట్టుకోవాలి. 

Step-2: తరువాత వేయించడానికి సిద్దంగా ఉంచిన పదార్థాలన్నింటిని పాన్లో వేసి వేయించి పెట్టుకోవాలి. 

Step-3: ఈ పదార్థాలు కొద్దిగా చల్లారిన తర్వాత. వాటిని మిక్సీలో వీటిని వేసి, కొద్దిగా నీరు పోసి మృదువైన పేస్ట్ తయారు చేయండి. 

Step-4: తరువాత కొబ్బరి, చిన్న ఉల్లిపాయ వేసి మెత్తగా రుబ్బుకోవాలి. 

Step-5: తరువాత ఒక గిన్నెలో పైన రుబ్బి పెట్టుకున్న పేస్ట్ మరియు వెనిగర్ కలపండి మరియు పక్కన పెట్టండి.

Step-6: తరువాత, స్టౌ మీద పాన్ పెట్టి , అందులో నూనె పోసి, ఆవాలు, కరివేపాకు, చిన్న ఉల్లిపాయ, టమోటా ముక్కలు వేసి బంగారు రంగు వచ్చేవరకు వేయించాలి. అలాగే రుచికి సరిపడా ఉప్పు కూడా వేయాలి మరియు ఈ మిశ్రమాన్ని బాగా ఉడకనివ్వండి. 

Step-7: పచ్చివాసన పోయే వరకు ఉడికించండి. ఉడకబెట్టిన పులుసు నుండి నూనె వేరు పడుతున్నప్పుడు, చేపల ముక్కలు వేసి సున్నితంగా కలపాలి. 

Step-8: నూనె బాగా వేరు చేసినప్పుడు చేపలు ఉడికితే, రుచికరమైన విలేజ్ స్టైల్ చేపల పులుసు సిద్ధంగా ఉంటుంది.
'''
  ],
  [
    "మలబార్ మీన్(చేపల) బిర్యానీ",
    "images/biryani.jpg",
    '''
  రైస్ కోసం:

  బియ్యం: 3cups 
  నీళ్లు: 6cups 
  నెయ్యి: 2tbsp 
  ఉల్లిపాయ: 1 
  పులావ్ ఆకులు: 2 
  యాలకుల పొడి: 1/2tsp 
  సోంపు: 1/2tsp 
  జాపత్రి: 2 
  లవంగాలు: 6 
  మిరియాల పొడి: 1tsp 
  దాల్చిన చెక్క: చిన్న ముక్క 
  నిమ్మరసం: 1/2tsp 
  ఉప్పు రుచికి తగినంత 

  ఫిష్ మసాలా కోసం: 
  
  చేప ముక్కులు: 1/2cup 
  కొబ్బరిపాలు: 1/4cup 
  నెయ్యి: 2tsp 
  కారం: 1tsp 
  పసుపు: 1/2tsp 
  మిరియాల పొడి: 1tsp 
  ఉప్పు: రుచికి తగినంత 
  నూనె: కావలసినంత 
  ఉల్లిపాయ: 1 
  టమోటోలు: 2 
  అల్లం, వెల్లుల్లి పేస్ట్: 1tsp 
  పచ్చిమిర్చి పేస్ట్: 1tsp 
  కొత్తిమీర పేస్ట్: 1tsp 
  గరం మసాలా: 1tsp 
  పెరుగు: 1tsp 
  నిమ్మరసం: 1tsp''',
    ''' 
  Step-1: ముందుగా బియ్యాన్ని కడిగి నానబెట్టాలి. ఐదు నిమిషాలు తర్వాత నీళ్లు ఒంపేసి, ఉప్పు వేసి హాఫ్ బాయిల్ చెయ్యాలి. 

  Step-2: తర్వాత ఒక బౌల్ లో నెయ్యి వేడి చేసి అందులో పులావ్ ఆకులు, లవంగాలు, జాపత్రి, యాలకులు, సోంపు, దాల్చిన చెక్క, మిరియాల పొడి వేయాలి. 

  Step-3: రెండు నిమిషాలయ్యాక ఉల్లిపాయలు వేసి ఎరుపు రంగు వచ్చే వరకూ వేయించాలి. అర్వాత అన్నం నిమ్మరసం వేయాలి. ఐదు నిమిషాలయ్యాక నీళ్లు పోయాలి. బాగా ఉడికిన తర్వాత దించేసుకుని పక్కన పెట్టుకోవాలి. 

  Step-4: ఇప్పుడు చేప ముక్కలను ముళ్లు తీసేసి, కారం, పసుపు, మిరియాల పొడి, ఉప్పు కలిపి అరగంట ఉంచాలి. తర్వాత వీటిని నూనెలో డీప్ ఫ్రై చేసి తీసేసుకోవాలి. 

  Step-5: తర్వాత అదే నూనెలో ఉల్లిపాయ, టమోటో ముక్కలు, అల్లం, వెల్లుల్లి పేస్ట్, పచ్చిమిర్చి పేస్ట్, కొత్తమీర పేస్ట్ వేయాలి. రంగు మారిన తర్వాత మంట తగ్గించి పెరుగు, కొబ్బరిపాలు, ఉప్పు వేసి మరో ఐదు నిమిషాలు ఉంచాలి.

  Step-6: ఇప్పుడు అందులో చేపముక్కలు వేసి సన్నని మంట మీద మిశ్రమం చిక్కబడే వరకూ ఉడికించాలి. లోతైన ఓ గిన్నెను తీసుకుని సగం అన్న వేయాలి. ఆపైన ఫిష్ మసాలాను వేయాలి. ఆపైన మళ్లీ అన్నం వేయాలి. పైన రెండు చెంచాల నెయ్యి వేసి మూత పెట్టాలి. ఆవిరి బయటకు రాకుండా మైదా పిండి ముద్దతో అంచులను మూసేయాలి. సన్నని మంటమీద పది నిమిషాలు మగ్గనిచ్చి దించేసుకోవాలి.
'''
  ],
  [
    "రొయ్యల ఇగురు",
    "images/royyalu.jpg",
    '''
  రొయ్యలు - 250 gm 
  ఉల్లిపాయలు - 4 
  పచ్చిమిరప - 2 
  అల్లం వెల్లుల్లి - 2 tsp 
  కరివేపాకు - 2 tsp 
  కొబ్బరి పొడి - 3 tbsp 
  గరం మసాలా - 1 tsp 
  పసుపు - 1/4 tsp 
  కారం - 1 tsp 
  ఉప్పు తగినంత 
  నూనె - 3 tbsp''',
    ''' 
  Step-1: మొదట గా రొయలను వేడి నీటిలో వేసి పైపొట్టు వలిచి రొయ్యలు శుభ్రంగా కడిగి వుంచుకోవాలి. 

  Step-2: స్టౌ వెలిగించి పాన్ పెట్టి అందులో నూనె పోసి వేడి చేసి సన్నగా తరిగిన ఉల్లిపాయలు ఎర్రగా వేపి అల్లం వెల్లుల్లి, పసుపు, కారం, కరివేపాకు వేసి కొద్దిసేపు వేయించి రొయ్యలు, ఉప్పు వేసి బాగా కలియబెట్టి మూత పెట్టాలి. 

  Step-3: నీరంతా ఆవిరిలో ఇమిరి మసాలా బాగా వేగాక ఒక కప్పు నీళ్ళు పోసి ఉడికించాలి.

  Step-4: రొయ్యలు ఉడికిన తర్వాత కొబ్బరిపొడి,గరం మసాలా కలిపి మరి కొద్ది సేపు ఉడికించి కొత్తిమిర చల్లి దింపేయాలి.
'''
  ],
  [
    "ఎగ్ దమ్ బిర్యాని",
    "images/biryani.jpg",
    ''' 
  గుడ్లు: 6 
  
  బిర్యాని రైస్ తయారు చేయడానికి కావల్సినవి: 
  
  బియ్యం: 2cups 
  చికెన్ స్టాక్: 3cups(చికెన్ ఉడికించి తీసుకొన్న నీరులేదా సూప్) 
  లవంగాలు: 4 
  చెక్క: చిన్న ముక్క 
  బ్లాక్ కార్డమం: 3 
  బ్లాక్ పెప్పర్: 4-6 
  బిర్యాని ఆకు: 1 
  నిమ్మరసం: 2tsp 
  ఉప్పు: రుచికి సరిపడా 
  నెయ్యి లేదా నూనె: 1tbsp 

  మసాలా కొరకు: 
  
  నెయ్యి: 4tbsp 
  ఉల్లిపాయ: 2(సన్నగా కట్ చేసుకోవాలి) 
  అల్లం వెల్లుల్లి పేస్ట్: 3tsp 
  టమోటో: 2(సన్నగా తరిగిపెట్టుకోవాలి) 
  తాజా కొత్తిమీ తరుగు: 1/4cup 
  కారం: 1tsp 
  పసుపు: 1/4tsp 
  గరం మసాలా: 1tsp 
  పెరగు: 1/2cup 
  నిమ్మరసం: 2tbsp 
  గార్నిషింగ్ కోసం-లేయరింగ్ ఉల్లిపాయ: 1(కొంచెం మందంగా తరిగిపెట్టుకోవాలి) 
  నెయ్యి: 2tbsp 
  జీడిపప్పు: 1/4cup 
  కుంకుమపువ్వు: చిటికెడు 
  పాలు: 2tbsp''',
    ''' 
  Step-1: ముందుగా గుడ్లను ఉడికించి పొట్టుతీసి పక్కన పెట్టుకోవాలి. (మీకు ఇష్టమైతన ఉడికించిన గుడ్డును రెండు బాగాలుగా కట్ చేసి పెట్టుకోవచ్చు) 

  Step-2: గార్నిషింగ్: స్టౌ మీద పాన్ పెట్టిఅందులో నెయ్యి వేసి వేడయ్యాక అందులో ఉల్లిపాయ ముక్కలు వేసి గోల్డ్ బ్రౌన్ కలర్ వచ్చేంత వరకూ వేగించుకోవాలి. 

  Step-3: తర్వాత అందులోనే జీడిపప్పు మరియు ద్రాక్ష కూడా వేసి వేగించుకోవాలి. 

  Step-4: తర్వాత ఒక కప్పు వేడి పాల్లో చిటికెడు కుంకుమపువ్వు వేసి వేడి పక్కన పెట్టుకోవాలి. 

  Step-5: మసాల కోసం: మందపాటి గిన్నెలో నెయ్యివేసి, వేడయ్యాక అందులో ఉల్లిపాయ ముక్కలు వేసి లైట్ గా వేగించుకోవాలి. తర్వాత అందులోనే అల్లం వెల్లుల్లి పేస్ట్ వేసి రెండు మూడు నిముషాల వేగించుకోవాలి. 

  Step-6: మసాలకోసం సిద్దంగా పెట్టుకొన్న అన్ని వస్తువులను వేసి 5నిముషాల పాటు తక్కువ మంట మీద వేగించుకోవాలి. 

  Step-7: తర్వాత అందులోనే ఉడికించిన గుడ్లను కూడా వేసి రెండు నిముషాల వేగించాలి. 

  Step-8: అన్నం: బియ్యాన్ని శుభ్రంగా కడిగి 15నిముషాలు పక్కన పెట్టుకోవాలి. 

  Step-9: ఇప్పుడు మరో పాన్ ను స్టౌ మీద పెట్టి నెయ్యి వేసి అన్నం కోసం సిద్దం చేసుకొన్న మాసాలాలన్నింటిని అందులో వేసి వేగించి అందులోనే నీరు వంపేసి బియ్యాన్ని కూడా వేసి ఒక నిముషం వేగించుకోవాలి. 

  Step-10: తర్వాత అందులోనే చికెన్ స్టాక్, ఉప్పు, నిమ్మరసం వేసి బాగా మిక్స్ చేసి మూత పెట్టి 90%అన్నం ఉడికేంత వరకూ మీడియం మంట మీద ఉడికించుకోవాలి. 

  Step-11: లేయరింగ్: ఇప్పుడు మంద పాటి పాన్ ను స్టౌ మీద పెట్టి అందులో ఎగ్ మరియు మసాలాను మొదటి లేయర్ గా పరవాలి. తర్వాత దీని మీద అన్నంను పరవాలి.అన్నం మీదు నెయ్యిలో వేయించుకొన్న ఉల్లిపాయ, జీడిపప్పు,ద్రాక్షను పరవాలి. ఇలా రెండు మూడు లేయర్లుగా ఒకదాని తర్వాత ఒకటి పరుచుకోవాలి. 

  Step-12: చివరి లేయర్ మీద కుంకుమ పువ్వు నానబెట్టుకొన్న పాలను చిలకరించాలి. తర్వాత దీని మీద అల్యూమినియం సీట్ పరచి మూత పెట్టి తక్కువ మంట మీద 10-15నిముషాలు ఉడికించుకోవాలి. అంతే ఎగ్ దమ్ బిర్యాని రెడీ. మీకు ఇష్టైన రైతా తో వేడి వేడిగా సర్వ్ చేయాలి.
'''
  ],
  [
    "చేప ఇగురు పులుసు",
    "images/fish.jpg",
    '''
   చేపలు: 1/2kg 
   చింతపండు: రెండు నిమ్మకాయలంత 
   ఉల్లిపాయలు: 2 
   పచ్చి మిరపకాయలు: 5 
   అల్లం వెల్లుల్లి పేస్టు: 2tbsp 
   ఉల్లిపాయ: 1tbsp 
   కొత్తిమీర పేస్టు: 1tbsp 
   గరంమసాలా: 1tsp 
   కారం: 1tsp 
   ఉప్పు: రుచికి సరిపడా 
   పెరుగు: 2tbsp 
   బెల్లం పొడి: 1/2tsp 
   మెంతి పొడి: చిటికెడు 
   పసుపు: తగినంత 
   పోపు దినుసులు: 1 2tsp 
   నూనె: సరిపడా
''',
    ''' 
Step-1: ముందుగా చేపముక్కలను ఆవిరిపై ఉడికించుకోవాలి. తరువాత ముల్లు తీసివేసి పక్కన పెట్టుకోవాలి. 

Step-2: ఇప్పుడు ఒక పాత్రలో నూనె వేసి కాస్త వేడి అయ్యాక పోపు దినుసులు వేసి వేయించుకోవాలి. తరువాత తరిగిన ఉల్లిపాయలు, పచ్చి మిర్చి వేసుకోవాలి. అల్లంవెల్లుల్లి పేస్టు, ఉల్లిపాయ,కొత్తిమీర పేస్టు, పసుపు వేసి కొద్దిగా వేగనివ్వాలి. 

Step-3: తర్వాత అందులోనే చింతపండు పులుసు పోసి కారం, పెరుగు, ఉప్పు వేసి కలియబెట్టాలి. చింతపండు పులుసు మరుగుతున్న సమయంలో చేప ముక్కలను వేసుకుని ఉడికించుకోవాలి. తరువాత గరంమసాలా, బెల్లం పొడి వేసుకోవాలి. చివరగా మెంతి పొడి వేస్తే గుమ్మనే చేపల పులుసు కి కొద్ది కొత్తిమీర వేసుకుని దింపుకోవాలి అంతే చేప ఇగురు పులుసు రెడీ.

'''
  ]
];
List<List> jonna = [
  [
    'రాగి మాల్ట్‌',
    '‌రాగి దోశ',
    'రాగి లడ్డు‌',
    'జొన్న రొట్టెలు‌',
  ],
  [
    "రాగి మాల్ట్",
    "images/java.jpg",
    ''' 
  రాగిపిండి: 1cup 
  కార్న్ ఫ్లోర్: 1/2cup 
  మంచినీళ్ళు: 3glass 
  చిక్కటి పాలు (కాచినవి): 3glass 
  పంచదార: 1cup 
  యాలకుల పొడి: 1/2tsp 
  బ్లాక్ పెప్పర్ పౌడర్: 1/2tsp 
  ఉప్పు: చిటికెడు
''',
    ''' 
Step-1: ముందుగా రాగి పిండి, కార్న్ ప్లోర్ లలో తగినన్ని నీళ్ళు పోసి మెత్తని పేస్టులా కలపాలి. 

Step-2: తర్వాత స్టౌ మీద పాత్రలో నీళ్ళు పోసి మరిగించాలి. 

Step-3: తర్వాత అందులో పంచదార, ఉప్పు, యాలకుల పొడి, మిరియాల పొడి వేసి రాగి మిశ్రమం జారుగా పోస్తూ వేగంగా గరిటెతో తిప్పుతూ సన్నటి సెగ మీద రెండు మూడు నిమిషాలు ఉడికించి, క్రిందికి దించి పాలు కలిపితే రాగి మాల్ట్ రెడీ....
'''
  ],
  [
    "రాగి దోశ",
    "images/ragi1.jpg",
    ''' 
రాగి పిండి: 1cup 
సెమోలినా: 1cup 
రైస్ పిండి: 1/2cup 
మైదా పిండి: 1/2cup 
మజ్జిగ: 1cup 
నీరు: తగినన్ని 
ఉప్పు: రుచికి సరిపడా 
పచ్చిమిరపకాయలు: 2(చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
జీలకర్ర: 1tsp 
కొత్తిమీర: 2tbsp(సన్నగా తరిగిపెట్టుకోవాలి) 
కరివేపాకు: రెండు రెమ్మలు 
నూనె: 2tsp
''',
    ''' 
Step-1: ముందుగా ఒక మిక్సింగ్ బౌల్ తీసుకొని అందులో పదార్థాలన్నింటిని వేయాలి. 

Step-2: తర్వాత అందులో ఒక కప్పు నీళ్ళు పోసి పిండిని కొంచెం జారుడుగా కలుపుకోవాలి. 

Step-3: తర్వాత దోసె పాన్ వేడి, అందులో దోసె పిండిని దోసెలా వేసి సర్కులర్ మోషన్ లో పిండిని తవా మొత్తం సర్ధాలి . 

Step-4: తర్వాత దోస అంచు చుట్టూ నూనె కొన్ని చల్లుకొని, మూత పెట్టాలి. 

Step-5: మూత పెట్టిన తర్వాత మీడియం మంట మీద 2-3నిముషాలు దోసె కాలనివ్వాలి. 

Step-6: తర్వాత మూత తీసి, దోసెను తీసి రెండవ వైపు కూడా కాల్చుకోవాలి. 

Step-7: చివరగా దోసె మీద చీజ్ ను గార్నిష్ చేయాలి. వేడి మీద చీజ్ రాయడం వల్ల చీజ్ కరిగి క్రీమిగా అద్భుతమైన టేస్ట్ ను అందిస్తుంది. ఈ రాగి చీజ్ దోసె తయారు చేయడం సులభం మరియు త్వరగా తయారవుతుంది కాబట్టి బ్రేక్ ఫాస్ట్ కు మంచి కాంబినేషన్.

'''
  ],
  [
    "రాగి లడ్డు",
    "images/laddu.jpg",
    ''' 
  రాగిపిండి: 1cup 
  బెల్లం తురుము: 1cup 
  పల్లీలు: 1cup 
  నెయ్యి: 1cup 
  జీడిపప్పు: 8 
  నువ్వులు: 1cup 
  బాదం పప్పు: 1/2cup 
  యాలకల పొడి: 1tsp 
  ద్రాక్ష: 8
''',
    ''' 
Step-1: మొదటగా స్టౌవ్ పై పాన్ పెట్టి అందులో విడివిడిగా పల్లీలు, నువ్వులు, బాదం పప్పు, జీడిపప్పు, రాగి పిండి వేయించి పెట్టుకోవాలి. 

Step-2: మిక్సీ జార్ తీసుకొని అందులో వేయించి పెట్టుకొన్న పల్లీలు, నువ్వులు, బాదం పప్పు, జీడిపప్పు వేసి గ్రైండ్ చేసి పెట్టుకోవాలి. 

Step-3: ఆ తర్వాత ఈ మిశ్రమానికి పైన వేయించి పెట్టుకున్న రాగిపిండి కలిపి, దాంతో పాటు ఒక కప్పు బెల్లం తురుము, ఒక కప్పు నెయ్యి, యాలకల పొడి వేసి బాగా కలిపి లడ్డుగా చేసుకుని పైన జీడిపప్పు, ద్రాక్షతో గార్నిష్ గా అలంకరిస్తే రాగి లడ్డు రెడీ. (రాగి పిండి మరీ పొడిగా ఉంటే కొద్దిగా పాలు కలిపి లడ్డులా చేసుకోవచ్చు).
'''
  ],
  [
    "జొన్న రొట్టెలు",
    "images/parata.jpg",
    ''' జొన్నపిండి: 4cup 
  ఉప్పు: కొద్దిగా 
  వేడి నీళ్ళు పిండికలుపుకోవడానికి సరిపడా''',
    ''' 
  Step-1: ముందుగా జొన్నపిండిని ఒక పెద్ద మిక్సింగ్ బౌల్లో తీసుకోవాలి. 

  Step-2: అందులో కొద్దిగా ఉప్పు వేయాలి. 

  Step-3: తర్వాత వేడినీళ్ళు పోసుకొని మెత్తగా సాప్ట్ గా కలుపుకోవాలి. ఎక్కువ నీరు తీయకుండా కలుపుకోవాలి . 

  Step-4: తర్వాత ఈ పిండి నుండి కొద్దికొద్దిగా తీసుకుంటే ఉండలు చేసి పక్కన పెట్టుకోవాలి. 

  Step-5: తర్వాత రోలింగ్ స్టిక్ తీసుకొని , ఒక్కొ ఉండను చపాతీల రోల్ చేసుకోవాలి. లేదా చేత్తోనే అరచేతిలో పెట్టి ఒత్తుకోవచ్చు . 

  Step-6: అంతలోపు స్టౌ మీద పాన్ పెట్టి వేడి అయ్యాక ఇలా చపాతీల ఒత్తిపెట్టుకొన్న జొన్న రొట్టెను వేసి మీడియం మంట మీద రెండు వైపులా కాల్చుకోవాలి. ఇలా మొత్తం రొట్టెలను కాల్చుకొని పక్కన పెట్టుకోవాలి.'''
  ],
];
List<List> vegetable = [
  [
    'పాలకూర పప్పు',
    'తోటకూర పప్పు‌',
    'పాలకూర వేపుడు‌',
    'పాలక్ రైతా రిసిపి',
    'పాలక్ చపాతీ',
    'బ్రొకోలీ 65',
    'ఉసిరికాయ పప్పు',
  ],
  [
    "పాలకూర పప్పు",
    "images/aaku2.jpg",
    '''
   కందిపప్పు : 1cup 
   పాల కూర : చిన్నవి ఐతే రెండు కట్టలు 
   చుక్క కూర : ఒక కట్ట 
   పచ్చి మిర్చి : 6-8 
   ఉల్లిపాయ : 1 
   టమోటా : 2 
   పసుపు : 1/2tsp 
   ఉప్పు: రుచికి తగినంత 

   పోపు కోసం: 
   
   వెల్లుల్లి రెబ్బలు: 4-6 
   ఎండుమిర్చి : రెండు 
   కరివేపాకు : రెండు రెమ్మలు 
   జీల కర్ర : 1tsp 
   ఆవాలు : 1tsp 
   ఇంగువ : చిటికెడు 
   నెయ్యి : 2tsp
''',
    ''' 
Step-1: పప్పులో కాస్త ఉప్పు వేసి ఉడికించి పక్కన పెట్టాలి. 

Step-2: తర్వాత పాన్ లో నూనె పోసి జీలకర్ర, ఆవాలు, పచ్చిమిరపకాయలు వేయించాలి. వెల్లుల్లి పాయలను చిదిమి అందులో వేయాలి. ఉల్లిపాయ కూడా వేసి బ్రౌన్ రంగు వచ్చేవరకు వేపాలి. 

Step-3: ఇప్పుడు టమాటముక్కలను, పాలకూర వేసి కలపాలి. ఇప్పుడు కాస్త అల్లం, వెల్లుల్లి పేస్ట్, పసుపు, కారం, ధనియా, జీలకపూరపొడులను వేయాలి. పదిహేను నిమిషాల పాటు వేయించి బాగా కలపాలి. 

Step-4: ఆ తర్వాత పప్పు, కొన్ని నీళ్లు పోయాలి. ఇలా ఓ అరగంట తర్వాత నెయ్యి వేసి దించిస్తే వేడి.. వేడి తోటకూర పప్పు మీ నోరూరిస్తుంది.
'''
  ],
  [
    "తోటకూర పప్పు",
    "images/aaku2.jpg",
    ''' 
తోటకూర: 4కట్టలు 
కందిపప్పు: 1cup 
జీలకర్ర: 1/2tsp 
ఆవాలు: 1tsp 
పచ్చిమిరపకాయలు: 8-10 
కారం: తగినంత 
వెల్లుల్లిపాయలు: 4-6రెబ్బలు 
ఉల్లిపాయ: 1 
టమాట: 2-4 
అల్లం, వెల్లుల్లి పేస్ట్: 1tsp 
పసుపు: తగినంత 
ధనియాలపొడి, జీలకపూరపొడి: 1tsp 
నెయ్యి: 1tsp 
నూనె: తగినంత 
ఉప్పు: రుచికి తగినంత
''',
    ''' 
Step-1: పప్పులో కాస్త ఉప్పు వేసి ఉడికించి పక్కన పెట్టాలి. 

Step-2: తర్వాత పాన్ లో నూనె పోసి జీలకర్ర, ఆవాలు, పచ్చిమిరపకాయలు వేయించాలి. వెల్లుల్లి పాయలను చిదిమి అందులో వేయాలి. ఉల్లిపాయ కూడా వేసి బ్రౌన్ రంగు వచ్చేవరకు వేపాలి. 

Step-3: ఇప్పుడు టమాటముక్కలను, తోటకూర వేసి కలపాలి. ఇప్పుడు కాస్త అల్లం, వెల్లుల్లి పేస్ట్, పసుపు, కారం, ధనియా, జీలకపూరపొడులను వేయాలి. పదిహేను నిమిషాల పాటు వేయించి బాగా కలపాలి. 

Step-4: ఆ తర్వాత పప్పు, కొన్ని నీళ్లు పోయాలి. ఇలా ఓ అరగంట తర్వాత నెయ్యి వేసి దించిస్తే వేడి.. వేడి తోటకూర పప్పు మీ నోరూరిస్తుంది.
'''
  ],
  [
    "పాలకూర వేపుడు",
    "images/aaku2.jpg",
    ''' 
పాలకూర: 4కట్టలు 
పెసరపప్పు: 100grm 
వెల్లుల్లి: 8 
ఉల్లిపాయ: 1 
పచ్చిమిర్చి: 10 
ఉప్పు : రుచికి సరిపడా 
పసుపు: 1/4 tsp 
పోపుదినుసులు: 2tsp 
ఆయిల్: 100grm
''',
    ''' 
Step-1: పాలకూరను శుభ్రంగా కడిగి సన్నగా తరిగి పెట్టుకోవాలి. 

Step-2: పాన్ లో ఆయిల్ వేసి, కాగిన తర్వాత తాలింపు గింజలు, ఎండుమిర్చి, పాలకూర, పెసరపప్పు, వెల్లుల్లి రెబ్బలు, ఉప్పు, పసుపు వేసి కాసేపు వేయించాలి. 

Step-3: వేగాక కొద్దిగా నీళ్లు పోసి మూత పెట్టి తక్కువ మంటలో ఉడికించాలి. కూర బాగా ఉడికి పొడిపొడిగా అయిన తర్వాత దింపేయాలి. అంతే పాలకూర వేపుడు రెడీ. ఇది చపాతీలకు, రైస్ సైడ్ డిష్ గా చాలా టేస్టీగా ఉంటుంది.
'''
  ],
  [
    "పాలక్ రైతా రిసిపి",
    "images/aaku2.jpg",
    ''' 
  పాలకూర : 1/2cup(ఒక కట్టను సన్నగా తరిగిపెట్టుకోవాలి) 
  చిక్కటి పెరుగు : 2cup 
  పచ్చి మిర్చి : 4(మిక్సీలో వేసి మెత్తగా చేయాలి లేదా సన్నగా తరిగిపెట్టుకోవచ్చు) 
  శనగపప్పు : 1tsp 
  మినప్పప్పు : 1tsp 
  ఆవాలు : 1tsp 
  జీలకర్ర : 1/2tsp 
  ఎండు మిర్చి : 6 
  కరివేపాకు : రెండు రెమ్మలు 
  పసుపు : చిటికెడు 
  ఉప్పు : తగినంత 
  మిరియాలు, జీలకర్ర పొడి : 1/2tsp 
  నూనె : 2tbsp
''',
    ''' 
Step-1: ముందుగా ఆకుకూరను శుభ్రం చేసుకొని, వేడినీటిలో వేసి అదునిముషాల తర్వాత తీసేయాలి. మెత్తగా ఉడికించకూడదు. తర్వాత పాన్ లో నూనె వేసి కాగాక ఆకుకూర లైట్ గా వేయించి పక్కన ఉంచాలి. 

Step-2: తర్వాత గిన్నెలో పెరుగు, ఉప్పు, పసుపు, కొద్దిగా నీళ్లు వేసి గిలక్కొట్టాలి. 

Step-3: ఇప్పుడు మరో డ్రీఫ్ ఫ్రైయింగ్ పాన్ లో నూనె వేసి కాగాక అందులో శనగపప్పు, మినప్పప్పు, ఆవాలు, ఎండు మిర్చి, కరివేపాకు వరుసగా వేసి వేయించాలి. 

Step-4: అంతులోపు చిలకించిన పెరుగులో... వేయించి ఉంచుకున్న ఆకుకూర తురుము వేసి కలపాలి. 

Step-5: తర్వాత అలాగే వేయించి ఉంచుకున్న పోపు కూడా జోడించాలి. 

Step-6: చివరగా మిరియాలు, జీలకర్ర పొడి వేసి బాగా కలిపి సర్వ్ చేయాలి. అంతే పాలక్ రైతా రెడీ. ఇది అన్నంలోకి, రోటీలలోకి చాలా బాగుంటుంది.
'''
  ],
  [
    "పాలక్ చపాతీ",
    "images/parata.jpg",
    ''' 
  పాలకూర: 200grm 
  గోధుమపిండి: 2 cups 
  వెల్లుల్లి రెబ్బలు: 3-4 
  పచ్చిమిర్చి: 5-10 
  ఉప్పు: రుచికి సరిపడా
''',
    '''
 Step-1: ముందుగా కొన్ని పాలకూరను శుభ్రంగా కడిగి , కొద్దిగా ఉప్పు చిలకరించి బాయిల్ చేయాలి. ఆకుకూర మెత్తగా అయ్యే వరకూ ఉడికించుకోవాలి. 

 Step-2: 10 నిముషాల ఉడికించుకొన్న తర్వాత, మూత తీసి ఎక్సెస్ వాటర్ ను తొలగించాలి .ఆకు కూర చల్లగా మారిన తర్వాత మిక్సీ జార్ లో వేసి మెత్తగా పేస్ట్ చేసుకోవాలి. 

 Step-3: పాలకూరతో పాటు అల్లం మరియు పచ్చిమిర్చి కూడా వేసి నీళ్లు పోయకుండా పేస్ట్ చేయాలి. 

 Step-4: ఇప్పుడు బౌల్ తీసుకొని, గోధుమపిండి, ఉప్పు వేసి మిక్స్ చేసి పిండిని మెత్తగా కలుపుకోవాలి. 

 Step-5: తర్వాత పిండిలోనే ముందుగా పేస్ట్ చేసి పెట్టుకొన్న ఆకుకూరను కూడా వేసి మొత్తం పిండిని చపాతిల పిండిలా కలుపోవాలి. నీరు సరిపోయంత మాత్రమే వేసి కలుపుకోవాలి.10నిముషాలు పక్కన పెట్టాలి. 

 Step-6: 10 నిముషాల తర్వాత పిండి నుండి కొద్ది కొద్దిగా పిండిని తీసుకొని చపాతీల్లా రోల్ చేసుకోవాలి. 

 Step-7: ఇలా అన్ని చపాతీలను చేసుకొన్న తర్వాత స్టౌ మీద పాన్ పెట్టి చపాతీలను ఒక్కొక్కటి వేసి రెండు వైపులా బాగా కాల్చాలి.అంతే పాలక్ చపాతీ రెడీ. 

 Step-8: ఈ చపాతీలను సర్వింగ్ ప్లేట్ లోకి మార్చుకొని మీకు నచ్చిన రైతాతో సర్వ్ చేయాలి.
'''
  ],
  [
    "బ్రొకోలీ 65",
    "images/brocoli.JPG",
    ''' 
  బ్రోకలీ - 3 కప్పులు (చిన్న ముక్కలుగా కట్ చేసుకోవాలి)  
  అల్లం వెల్లుల్లి పేస్ట్ - 1 టేబుల్ స్పూన్  
  మిరప పొడి - 1 టేబుల్ స్పూన్  
  కాశ్మీరీ చిల్లి పౌడర్ - 1 టేబుల్ స్పూన్  
  గరం మసాలా - 1 టేబుల్ స్పూన్  
  బియ్యం పిండి - 1/2 కప్పు  
  మైదా - 1/4 కప్పు  
  మొక్కజొన్న పిండి - 2 టేబుల్ స్పూన్లు  
  బేకింగ్ సోడా - 1/4 స్పూన్  
  ఉప్పు - అవసరమైన మొత్తం  
  నిమ్మరసం - 1 టేబుల్ స్పూన్  
  నీరు - అవసరమైనంత  
  నూనె - వేయించడానికి అవసరమైనంత''',
    ''' 
  Step-1: మొదట ఒక గిన్నెను నీటిని తీసుకుని అందులో తరిగిన బ్రోకలీని వేసి ఓవెన్‌లో వేసి కొద్దిగా ఉప్పు వేసి 5 నిమిషాలు ఉడికించాలి. 

  Step-2: తర్వాత నీటిని తీసివేసి, ఒక గిన్నెలో బ్రోకలీని తీసుకోండి. 

  Step-3: తర్వాత నూనె మినహా పై పదార్థాలన్నింటిని ఒక గిన్నెలో వేసి బాగా కలపాలి. 

  Step-4: చివరగా ఓవెన్‌లో వేయించడానికి పాన్ పెట్టి వేయించడానికి కావలసినంత నూనె పోసి వేడి చేయాలి. 

  Step-5: నూనె వేడిగా ఉన్నప్పుడు, ముందుగానే పైన సూచించిన పదార్థాలతో కలిపి పెట్టుకున్న బ్రొకోలీని ముక్కలుముక్కలుగా వేసి బంగారు గోధుమ రంగు వచ్చేవరకు వేయించాలి, అంతే కరకరలాడే బ్రోకలీ 65 సిద్ధంగా ఉంటుంది!
'''
  ],
  [
    "ఉసిరికాయ పప్పు",
    "images/aaku2.jpg",
    ''' 
  కందిపప్పు: 100grm 
  ఉసిరికాయలు: 10 
  నూనె: తగినంత 
  పసుపు: చిటికెడు 
  ఇంగువ: చిటికెడు 
  ఉప్పు: రుచికి సరిపడా 
  పచ్చిమిర్చి: 4 
  ఎండుమిర్చి: 4 
  ఆవాలు: 1tsp 
  జీలకర్ర: 1tsp 
  మినప్పప్పు: 1tsp 
  కరివేపాకు: రెండు రెమ్మలు 
  కొత్తిమీర: రెండు రెమ్మలు''',
    ''' 
  Step-1: ముందుగా ఉసిరికాయలను ముక్కలు చేసుకోవాలి. 
  Step-2: తర్వాత కందిపప్పు, ఉసిరిముక్కలను విడివిడిగా ఉడకబెట్టాలి. 
  Step-3: ఇప్పుడు పాన్ లో నూనె వేసి వేడయ్యాక మినప్పప్పు, ఆవాలు, జీలకర్ర, ఇంగువ, పసుపు, ఎండుమిర్చి, పచ్చిమిర్చి, కరివేపాకు వేసి దోరగా వేగించుకోవాలి. 
  Step-4: తరవాత పక్కన పెట్టుకున్న ఉడికించుకున్న ఉసిరిముక్కలను అందులో వేసి ఒకసారి దోరగా వేయించాలి. చివరగా ఉడికించుకున్న పప్పు, ఉప్పులను అందులో వేసి కొత్తిమీరతో గార్నిష్ చేయాలి అంతే ఉసిరికాయ పప్పు రెడీ.
'''
  ]
];
List<List> sambar = [
  [
    'సాంబార్',
    'టొమాటో రసం',
    'మజ్జిగ పులుసు',
    'వాము రసం ',
    'అల్లం పులుసు',
    'వెజిటేబుల్ బట్టర్ మిల్క్ సాంబార్ రిసిపి',
    'ఉడిపి స్టైల్ సాంబార్',
  ],
  [
    "సాంబార్",
    "images/sambar1.jpg",
    ''' 
  కూరగాయ ముక్కలు: 3cups(బెండకాయలు, టొమాటో, మునగకాడ, సొరకాయ, ఉల్లిపాయలు, క్యారట్, ముల్లంగి, దోస, తోటకూర) 
  చింతపండు: పెద్ద నిమ్మకాయంత(నానబెట్టి రసం తీయాలి) 
  ఉప్పు: తగినంత 
  నూనె: సరిపడా 
  పసుపు: 1/4tsp 
  ఇంగువ: 1/4tsp 
  రసం పొడి: 1tsp 
  ఎండు మిర్చి: 5 
  పచ్చి మిర్చి: 5(మధ్యకు పొడవుగా కట్ చేయాలి) 
  ఆవాలు: 1tsp 
  జీలకర్ర: 1tsp 
  బియ్యప్పిండి: 1tbsp 
  బెల్లం పొడి: 1tbsp 
  కొత్తిమీర: చిన్న కట్ట 
  కరివేపాకు: 2రెమ్మలు
''',
    ''' 
Step-1: ముందుగా అన్ని కూరగాయ ముక్కలను ఒక గిన్నెలో వేసి, తగినంత ఉప్పు, నీళ్లు జత చేసి ఉడికించాలి. 

Step-2: తర్వాత చింతపండు రసం వేసి మరిగించాలి. 

Step-3: తర్వాత చిన్న పాన్ లో నూనె వేసి కాగాక ఇంగువ, ఆవాలు, జీలకర్ర, ఎండు మిర్చి, పచ్చి మిర్చి వేసి వేయించి, మరుగుతున్న పులుసులో వేయాలి. 

Step-4: కొద్దిసేపటి తర్వాత ఒక టేబుల్ స్పూన్ బెల్లం పొడి వేసి మరోమారు కలపాలి. చిన్న గిన్నెలో కొద్దిగా నీళ్లలో బియ్యప్పిండి వేసి ఉండలు లేకుండా కలిపి, ఉడుకుతున్న పులుసులో వేసి మరిగించాలి. 

Step-5: కొత్తిమీర, కరివేపాకు, రసం పొడి, పసుపు వేసి బాగా కలిపి దించేయాలి. అంతే సాంబార్ రెడీ
'''
  ],
  [
    "టొమాటో రసం",
    "images/tomato.jpg",
    '''
  టమోటాలు - 3 
  నీరు - 3 కప్పులు 
  వెల్లుల్లి (తొక్క తీయకుండా) - 4 రేకలు 
  లవంగాలు - 1 స్పూన్ 
  జీలకర్ర - 2 స్పూన్స్ 
  ఉప్పు - రుచికి సరిపడా 
  చింతపండు - అర నిమ్మకాయ పరిమాణం 
  రసం పొడి - 2 టేబుల్ స్పూన్లు 
  నూనె - 2 టేబుల్ స్పూన్లు 
  ఆవాలు - 1 స్పూన్ 
  కరివేపాకు - 8-10 
  ఇంగువ - చిటికెడు 
  కొత్తిమీర ఆకులు (సన్నగా తరిగిన) - ½ కప్పు 
  నెయ్యి - 2 స్పూన్స్''',
    ''' 
  Step-1: టమోటాలు తీసుకోని టమోటా పై భాగంలో కట్ చేయాలి. 
  
  Step-2: టమోటాకు మూడు నిలువు గాట్లు పెట్టాలి. 

  Step-3: టమోటాలను హెవీ హీటెడ్ పాన్ లో వేయాలి. 

  Step-4: దానిలో నీరు పోసి 15 నిమిషాల పాటు మృదువుగా మారే వరకు ఉడికించాలి. 

  Step-5: టమోటాలను బౌల్ లోకి తీసుకోవాలి. పాన్ లో నీటిని తరవాత ఉపయోగించాలి. 

  Step-6: టమోటాలను 5 నిమిషాల పాటు చల్లారనివ్వాలి. 

  Step-7: టమోటాల తొక్క తీసేసి కొంచెం మాష్ చేసి పక్కన పెట్టాలి. 

  Step-8: సనికిలిలో వెల్లుల్లి వేయాలి. 

  Step-9: దానిలో ఒక స్పూన్ మిరియాలు మరియు ఒక స్పూన్ జీలకర్ర వేయాలి. 

  Step-10: రోకలితో కచ్చా పచ్ఛాగా నూరాలి. 

  Step-11: పాన్ లో నీటిని రెండు నిమిషాల పాటు వేడి చేయాలి. 

  Step-12: దానిలో టమోటా గుజ్జు మరియు నూరిన వెల్లుల్లి పేస్ట్ వేయాలి. 

  Step-13: ఉప్పు మరియు చింతపండు వేసి 8 నుంచి 10 నిమిషాల పాటు ఉడికించాలి. 

  Step-14: రసం పొడి కలపాలి. 

  Step-15: రసంను బౌల్ లోకి తీసుకోవాలి. 

  Step-16: తాలింపు పాన్ పొయ్యి మీద పెట్టి ఒక స్పూన్ నూనె వేయాలి. 

  Step-17: దానిలో ఆవాలు మరియు ఒక స్పూన్ జీలకర్ర వేయాలి. 

  Step-18: ఆ తర్వాత ఇంగువ,కరివేపాకు వేయాలి. 

  Step-19: బాగా వేగనివ్వాలి. 

  Step-20: వేగిన తాలింపును రసంలో పోయాలి. 

  Step-21: తరిగిన కొత్తిమీర కలపాలి. 

  Step-22: నెయ్యి కలపాలి. 

  Step-23: ఒక బౌల్ లోకి రసంను తీసుకోని అన్నంలోకి సర్వ్ చేయాలి. 

  INSTRUCTIONS :
  
  1. మీరు రసం పొడికి బదులు సాంబార్ పొడి ఉపయోగించవచ్చు. 
  2. రసం చిక్కగా రావటానికి ఉడికించిన పప్పును కలపవచ్చు.
'''
  ],
  [
    "మజ్జిగ పులుసు",
    "images/oats.jpg",
    ''' 
  మజ్జిగ: 2glss 
  పచ్చి మిరపకాయులు: 4 
  ఉల్లిపాయ: 1 
  పసుపు: చిటికెడు 
  నూనె: 2tbsp 
  పోపుదినుసులు, ఆవాలు:1/2tsp 
  జీలకర్ర: 1tsp 
  కరివేపాకు: మూడు రెబ్బలు 
  పచ్చిశెనగపప్పు: 1tsp
''',
    '''
 Step-1: మజ్జిగను బాగా చిలికి మరీ నీళ్ళగా కాకుండా కొద్దిగా చిక్కగా తయారుచేసి ప్రక్కన పెట్టుకోవాలి. 
 
 
 Step-2: తర్వాత ఉల్లిపాయ, పచ్చిమిరపకాయలు తరిగి ప్రక్కన పెట్టుకోవాలి. 
 
 Step-3: ఇప్పుడు స్టౌ మీద పాన్ పెట్టి, నూనె వేసి, వేడయ్యాక అందులో ఆవాలు, జీలకర్ర, పచ్చిమిరపకయాలు, పచ్చిశెనగపప్పు, కరివేపాకు వేసుకోవాలి. 
 
 Step-4: పోపు వేగుతుండగా పసుపు, ఉప్పు వేసి కలుపుకోవాలి. పోపు వేగిన తరవాత స్టౌ ఆఫ్ చేసి, అందులో ముందుగా చిలికి పెట్టుకొన్న మజ్జిగను వేసి, పోపులో బాగామిక్స్ చేయాలి. అంతే! ఎంతో రుచిగా వుండే మజ్జిగ చారు రెడీ!
'''
  ],
  [
    "వాము రసం",
    "images/pasta.jpg",
    ''' 
  250 గ్రాముల మెంతులు  
  100 గ్రాముల వాము  
  50 గ్రాముల నల్ల జిలకర
''',
    ''' Step-1: ముందుగా 3 పదార్థాలను వేరు వేరుగా పెనం పైన వేసి కొద్దిగా వేడి చేయాలి.
 
    Step-2: తర్వాత మెంతులు, వాము, నల్ల జిలకర కలిపి పొడిగా చేసుకోవాలి.
 
    Step-3: ఆ పొడిని గాలి పోయే వీలులేని సీసాలో నిల్వ చేసుకోవాలి.
 
    Step-4: మీకు అవసరం అనిపిస్తే ఈ పొడికి కొద్దిగా అల్లంపొడి, ఇంగువ పొడి కూడా వేసి మిక్స్ చేసి నిల్వ చేసుకోవచ్చు
 
    Step-6: ఈ పొడిని పెరుగుతో కూడా తీసుకోవచ్చు. పెరుగన్నంకు కొద్దిగా ఈ పొడి చేర్చి, తీసుకోవాలి. ఇది రుచిని పెంచుతుంది. అనేక ప్రయోజనాలను అందిస్తుంది.
'''
  ],
  [
    "అల్లం పులుసు",
    "images/oats.jpg",
    ''' 
  అల్లం - 100 grm 
  చింతపండు - ఉసిరికాయంత 
  ఉల్లిపాయలు - 2 
  జిలకర్ర - 1 tsp 
  ఎండ మిర్చి - 4 
  ఆవాలు - 1 tsp 
  వెల్లుల్లి - 4 రెబ్బలు 
  పసుపు - 1/4 tsp 
  కొత్తిమిర - 1/2 cup 
  ధనియాలు - 1 tbsp 
  కరివేపాకు - 2 రెమ్మలు 
  పచ్చిమిర్చి - 3
''',
    ''' 
Step-1: ముందుగా అల్లం శుభ్రం చేసి చిన్న చిన్న ముక్కలుగా తయారు చేసుకోవాలి. చింతపండులో నీరుపోసి కలిపి గుజ్జును తీసి పక్కన పెట్టుకోవాలి. 

Step-2: మిక్సర్ లో కట్ చేసి పెట్టుకొన్ అల్లం ముక్కలు, వెల్లుల్లి, ధనియాలు, జిలకర్ర, పసుపు వేసి గ్రైండ్ చేయాలి. 

Step-3: స్టౌ మీద పాన్ పెట్టి అందులో ఆయిల్ వేసి అందులో ఆవాలు, కరివేపాకు, ఉల్లిపాయలు, పచ్చిమిర్చి వేసి దోరగా వేయించాలి. తర్వాత ముందుగా రెడీ చేసి పెట్టుకొన్న అల్లం ముద్దను వేసి వేయించి, చింత గుజ్జును అందులో వేయాలి. 

Step-4: కొద్దిగా కాగాక కారం, ఉప్పు వేసి బాగా మరిగించాలి దీనిని ఒక బౌల్ లోకి తీసుకొని కొత్తిమిరతో అందంగా అలకరించాలి.
'''
  ],
  [
    "వెజిటేబుల్ బట్టర్ మిల్క్ సాంబార్ రిసిపి",
    "images/pasta.jpg",
    ''' 
  తెల్ల గుమ్మడికాయ ముక్కలు: 2cups(చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  శెనగపప్పు: 2 ½tbsp 
  పచ్చిమిర్చి: 3 (చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  కొబ్బరి తురుము: ½cup 
  అల్లం : చిన్న ముక్క 
  ధనియాలు : 1 ½ tsp 
  కొత్తిమిర : కొద్దిగా (సన్నగా తరిగిపెట్టుకోవాలి) 
  ఆవాలు: 1 tsp 
  జీలకర్ర : ½ tsp 
  హింగ్ : ¼ tsp 
  పసుపు : ¼ tsp 
  పెరుగు: 1cup 
  నీళ్ళు: 2cups 
  ఉప్పు: రుచికి సరిపడా 

  పోపుకోసం కావల్సినవి: 
  
  నూనె : 2tsp 
  ఆవాలు :1/2 tsp 
  ఎండు మిర్చి: 2 
  కరివేపాకు:రెండు రెమ్మలు
''',
    ''' 
Step-1: శెనగపప్పును నీటిలో వేసి కొద్దిసోపునానబెట్టుకోవాలి. 

Step-2: తర్వాత తెల్ల గుమ్మడికాయను శుభ్రం చేసి లోపలి విత్తనాలు తొలగించాలి. 

Step-3: ఇప్పుడు డీప్ బాటమ్ పాన్ తీసుకొని అందులో 2కప్పుల నీళ్ళు పోయాలి . మీడియం మంట మీద నీరు వేడి చేసుకోవాలి. తర్వాత అందులో ఉప్పు మరియు గుమ్మడి ముక్కలు వేసి మూత పెట్టి మెత్తగా ఉడికించుకోవాలి. 

Step-4: తర్వాత ఒక కప్పు పెరుగులో కొద్దిగా నీళ్ళు పోసి బాగా మిక్స్ చేసుకోవాలి. 

Step-5: ఇప్పుడు మిక్సీ జార్ లో నానబెట్టుకొన్న శెనగపప్పు, కొబ్బరి తురుము మరియు ఆవాలు, జీలకర్ర మరియు జీలకర్ర, పచ్చిమిర్చి ముక్కలు వేసి బాగా గ్రైండ్ చేయాలి. తర్వాత అందులో కొత్తిమీర, పసుపు, అల్లం, ఇంగువ వేసి మిక్స్ చేయాలి. తర్వాత కొద్దిగా నీళ్లు చేర్చి మెత్తగా పేస్ట్ చేసుకోవాలి. 

Step-6: ఇప్పుడు గుమ్మడి ముక్కలు మెత్తగా ఉడికించుకొని, నీరు వంపేసుకోవాలి . 

Step-7: ఉడికించుకొన్న గుమ్మడి ముక్కల్లో మీక్సీలో గ్రైండ్ చేసుకొన్న మిశ్రమాన్ని వేసి బాగా మిక్స్ చేయాలి. కొద్దిగా నీళ్ళు పోసి, బాగా మిక్స్ చేసి, స్టౌ మీద పెట్టి, తక్కువ మంట మీద ఉడికించుకోవాలి. 

Step-8: 10 నిముషాల తర్వాత అందులో చిక్కటి పెరుగు, అవసరం అయితే కొద్దిగా నీళ్ళు మరియు ఉప్పు మిక్స్ చేయాలి . 

Step-9: ఇప్పుడు మరో పాన్ తీసుకొని స్టౌ మీద పెట్టి, కొద్దిగా నూనె వేసి వేడయ్యాక అందులో పోపుకోసం సిద్దం చేసుకొన్న పదార్థాలన్నీ వేసి రెండు నిముషాలు ఫ్రై చేసుకోవాలి. 

Step-10: పోపు వేగిన తర్వాత అందులో పెరుగు గుమ్మడి ఉడించుకొన్న సాంబార్ ను పోసి బాగా మిక్స్ చేయాలి. తర్వాత సర్వ్ చేయాలి. అంతే వెజిటేబుల్ బట్టర్ మిల్క్ సాంబార్ రెడీ...
'''
  ],
  [
    "ఉడిపి స్టైల్ సాంబార్",
    "images/sambar1.jpg",
    '''
   కందిపప్పు : 1/2 cup 
   మెంతులు: 1/2 tsp 
   మినపప్పు : 1tsp 
   ఎండు మిర్చి : 4 
   ధనియాలు: 1 1/2tbsp 
   కరివేపాకు: 5 రెమ్మలు 
   కొబ్బరి తురుము: /4 cup 
   చిన్న ఉల్లిపాయలు: (సాంబార్ ఉల్లిపాయలు):25-30 (శుభ్రం ఒలిచి కడిగి పెట్టుకోవాలి) 
   ఆవాలు: 1/2 tsp
   హింగ్ (ఇంగువ) : ఒక చిటికెడు 
   పచ్చిమిర్చి: 2 (మద్యలోకి చీలికగా కట్ చేసుకోవాలి) 
   మీకు నచ్చిన కాయగూరల ముక్కలు: (వంకాయ, క్యారెట్లు, గుమ్మడికాయ, యామ్) : 2 cups 
   చింతపండు గుజ్జు: 1/2 tsp 
   నూనె: 2tbsp 
   బెల్లం: 1 1/2tsp 
   ఉప్పు : రుచికి సరిపడా''',
    '''
Step-1: ముందుగా కందిపప్పును కుక్కర్ లో వేసి కడిగి సరిపడా నీళ్ళు పోసి 3 విజిల్స్ వచ్చే వరకూ ఉడికించుకోవాలి. 

Step-2: పప్పు ఉడికిన తర్వాత కుక్కర్ క్రిందికి దింపుకొని, ప్రెజర్ తగ్గిన తర్వాత కుక్కర్ మూత తీసి మ్యాష్ చేసి పక్కన పెట్టుకోవాలి. 

Step-3: తర్వాత పాన్ లో ఒక టేబుల్ స్పూన్ నూనె వేసి, కాగిన తర్వాత అందులో మెంతులు మరియు ఉద్దిపప్పు వేసి ఒక సెకన్ రోస్ట్ చేయాలి. 

Step-4: తర్వాత అందులోనే ఎండు మిర్చి, ధనియాలు, రెండు రెమ్మలు కరివేపాకు, కొబ్బరి తురుము వేసి మొత్తం బ్రౌన్ కలర్ వచ్చే వరకూ అతి తక్కువ మంట మీద ఫ్రై చేసుకోవాలి. 

Step-5: వేగిన తర్వాత స్టౌ ఆఫ్ చేసి కొద్దిగా చల్లారిన తర్వాత మిక్సర్ లో వేసి, కొద్దిగా నీళ్ళు జోడించి పేస్ట్ లా తయారుచేసుకోవాలి. 

Step-6: ఇప్పుడు మరో పాన్ తీసుకొని అందులో మరో టేబుల్ స్పూన్ నూనెవ వేసి వేడి అయ్యాక అందులో ఆవాలు, ఇంగువ వేసి ఒక సెకను వేగించుకోవాలి. 

Step-7: ఇప్పుడు అందులోనే చిన్న ఉల్లిపాయలు, పచ్చిమిర్చి, మిగిలిన కరివేపాకు వేసి మరో 5నిముషాలు వేగించుకోవాలి. 

Step-8: తర్వాత కూరగాయ ముక్కలన్నింటిని వేసి మరో 5నిముషాలు ఫ్రై చేసుకోవాలి. 

Step-9: ఇప్పుడు ముందుగా ఉడికించి మ్యాష్ చేసి పెట్టుకొన్న పప్పు మరియు మిక్సీలో గ్రైండ్ చేసి పెట్టుకొన్న మసాలా పేస్ట్ ను అందులో వేసి మొత్తం మిశ్రమాన్ని కలగలుపుకోవాలి. 

Step-10: మంటను తగ్గించి మరికొన్ని నిముషాలు మొత్తం మిశ్రమాన్ని ఉడికించుకోవాలి . అంతే సర్వ్ చేయడానికి ఉడిపి సాంబార్ రెడీ. ఈ స్పెషల్ సాంబార్ రిసిపిని రైస్ లేదా ఇడ్లీతో తింటే చాలా రుచికరంగా ఉంటుంది.
 '''
  ]
];
List<List> biyyam = [
  [
    'శెనగల పులావ్',
    'టమోటో పనీర్ పులావ్',
    'ఆలూ గ్రీన్ చట్నీ పులావ్',
    'బీట్ రూట్ పనీర్ పులావ్',
    'స్పైసీ టమోటో-పుదీనా పులావ్',
    'పాలక్-పొటాటో పులావ్',
    'మటన్ పులావ్',
    'చికెన్ పులావ్',
  ],
  [
    "శెనగల పులావ్",
    "images/pulav.jpg",
    ''' 
  రైస్- 1cup 
  చిక్పీస్(శెనగలు) - 25gms 
  టొమాటోస్ - 2 (చిన్న ముక్కలుగా తరిగినవి) 
  బంగాళాదుంప - 1 (ఉడికించినవి) 
  ఆకుకూర - 1 రెమ్మ 
  (తరిగిన) కాప్సికం - 1 (ముక్కలుగా కట్ చేసుకోవాలి) 
  నూనె - 2tbsp 
  జీలకర్ర - 1tsp 
  హింగ్(ఇంగువ) - ½tsp 
  అల్లం- 1tbsp 
  పచ్చిమిర్చి- 2(ముక్కలుగా కట్ చేసుకోవాలి) 
  పసుపు - 1tsp 
  డ్రై మ్యాంగో పౌడర్ - ½ tsp 
  గరం మసాలా - ¼tsp 
  నీరు - 2 cups 
  ఉప్పు: రుచికి సరిపడా 
  బే ఆకు: 1
''',
    ''' 
Step-1: ముందుగా బియ్యంను శుభ్రంగా కడిగి 15నిముషాలు నానెబెట్టుకోవాలి. 

Step-2: తర్వాత రెండు మూడు గంటల ముందుగా నానబెట్టుకొన్న శెనగలు నుండి నీరు వంపేసి, కుక్కర్ లో వేసి 4విజిల్స్ వచ్చే వరకూ ఉడికించుకొని పక్కన పెట్టువాలి. 

Step-3: ఇప్పుడు పాన్ లో కొద్దిగా నూనె వేసి, వేడి చేయాలి. నూనె వేడయ్యాక అందులో జీలకర్ర వేసి చిటపటలాడాక అందులో అల్లం, పచ్చిమిర్చి మరియు పసుపు వేసి కొన్ని నిముషాలు వేయించుకోవాలి. 

Step-4: ఇప్పుడు అదే పాన్ లో టమోటో ముక్కలు మరియు ఉప్పు కూడా వేసి మరికొద్దిసేపు వేయించుకోవాలి. 

Step-5: టమోటో మొత్తగా వేగిన తర్వాత అందులో ముందుగా ఉడికించి పెట్టుకొన్న శెనగలు, బంగాళదుంప మరియు నీళ్ళు వేయాలి. ఇవి వేగిన తర్వాత పాన్ మూత పెట్టి పది నిముషాలు మీడయం మంట మీద ఉడికించుకోవాలి. 

Step-6: ఇవన్నీ మొత్తం ఉడికిన తర్వాత పాన్ లో ముందుగా ఉడికించి పెట్టుకొన్న అన్నం, ఆకుకూర, బిర్యానీ ఆకు మరియు క్యాప్సికమ్, వేసి బాగా మిక్స్ చేసి తర్వాత బాగా ఉడికించుకోవాలి. 15నిముషాలు మీడియం మంట మీద ఉడికించుకోవాలి. 

Step-7: అంతే శెనగలు పలావ్ రెడీ చివరగా డ్రై మ్యాంగో పౌడర్ మరియు గరం మసాలా కూడా వేసి నిదానంగా బాగా మిక్స్ చేసి, స్టౌవ్ ఆఫ్ చేయాలి. అంతే దీన్ని పెరుగు రైతా లేదా ఊరగాయతో సర్వ్ చేయాలి .
'''
  ],
  [
    "టమోటో పనీర్ పులావ్",
    "images/pulav.jpg",
    ''' 
బియ్యం: ఒక గ్లాస్ 
పనీర్: 150grms 
టమాటాలు: 4-5 
ఉల్లిపాయ: 1 
పచ్చిమిర్చి: 5-6 
కరివేపాకు: రెండు రెమ్మలు 
కొత్తిమీర: ఒక కట్ట 
పుదీనా: ఒక కట్ట 
ఉప్పు: రుచికి సరిపడా 
కారం: 1tsp 
పసుపు:1/4tsp 
అల్లంవెల్లుల్లి పేస్ట్: 2tbsp 
గరంమసాలా పొడి: 1tbsp 
నూనె: సరిపడా 
లవంగాలు, చెక్క,: 4: 1 
షాజీర: 1/2tsp 
బిర్యానీ ఆకు: 1
''',
    ''' 
Step-1: పనీర్ ను చిన్న ముక్కలుగా కోసుకుని కొంచెం ఉప్పు,కారం,పసుపు, పావు స్పూన్ గరంమసాలా పొడి వేసి కలిపి ఒక పావుగంట మారినేట్ చెయ్యాలి. 

Step-2: తర్వాత బియ్యం కడిగి ఒక పావుగంట నానబెట్టుకోవాలి. 

Step-3: అలాగే టమోటాలు కూడా ఉడికించి గ్రైండ్ చేసి గుజ్జులా చేసుకోవాలి. లేదా రెడీమేడ్ ప్యూరీ అయినా వాడొచ్చు. 

Step-4: పాన్ లో నూనె వేడి చేసి నాలుగు లవంగాలు, చెక్క, బిర్యానీ ఆకు, ఒక స్పూన్ షాజీర వేసి వేయించాలి. 

Step-5: ఇప్పుడు సన్నగా తరిగిన ఉల్లిపాయ, మిర్చి ముక్కులు వేసి కరివేపాకు వేసి వేగనివ్వాలి. 

Step-6: ఒక టేబుల్ స్పూన్ అల్లంవెల్లుల్లి పేస్ట్ వేసి వేగిన తరువాత టమాట గుజ్జు కూడా వేయాలి. 

Step-7: ఆ తర్వాత సన్నగా తరిగిన పుదీనా, కొత్తిమీర వేసి బాగా వేయించి మారినేట్ చేసిన పనీర్ ముక్కలు వేసి కలపాలి. 

Step-8: తగినంత కారం, పసుపు, ఒక టేబుల్ స్పూన్ గరంమసాలా పొడి వేసి బాగా కలిపి రెండు గ్లాసుల నీళ్ళు పోసి మరిగాక బియ్యం, తగినంత ఉప్పు వేసి కలిపి మూత పెట్టి మూడు విజిల్స్ రానివ్వాలి. 

Step-9: ఆవిరి పూర్తిగా తగ్గిన తరువాత మూత తీసి ఒకసారి కలిపి కొంచెం కొత్తిమీర చల్లుకోవాలి. అంటే టమోటో పనీర్ రైస్ రెడీ. వేడివేడిగా పెరుగుపచ్చడితో తింటే ఈపులావ్ చాలా రుచిగా ఉంటుంది.
'''
  ],
  [
    "ఆలూ గ్రీన్ చట్నీ పులావ్",
    "images/pulav.jpg",
    ''' 
  నూనె: 2tbsp 
  బిర్యానీ ఆకు: 1 
  పెద్దసైజు నల్లని ఇలాచి: 1(పొడిచేసి వేయాలి) 
  పచ్చిఇలాచి : 4(పొడిచేసి వేయాలి) 
  లవంగాలు: 4 
  దాల్చిన చెక్క: 1 
  అంగుళం జపత్రి: 1 లేదా 2 
  ఉల్లిపాలు : 2
  (సన్నని ముక్కలుగా కట్ చేసుకొన్నవి) 
  ఉడికించి పొట్టు తీసి పొట్టుకొన్న బంగాళదుంపలు: 10 
  పాలకూర పూరీ(పాలకూరను మెత్తగా పేస్ట్ చేసుకన్నది): 4tbsp 
  గ్రీన్ చట్నీ : 5tbsp 
  బాస్మతి రైస్: 11/2cup(కడిగి అరగంట పాటు నానబెట్టుకొన్న బాస్మతి రైస్) 
  నీళ్ళు సరిపడా: 2cups 
  ఉప్పు : రుచికి తగినంత
''',
    ''' 
Step-1: ముందుగా బియ్యం కడిగి పక్కన పెట్టుకోవాలి. 

Step-2: తర్వాత పాన్ లో కొద్ది నూనె వేసి వేడి చేసి, అందులో బిర్యానీ ఆకు, నల్ల ఇలాచి, గ్రీన్ ఇలాచి, జాపత్రి, దాల్చిన చెక్క, లవంగాలు, ఉల్లిపాయ ముక్కలు వేసి బ్రౌన్ కలర్ వచ్చే వరకూ ఫ్రై చేసుకోవాలి. 

Step-3: తర్వాత అందులోనే పాలక్ పేస్ట్ వేసి మొత్తం మిశ్రమం కలగలుపుతూ ఫ్రై చేసుకోవాలి. పాలక్ పూరీ పచ్చివాసన పోయే వరకూ ఫ్రై చేసుకోవాలి. 

Step-4: తర్వాత అందులో ముందుగా ఉడికించి పొట్టు తీసి పెట్టుకొన్న ఆలూ, గ్రీన్ చట్నీ కూడా వేసి 5 నిముషాలు ఫ్రై చేసుకోవాలి. 

Step-5: గ్రీన్ చట్నీ వేగిన తర్వాత ముందుగా కడిగి పక్కన పెట్టుకొన్న బియ్యంను అందులో వేసి మొత్తం కలగలిసేలా కలపాలి. 

Step-6: అలాగే రుచికి సరిపడా ఉప్పు వేసి మొత్తం మిశ్రమాన్ని కలగలిపి, మీడియం మంట మీద ఉడికించుకోవాలి. అంతే ఆలూ చట్నీ పులార్ రిసిపి రెడీ.
'''
  ],
  [
    "బీట్ రూట్ పనీర్ పులావ్",
    "images/pulav.jpg",
    ''' 
  బియ్యం: 2 cups 
  బీట్ రూట్ - 1 (grated) 
  పన్నీర్ - 100gms 
  నెయ్యి - 3 tbsp 
  మిరియాలు - 1 tbsp 
  ఉల్లిపాయలు- 1 (chopped) 
  జీడిపప్పు - 200 gms (chopped) 
  ఎండుద్రాక్ష - 1 cup 
  కారం- 1 tbsp 
  గరం మసాలా - ½ tbsp 
  పుదీనా - ½ cup(chopped) 
  కొత్తిమీర : కొద్దిగా 
  ఉప్పు: రుచికి సరిపడా
''',
    ''' 
Step-1: ముందుగా పాన్ లో కొద్దిగా నెయ్యి వేసి కాగిన తర్వాత అందులో మిరియాలు, ఉల్లిపాయ ముక్కలు వేసి రెండు నిముషాలు వేగించాలి. 

Step-2: తర్వాత అందులోనే జీడిపప్పు, ఎండు ద్రాక్ష వేసి ఒక నిముషం వేగనివ్వాలి. 

Step-3: ఇప్పుడు అందులోనే బీటర్ రూట్ తురుము, పనీర్ తురుము మరియు పచ్చిమిర్చి తరుగు వేసి మొత్తం మిశ్రమాన్ని మిక్స్ చేస్తూ ప్రై చేసుకోవాలి.  

Step-4: బీట్ రూట్, పనీర్ మెత్తబడ్డాక, అందులో గరం మసాలా, పుదీనా, ఉప్పు వేసి మొత్తం మిశ్రమాన్ని మిక్స్ చేయాలి. 

Step-5: మసాలా పచ్చివాసన పోయే వరకూ ఫ్రై చేసి అందులో కడిగిపెట్టుకొన్న బియ్యాన్ని వేసి మొత్తం మిశ్రమాన్ని కలగలుపుకోవాలి. 

Step-6: ఇప్పుడు ఈ మిశ్రమంలో మూడు కప్పుల నీరు పోసి మొత్తం మిక్స్ చేసి, 2విజిల్స్ వచ్చేవరకూ ఉడికించుకోవాలి. 

Step-7: విజిల్స్ వచ్చిన తర్వాత క్రిందికి దింపుకొని, కుక్కర్లో ఆవిరి మొత్తం తగ్గిన తర్వాత కొత్తిమీర చల్లి తర్వాత సర్వ్ చేయాలి.అంతే పనీర్ అండ్ బీట్ రూట్ పులావ్ రెడీ . గ్రీన్ చట్నీతో సర్వ్ చేస్తే చాలా రుచికరంగా ఉంటుంది.
'''
  ],
  [
    "స్పైసీ టమోటో-పుదీనా పులావ్",
    "images/pulav.jpg",
    ''' 
  బియ్యం: 500grm 
  టమోటోలు: 250grm 
  పుదీనా: 1కట్ట(సన్నగా తరిగి పెట్టుకోవాలి) 
  ఉల్లిపాయ: 1 
  పచ్చిమిర్చి: 4 
  అల్లం, వెల్లుల్లి పేస్ట్: 2tbsp 
  నెయ్యి, షాజీరా: ఒక్కొక్క చెంచా 
  యాలకులు: 5 
  లవంగాలు : 8 
  దాల్చిన చెక్క: చిన్నది 
  ఉప్పు: రుచికి సరిపడా 
  నూనె: తగినంత
''',
    ''' 
Step-1: ముందుగా బియ్యంను శుభ్రంగా కడిగి అరగంట పాటు నానబెట్టుకోవాలి. టమోటోలను మెత్తగా గ్రైండ్ చేసుకోవాలి. 

Step-2: తర్వాత మంద పాటి గిన్నెలో నూనె వేసి, వేడయ్యాక, అందులో ఉల్లిపాయ ముక్కలు, పచ్చిమిర్చి ముక్కలు, పుదీనా వేసి, 5నిముషాల పాటు, మీడియం మంట మీద వేగించుకోవాలి. 

Step-3: తర్వాత అందులోనే అల్లం, వెల్లుల్లి పేస్ట్, యాలకులు, లవంగాలు, దాల్చిన చెక్క, షాజీరా వేయాలి.  

Step-4: ఒక కప్పు బియ్యానికి ఒకటిన్నర్ గ్లాసు చొప్పున నీళ్లను తీసుకోవాలి. 

Step-5: ఇప్పుడు ఈ నీళ్ళలలో టమోటో పేస్ట్ ను వేసి, బాగా మిక్స్ చేసి, వేగుతున్న మిశ్రమంలో పోయాలి. 

Step-6: నీళ్ళు మరుగుతుండగా అందులో బియ్యం, ఉప్పు వేసి, మూతపెట్టాలి. అన్నం తయారయ్యాక అందులో నెయ్యి వేసి, మరో రెండు నిముషాలు అలాగే ఉండనిచ్చి తర్వాత దింపేసుకోవాలి. అంతే స్పైసీ టమోటో పులావ్ రెడీ...
'''
  ],
  [
    "పాలక్-పొటాటో పులావ్",
    "images/pulav.jpg",
    ''' 
  బాస్మతి రైస్: 2cupd 
  పాలకూర: రెండు కట్టలు 
  పొటాటో: 2 
  కారట్: 2 
  ఉల్లిపాయ: 2 
  పచ్చిమిర్చి: 4-6 
  కొత్తిమీర తరుగు: 1cup 
  అల్లంవెల్లుల్లి పేస్ట్: 2tbps 
  గరం మసాలా పొడి: 2tsp 
  ఉప్పు: రుచికి తగినంత 
  కారం: 1tsp 
  పసుపు: చిటికెడు 
  నూనె: కావలసినంత 
  చెక్క: చిన్న ముక్క 
  వంగాలు, యాలకులు: 2:2 
  షాజీర: కొద్దిగా
''',
    ''' 
Step-1: ముందుగా బాస్మతి బియ్యాన్ని కడిగి పదినిమిషాలు నాననివ్వాలి. 

Step-2: తర్వాత పొటాటో(బంగాళదుంప), కారట్ ను శుభ్రం చేసి కట్ చేసి పెట్టుకోవాలి. అలాగే పాలకూర, కొత్తిమీర సన్నగా తరిగి ఉంచుకోవాలి. 

Step-3: పాన్ లో నూనె పోసి వేడయ్యాక మసాల దినుసులు వేయాలి. సన్నగా తరిగిన ఉల్లి, పచ్చిమిర్చి వేసి వేయించాలి. అల్లంవెల్లుల్లి పేస్ట్ వేసి వేగిన తరువాత పాలకూర, పొటాటో, కారట్ తురుము వేసి వేగనివ్వాలి. 

Step-4: అందులోనే చిటికెడు పసుపు, కారం, గరం మసాలా పొడి, కొత్తిమీర వేసి కలపాలి. ఇప్పుడు తగినన్ని నీళ్ళు పోసి మరిగాక బియ్యం, తగినంత ఉప్పు వేసి కలిపి కుక్కర్ మూత పెట్టి మూడు విజిల్స్ రానివ్వాలి. 

Step-5: అంతే క్రిందికి దింపుకొని ఆవిరి అంతా పోయాక కుక్కర్ మూత తీసి ఒకసారి అంతా కలకలిపి వేడిగా రైతాతో వడ్డిస్తే రుచిగా ఉంటుంది.
'''
  ],
  [
    "మటన్ పులావ్",
    "images/mutton.jpg",
    ''' 
  మటన్ : 500grm 
  బాస్మతి రైస్: 1kg 
  కొబ్బరికాయ: 1 
  నెయ్యి: 4tsp 
  జీడిపప్పు: 10 
  ఉల్లిపాయలు: 4 
  అల్లం : 20grm 
  వెల్లుల్లి : 20grm 
  దాల్చిన చెక్క: కొద్దిగా 
  ధనియాలు : 20grm 
  గసగసాలు : 2tsp 
  పుదీన : ఒక కట్ట 
  కొత్తిమీర : ఒక కట్ట 
  పచ్చిమిరపకాయలు: 8-10 
  నూనె : తగినంత 
  ఉప్పు : రుచికి సరిపడా 
  బిర్యాని ఆకులు : రెండు 
  పెరుగు : 1cup
''',
    ''' 
Step-1: ముందుగా బాస్మతి బియ్యాన్ని అరగంట ముందు నాన పెట్టుకోవాలి. 

Step-2: గసగసాలు నూనె లేకుండా వేపి ప్రక్కన పెట్టుకోవాలి. 

Step-3: ధనియాలు, పచ్చిమిరపకాయలు, అల్లం, వెళ్ళుళ్ళి గ్రైండ్ చేసుకోవాలి. 

Step-4: గసగసాలు, పచ్చికొబ్బరి గ్రైండ్ చేసుకోవాలి 

Step-5: ఉల్లిపాయలను తరిగి ప్రక్కన పెట్టుకోవాలి. 

Step-6: పూదీన, కొత్తిమీర కడిగి పెట్టుకోవాలి. 

Step-7: మటన్ సుభ్రంగా కడిగి అందులో పుసుపు, ఉప్పు వేసి మూడు విజిల్స్ వచ్చే వరకు కుక్కర్లో పెట్టుకోవాలి. 

Step-8: ఒక పెద్ద గిన్నెను స్టౌ మీద పెట్టి అందులో నెయ్యి వేసి ఉల్లిపాయముక్కలు, గ్రైండ్ చేసి పెట్టుకున్న ధనియాలు, పచ్చిమిరపకాయలు, అల్లం వెళ్ళుళ్ళి పేస్ట్ వేసి వేగనివ్వాలి. ఇవి వేగుతుండగా జీడిపప్పు, పుదీన, కొత్తిమీర, గ్రైండ్ చేసి పెట్టుకున్న పచ్చికొబ్బరి, గసగసాల పేస్ట్, బిర్యాని ఆకు, పెరుగు వేసి కొంచెం నూనె వేసి బాగ వేగనివ్వాలి. 

Step-9: తరవాత ఉడికించి పెట్టుకున్న మటన్ వేగుతున్నమసాలలో వేసి కలిపి, నాన పెట్టుకున్న బాస్మతి బియ్యాని కూడ వేసి నాలుగు గ్లాసుల నీళ్ళు లేదా కొబ్బరి పాలు వేసుకుని నాలుగు వైపుల కలిపి ఉప్పు, కారం రుచి చూసి, కావలనిపిస్తే మరి కొంచెము వేసుకుని, చిన్న మంట మీద పెట్టి వుడకనివ్వాలి. 

Step-10: పదిహేను నిమషాలు తరవాత దించుకోవాలి. అంతే! ఎంతో రుచిగా వుండే మటన్ పులావ్ రెడీ! ఈ పులావ్ని సాలాడ్తో తింటే చాల రుచిగా వుంటుంది.
'''
  ],
  [
    "చికెన్ పులావ్",
    "images/biryani.jpg",
    ''' 
  రైస్: 2cups(శుభ్రంగా కడిగి, పది నిముషాలు నానబెట్టుకోవాలి) 
  చికెన్: 250 గ్రాముల(చిన్న ముక్కలుగా లేదా మీడియం సైజులో కట్ చేసుకోవాలి) 
  ఉల్లిపాయలు: 2 (చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  టమోటా: 1 (చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  పచ్చి మిర్చి: 2 (చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  పసుపు: 1tsp 
  కారం: 1 ½tsp 
  జీలకర్ర పొడి: 1tsp 
  కొత్తిమీర పొడి: 1tsp 
  గరం మసాలా: చిటికెడు 
  జీలకర్ర: 1tsp 
  బిర్యానీ ఆకు: 1 
  ఉప్పు: రుచికి సరిపడా 
  నూనె: 2tsp 
  నీళ్ళు: 2 cups
''',
    ''' 
Step-1: ముందుగా ప్రెజర్ కుక్కర్ లో నూనె వేసి వేడి చేయాలి. అందులో జీలకర్ర మరియు బిర్యానీ ఆకు వేసి వేగించుకోవాలి. 

Step-2: తర్వాత అందులో ఉల్లిపాయ ముక్కలు వేసి మీడియం మంట మీద రెండు నిముషాలు వేగించుకోవాలి. 

Step-3: ఇప్పుడు అందులో పచ్చిమిర్చి, ఉప్పు, పసుపు, వేసి బాగా మిక్స్ చేసి వేగించాలి. తర్వాత టమోటో ముక్కలు కూడా వేసి వేగించుకోవాలి. 

Step-4: టమోటో ముక్కలు కొంచెం మెత్తబడ్డాక అందులో కారం, ధనియాల పొడి, జీలకర్ర, గరం మసాలా, వేసి బాగా మిక్స్ చేయాలి. 

Step-5: మసాలా మొత్తం బాగా వేగిన తర్వాత అందులో ముందుగా శుభ్రం చేసి, కట్ చేసి పెట్టుకొన్నచికెన్ ముక్కలు వేసి మీడియం మంట మీద పది నిముషాలు వేగించాలి. 

Step-6: ఆ తర్వాత శుభ్రం చేసి, కడిగి పెట్టుకొన్న బియ్యం, సరిపడా నీళ్ళు వేసి బాగా మిక్స్ చేసి మూత పెట్టి, విజిల్ పెట్టి మీడియం మంట మీద మూడు విజిల్స్ వచ్చేవరకూ ఉడికించుకోవాలి. అంతే స్టౌ ఆఫ్ చేసి ఆవిరి మొత్తం తగ్గిన తర్వాత వేడి వేడి గా సర్వ్ చేయాలి.
'''
  ],
];
List<List> pickles = [
  [
    'పచ్చిమామిడికాయ పచ్చడి',
    'క్యారెట్ పచ్చడి',
    'టమోటో నువ్వుల పచ్చడి',
    'కొబ్బరి చట్నీ',
    'శెనగపప్పుకొబ్బరి చట్నీ',
    'కోకనట్ మ్యాంగో చట్నీ',
    'సొరకాయ పెరుగు పచ్చడి',
    'అల్లం నిల్వ పచ్చడి',
    'టమోటో ఊరగాయ',
  ],
  [
    "పచ్చిమామిడికాయ పచ్చడి",
    "images/tomato.jpg",
    ''' 
  మామిడి కాయలు : 3 
  ఎండు మిరపకాయలు: 15 
  పచ్చి మిరపకాయలు: 5 
  మినపప్పు : 1tbsp 
  మెంతులు : 1tsp 
  ఆవాలు : 1/2tsp 
  ఇంగువ : 1tsp 
  పసుపు : చిటికెడు 
  ఉప్పు : 2tsp 
  నూనె : 2tsp
''',
    ''' 
Step-1: ముందుగా మామిడి కాయలను బాగా కడిగి పెచ్చు తీసేసి చిన్న ముక్కలుగా తరిగి పెట్టుకోవాలి. 

Step-2: తరవాత ఒక ఫ్రైయింగ్ పాన్ తీసుకుని అందులో నూనే వేసి పైన చెప్పిన మినపప్పు,ఆవాలు,మెంతులు,ఇంగువ,పసుపు,ఎండు మిరపకాయలు, వేసి దోరగా వేయించి పెట్టుకోవాలి. 

Step-3: పోపు చల్లారిన తరువాత ఒక స్పూన్ పోపుని తీసి పక్కన పెట్టుకుని ఈ పోపు నంతా గ్రైండర్ లో వేసి పచ్చి మిరపకాయలు, ఉప్పు, మామిడి ముక్కలు కూడా వేసి మెత్తగా రుబ్బాలి. 

Step-4: అవసరమైతే కొద్దిగా నీరు పోసి రుబ్బుకోవచ్చు. తరవాత పక్కన పెట్టిన పోపుని పచ్చడిలో కలపాలి. అంతే ఘుమ ఘుమ లాడే రుచికరమైన మామిడి కాయ పచ్చడి రెడీ. ఇంక మీరు వేడి వేడి అన్నంలో నెయ్యి వేసుకుని తినడమే.

'''
  ],
  [
    "క్యారెట్ పచ్చడి",
    "images/pachadi1.JPG",
    ''' 
  క్యారెట్స్ - 5 to 6 
  ఎండుమిర్చి - 6 (for spiciness) 
  డ్రై రెడ్ చిల్లీస్ - 2 (To add the colour) 
  నిమ్మరసం - 2 teaspoons 
  కారం - 2 tablespoons 
  ఆవాలు - 1/4th teaspoon 
  నూనె: తగినంత
''',
    ''' 
Step-1: క్యారెట్స్ ను వర్టికల్ గా మీకు నచ్చిన సైజ్ లో కట్ చేసుకోవాలి. తర్వాత దానికి రెండు స్పూన్ల నిమ్మరసం మిక్స్ చేసి పక్కన పెట్టుకోవాలి. 

Step-2: చిన్న పాన్ తీసుకొని, అందులో నూనె వేసి వేడి చేసి అందులో ఆవాలు, మరియు రెడ్ చిల్లీ పౌడర్ వేసి ఒక రెండు నిముషాలు వేగించుకొని, క్యారెట్ ఉన్న బౌల్లోనికి మార్చుకోవాలి. 

Step-3: ఇప్పుడు మిక్సీ జార్ తీసుకొని అందులో నార్మల్ రెడ్ చిల్లీలను 5-6వేయాలి. మరియు డ్రై రెడ్ చిల్లీస్ ను వేయాలి. పౌడర్ చేసుకోవాలి. 

Step-4: అంతలోపు కొద్దిగా నీటిని బాయిల్ చేసుకోవాలి. 

Step-5: బాయిల్ చేసిన నీటిని కొద్దిగా జార్లో వేసి, ఉప్పు వేసి చిల్లీ పేస్ట్ ను మెత్తగా గ్రైండ్ చేసుకోవాలి. 

Step-6: ఈ చిల్లీ పేస్ట్ ను క్యారెట్ బౌల్లోకి మార్చుకోవాలి . మొత్తం మిశ్రమాన్ని మిక్స్ చేసుకోవాలి. అంతే స్పైసీ క్యారెట్ పికెల్ రెడీ. ఇది రైస్, చపాతీలకు చాలా బాగుంటుంది.
'''
  ],
  [
    "టమోటో నువ్వుల పచ్చడి",
    "images/tomato.jpg",
    ''' 
  టమోటోలు: 2 
  నువ్వులు: 2 tsp 
  పచ్చిమిర్చి: 2 
  ఎండు మిర్చి: 3-6 
  చింతపండు పేస్ట్: 2 tsp 
  ఉప్పు: రుచికి సరిపడా 
  నూనె: తగినంత
''',
    ''' 
Step-1: ముందుగా నువ్వులను ఫ్రైయింగ్ పాన్ లో వేసి వేయించికొని పక్కన పెట్టుకోవాలి. 

Step-2: తర్వాత డీప్ బాటమ్ పాన్ ను స్టౌ మీద పెట్టి అందులో కొద్దిగా నూనె వేసి వేడి చేసి, అందులో పచ్చిమిర్చి వేయించుకొని పక్కన పెట్టుకోవాలి. 

Step-3: తర్వాత ఎండు మిర్చి కూడా వేసి వేయించుకోవాలి. అలాగే టమోటో ముక్కలు కూడా వేసి నీరు పోయేంత వరకూ వేయించు కోవాలి. తర్వాత చింతపండు గుజ్జును టమోటోముక్కల్లో వేసి పక్కన పెట్టుకోవాలి. 

Step-4: ఇప్పుడు మిక్సీలో ముందుగా వేయించి పెట్టుకొన్న నువ్వులను, పచ్చిమిర్చి, ఎండు మిర్చి, వేసి మెత్తగా గ్రైండ్ చేసుకోవాలి. తర్వాత వేయించి పెట్టుకొన్న టమోటో చింత గుజ్జుతో సహా వేసి, ఉప్పు కూడా వేసి మరో సారీ గ్రైండ్ చేసుకోవాలి. అంతే నువ్వుల టమోటో చట్నీ రెడీ. దీన్ని వేడి వేడి గ్రీ రైస్ తో టింటే చాలా రుచిగా ఉంటుంది.

'''
  ],
  [
    "కొబ్బరి చట్నీ",
    "images/pachadi1.JPG",
    '''
   ఫ్రెష్ గా తురుమిన కొబ్బరి : 1cup 
   పెరుగు: 2tbsp(బాగా గిలకొట్టాలి) 
   ఆవాలు: 1/2tsp 
   పచ్చిమిర్చి: 8 
   ఎండుమిర్చి: 2 
   ఉప్పు: రుచికి సరిపడా 
   ఉద్దిపప్పు: 1tsp 
   నూనె: కొద్దిగా 
   నీళ్ళు: కొద్దిగా 
   కరివేపాకు : 2రెమ్మలు
''',
    ''' 
Step-1: ముందుగా మిక్స్ జార్లో కొబ్బరి తురుము, పచ్చిమిర్చి, మరియు పెరుగు వేసి, కొద్దిగా నీళ్ళు పోసి బ్లెడ్ చేయాలి . మెత్తగా పేస్ట్ చేయాలి . తర్వాత ఈ మిశ్రమాన్ని ఒక బౌల్లో వేసి పక్కన పెట్టుకోవాలి. 

Step-2: తర్వాత పాన్ లో కొద్దిగా నూనె వేసి అందులో ఆవాలు వేసి వేగిన తర్వాత ఎండు మిర్చి, కరివేపాకు వేసి ఒక నిముషం వేగించాలి.రుచికరమైన శెనగపప్పుకొబ్బరి చట్నీ మీరు పిల్లలకు శాఖాహారం మాత్రమే అందిస్తున్నారా? ..అయితే ఇదే వారి డైట్ ప్లాన్.. 

Step-3: పోపు వేగిన తర్వాత అందులో మిక్సీలో తయారుచేసుకొన్న కర్డ్ కోకనట్ చట్నీ వేసి, మీడియం మంట మీద 5నిముషాలు మిక్స్ చేస్తూ ఉడికించి స్టౌ ఆఫ్ చేయాలి. 

Step-4: ఈ చట్నీని సర్వింగ్ బౌల్లో వేసి ఇడ్లీ, వడ లేదా దోస, ప్లెయిన్ రైస్ కు కాంబినేషన్ గా వడ్డించవచ్చు.

'''
  ],
  [
    "శెనగపప్పుకొబ్బరి చట్నీ",
    "images/pachadi.jpg",
    ''' 
  శెనగపప్పు: 1/2cup 
  పచ్చికొబ్బరి తురుము : 1cup 
  ఎండు మిర్చి: 4-6 
  టమోటో: 1 
  కరివేపాకు: కొద్దిగా 
  నీళ్ళు : సరిపడా 
  ఉప్పు: రుచికి సరిపడా''',
    ''' 
  Step-1: ముందుగా స్టౌ మీద పాన్ పెట్టి, పచ్చిశెనగపప్పు వేసి రెండు, మూడు నిముషాలు లైట్ బ్రౌన్ కలర్ వచ్చే వరకూ వేయించుకోవాలి. 

  Step-2: తర్వాత వాటని ఒక ప్లేట్ లోకి తీసుకొని చల్లారనివ్వాలి. 

  Step-3: ఇప్పుడు మిక్సీ జార్ లో వేయించుకొన్నశెనగపప్పు, కొబ్బిరి తురుము,పండుమిర్చి, టమోటో, కొద్దిగా కరివేపాకు, నీళ్ళు వేసి మెత్తగా పేస్ట్ చేసుకోవాలి. 

  Step-4: చివరగా కొద్దిగా ఉప్పు వేసి, మెత్తగా గ్రైండ్ చేయాలి. అంతే శెనగపప్పు, కొబ్బరి చట్నీ రెడీ.
'''
  ],
  [
    "కోకనట్ మ్యాంగో చట్నీ",
    "images/pachadi.jpg",
    ''' 
  కొబ్బరి తురుయు: 1/2cup 
  మామిడికాయ తురుము: 1/2 
  పచ్చిమిర్చి: 5-8 
  ఉప్పు: రుచికి తగినంత 
  పసుపు: 1/4tsp 
  ఇంగువ: చిటికెడు 
  నూనె: 2tbps 
  కరివేపాకు: రెండు రెమ్మలు 
  ఎండుమిర్చి: 4-5 
  ఆవాలు: 1tsp 
  జీలకర్ర: 1tsp 
  శెనగపప్పు: 1tsp 
  మినపప్పు: 1tsp
''',
    ''' 
Step-1: ముందుగా కొబ్బరిని తురుమిని పెట్టుకోవాలి. అలాగే పచ్చిమామిడికాయ తొక్క తొలగించి తురుమి పెట్టుకోవాలి. 

Step-2:ఇప్పుడు మిక్సీలో పచ్చిమిర్చి, ఉప్పు, పసుపు, కొబ్బరి, మామిడికాయ తురుము వేసి మొత్తగా పేస్ట్ చేసి పెట్టుకోవాలి. 

Step-3: తర్వాత స్టౌ మీద పాన్ పెట్టి అందులో నూనె వేసి కాగిన తర్వాత అందులో శెనగపప్పు, మినపప్పు, ఆవాలు, జీలకర్ర, ఎండుమిర్చి, కరివేపాకు వేసి వేగించుకోవాలి. 

Step-4: పోపు వేగిన తర్వాత పచ్చడిని తీసి పోపులో వేసి బాగా మిక్స్ చేయాలి. అలాగే కొద్దిగా ఇంగువ వేసి మిక్స్ చేస్తే చాలా టేస్ట్ గా ఉంటుంది. ఇది అన్నంలోకి చాలా బాగుంటుంది.
'''
  ],
  [
    "సొరకాయ పెరుగు పచ్చడి",
    "images/sorkay.jpg",
    ''' 
  సొరకాయ ముక్కలు: 1cup 
  గట్టి పెరుగు: 1cup 
  ఆవాలు: 1/2tsp 
  జీలకర్ర 1/2tsp 
  ఉప్పు : రుచికి సరిపడా 
  నూనె: 1tbsp 
  ఎండు మిరపకాయలు: 2 
  ఇంగువ: చిటికెడు
''',
    ''' 
Step-1: చిన్న గా చేసి పెట్టుకున్న సొరకాయ ముక్కలను కొద్దిగా ఉప్పు వేసి మెత్తగా ఉడకబెట్టుకోవాలి. 

Step-2: తర్వాత ముక్కలలో నీరంతా ఒంపేసి చల్లారిన తర్వాత వీటిని పెరుగులో కలుపుకోవాలి. 

Step-3: స్టౌ మీద పాన్ పెట్టి అందులో కొద్దిగా నూనె వెసి, వేడయ్యాక ఆవాలు, జీలకర్ర, కరివేపాకు, వెండిమిరపకాయలు వేసి వేగక ఇంగువ వేసి తర్వాత పెరుగులో కలపాలి. వడ్డించేముందు గా కొత్తిమిర చల్లుకోవాలి. అంతే సొరకాయ పెరుగు పచ్చడి.

'''
  ],
  [
    "అల్లం నిల్వ పచ్చడి",
    "images/pachadi.jpg",
    '''
   అల్లం ముక్కలు: 100 grm 
   బెల్లం తురుము: 100 grm 
   చింతపండు: 100 grm 
   ఎండుమిర్చి: 10 
   ఉప్పు: రుచికి సరిపడ 
   నూనె: తగినంత 
   మెంతులు: 1tsp 
   ధనియాలు: 2tsp 
   జీలకర్ర: 1tsp 
   ఆవాలు: 1tsp 
   కరివేపాకు: 2 రెమ్మలు 
   వెల్లుల్లి: 10 రెబ్బలు
''',
    '''
 Step-1: పాన్ లో కొద్దిగా నూనె వేసి వేడయ్యాక అల్లం ముక్కలను 5 నిమిషాలు వేయించాలి. తర్వాత చల్లారనివ్వాలి. 

 Step-2: వేడినీళ్లలో చింతపండు నానబెట్టి చల్లారాక గుజ్జు తీసి ప్రక్కన పెట్టుకోవాలి. 

 Step-3: అదే పాన్ లో రెండు టీసూన్ల ఆయిల్ వేసి మెంతులు, ధనియాలు, జీలకర్ర, ఎండుమిర్చి వేసి మరో మూడు నిమిషాలు వేగనివ్వాలి. చల్లారాక వీటిని పొడి చేసి పెట్టుకోవాలి. 

 Step-4: చల్లారిన అల్లం ముక్కలను గ్రైండ్ చేసుకుని, చింతపండు గుజ్జు, బెల్లం తరుగు, ఉప్పు వేసి మెత్తగా పేస్ట్ చేయాలి. దీంట్లో గ్రైండ్ చేసి పెట్టుకొన్న పౌడర్ ను కలపాలి. 

 Step-5: పాన్ లో కొద్ది ఆయిల్ వేసి వేడయ్యాక ఆవాలు, కరివేపాకు, చిదిమిన వెల్లుల్లి రెబ్బలు వేసి వేయించాలి. ఈ పోపును పేస్ట్ చేసిన అల్లం పచ్చడిలో కలపాలి. అంతే అల్లం పచ్చడి రెడీ. దీనిని గాలి చొరబడని బాటిల్ లో పెట్టి నిల్వచేసుకోవచ్చు. ఈ పచ్చడి దోసె, ఇడ్లీ, అన్నంలోకి మంచి కాంబినేషన్ అవుతుంది.
'''
  ],
  [
    "టమోటో ఊరగాయ",
    "images/tomato.jpg",
    ''' 
  టమోటోలు: 1/2kg 
  నూనె: 1/4ltr 
  కారం: 1/2cup 
  ఉప్పు: రుచికి సరిపడా 
  మెంతులు: 1/2tsp 
  ఆవాలు: 3tbsp 
  చింతపండు: కొద్దిగా 
  వెల్లుల్లి రెబ్బలు: 8-10
''',
    ''' 
Step-1: ముందుగా టమోటాల నీటిలో వేసి శుభ్రం చేసి, ప్లేట్ లోనికి తీసుకొని పెట్టుకోవాలి. తర్వాత పొడి బట్టతో తుడిచి తేమను పూర్తిగా తొలగించి, సన్నని ముక్కలుగా కట్ చేసుకోవాలి. 

Step-2: తర్వాత పాన్ లో నూనె వేసి వేడయ్యాక అందులో వెల్లుల్లి చితగొట్టి దోరగా వేయించుకోవాలి వెంటనే అందులో టమోటో ముక్కలు, చింతపండును వేయాలి. తక్కువ మంట మీద టమోటోల్లోని తేమంతా పూర్తిగా పోయేదాకా బాగా మగ్గించాలి. 

Step-3: ఇప్పుడు మెంతుల్ని దోరగా వేయించి.. మెత్తగా పొడి చేసుకోవాలి. మెంతి పొడి తనగినంత ఉప్పు కారం, కలిపి మరో ఐదునిమిషాలుంచాలి. 

Step-4: వీటితో టమోటో బాగా గట్టిపడుతూ మగ్గిన తర్వాత దింపే ముందు ఆవపిండి కలిపితే సరిపోతుంది. నోరూరించే ఇస్టాంట్ టమోటో ఊరగాయ రెడీ. ఇది ఒక వారం రోజల పాటు నిల్వ ఉంటుంది. ప్రిజ్ లో పెట్టుకొంటే పదిహేను రోజులు కూడా నిల్వ ఉంటుంది. ఇది ఇడ్లీ, దోశ, వైట్ రైస్, పరోటాకి సూపర్ కాంబినేషన్.
'''
  ]
];

List<List> juice = [
  [
    'వాటర్ మెలన్ కిక్',
    'రోజ్ మిల్క్ షేక్',
    'డ్రై ఫ్రూట్ మ్యాంగో లస్సీ',
    'గ్రేప్ జ్యూస్',
    'ఆరెంజ్-బనానా జ్యూస్',
    'మ్యాంగో మిల్క్ షేక్',
    'చాక్లెట్ బనానా మిల్క్ షేక్',
    'బనాన & పీనట్ బటర్ మిల్క్ షేక్',
    'టమోటా క్యారెట్‌ రసం',
    'పైనాపిల్ జ్యూస్',
    'నట్స్(డ్రైఫ్రూట్స్)మిల్క్ షేక్',
    'పైనాపిల్ మిల్క్ షేక్',
  ],
  [
    "వాటర్ మెలన్ కిక్",
    "images/fruit.JPG",
    '''
పుచ్చకాయ(కరుబుజా): సగ భాగం 
నిమ్మకాయ: 1 
ఆరెంజెస్: 5 
పైనాఫిల్: సగభాగం 
పంచదార: 2 tsp 
మిరియాలు: 1 tsp''',
    ''' 
Step-1: పుచ్చకాయ, ఆరెంజ్, ఫైనాపిల్ పైతొక్క, లోపలి బీజాలు తొలగించాలి. 

Step-2: నిమ్మకాయ నుంచి రసం తియ్యాలి. 

Step-3: పంచదార, మిరియాలు అన్నీ కలిపి కొద్దిగా నీరు పోసి మిక్సర్ లో వేసి జ్యూస్ చేసుకోవాలి. అంతే వాటర్ మెలన్ కిక్ రెడీ.
'''
  ],
  [
    "రోజ్ మిల్క్ షేక్",
    "images/rose.jpg",
    ''' 
  పాలు: 2cups 
  వెనీల ఐస్ క్రీమ్: 2big scoops 
  
  సిరఫ్ కోసం: 
  
  పంచదార: 3/4cup (150grms) 
  నీళ్ళు: 100ml 
  రోజ్ మిల్క్ ఎసెన్స్: 1tbsp''',
    ''' 
  Step-1: ముందుగా ఒక చిన్న గిన్నెలో పంచదార వేసి స్టౌ మీద పెట్టి తగినన్ని నీళ్ళు పోయాలి. 

  Step-2: మీడియం మంట మీద బాగా మరిగించాలి. పంచదార బాగా కరిగిపోయి, సిరప్ తయారయ్యే ప్పుడు అందులో రోజ్ మిల్క్ ఎసెన్స్ ను జోడించి బాగా మిక్స్ చేయాలి. 

  Step-3: ఇప్పడు స్టౌ ఆఫ్ చేసి పూర్తిగా చల్లారనివ్వాలి. దీన్ని ఒక గ్లాసులో పోసి ఫ్రిజ్ లో స్టోర్ చేసి అవసరం అయినప్పుడు ఉపయోగించుకోవచ్చు. 

  Step-4: ఇప్పుడు బ్లెండర్ లో పాలు పోసి , తర్వాత ఒక టేబుల్ స్పూస్ రోజ్ సిరఫ్ వేసి, దాంతో పాటు ఐస్ క్రీమ్ కూడా వేసి బ్లెడ్ చేయాలి. ఇలా చేయడం వల్ల స్మూతీ షేక్ తయారవుతుంది. 

  Step-5: అంతే రోజ్ మిల్క్ షేక్ రెడీ. గ్లాసులో పోసి చల్లచల్లగా సర్వ్ చేయాలి.
'''
  ],
  [
    "డ్రై ఫ్రూట్ మ్యాంగో లస్సీ",
    "images/mango.JPG",
    ''' 
  పెరుగు: 1cup 
  మామిడి పండు: 1(పొట్టు తీసి చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  బాదం: 4-5(పొడి చేసుకోవాలి) 
  పిస్తా: 3-4(చిన్న ముక్కలుగా కట్ చేసుకోవాలి) 
  పంచదార: 3tsp 
  రోజ్ వాటర్ : రెండు మూడు చుక్కలు 
  ఐస్ క్యూబ్స్: 3-4
''',
    ''' 
Step-1: ముందుగా ఒక బౌల్లో పెరుగు తీసుకొని దాన్ని వాగా గిలకొట్టాలి. 

Step-2: తర్వాత బ్లెండర్ లో పెరుగు మరియు మామిడి పండు ముక్కలు, కొద్దిగా నీళ్ళు , పంచదార వేసి గ్రైండ్ చేయాలి. 

Step-3: మాండిపండ్లు బ్లెండ్ అయిన తర్వాత అందులో రోజ్ వాటర్ కూడా వేసి మరో రెండు మీరు సెకండ్లు బ్లెండ్ చేయాలి . 

Step-4: తర్వాత ఈ మొత్తం మిశ్రమాన్ని వేరే గిన్నెలోనికి వడగట్టుకోవాలి. మామిడి గుజ్జు ఫైబర్ తొలగిపోతుంది. 

Step-5: ఇప్పుడు ఒక గ్లాస్ తీసుకొని, అందులో ఐస్ క్యూబ్స్ వేసి తర్వాత అందులో మ్యాంగో లస్సీపోయాలి. తర్వాత డ్రైఫ్రూట్స్ తో గార్నిష్ చేయాలి. మీకు అవసరం అనిపిస్తే బ్లెండ్ చేసేప్పుడు కూడా డ్రైఫ్రూట్స్ ను యాడ్ చేసుకోవచ్చు. అంతే డ్రై ఫ్రూట్ మ్యాంగో లస్సీ త్రాగడానికి రెడీ.
'''
  ],
  [
    "గ్రేప్ జ్యూస్",
    "images/grape.webp",
    ''' 
  ద్రాక్షపండ్లు: 1kg 
  నీళ్లు: 2 
  పంచదార: 2cups 
  బ్లాక్ సాల్ట్: 1/2tsp 
  ప్రిజర్వేటివ్: 1 1/2 gm 
  సిట్రిక్ ఆసిడ్: 3 gm''',
    ''' 
  Step-1: నల్లద్రాక్షను బాగా కడిగి కొద్దిసేపు నీటిలో ఉంచాలి. తర్వాత వెడల్పాటి గిన్నెలో నీరు తీసుకొని అందులో పంచదార వేసి తీగపాకం వచ్చేలా మరిగించి క్రిందకు దింపుకోవాలి. 

  Step-2: ఆ పాకం చల్లారిన తర్వాత దానిలో సిట్రిక్ యాసిడ్‌ ను వేసి బాగా కలియబెట్టాలి. 

  Step-3: ఇప్పుడు కడిగిన ద్రాక్షను మిక్సీలో వేసి రసం తీసి వడగట్టి పంచదార పాకంలో కలపాలి.

  Step-4: కొద్దిపాటి నీటిలో ప్రిజర్వేటివ్ కలిపి దానిని పానీయంలో వేసి బాగా కలియబెట్టాలి. కావాలనుకుంటే రాస్పబెర్రి రంగు, ద్రాక్ష ఎస్సెన్స్ కలిపి శుభ్రమైన సీసాల్లో నిల్వ చేసుకోవచ్చు.
'''
  ],
  [
    "ఆరెంజ్-బనానా జ్యూస్",
    "images/banana.jpg",
    ''' 
  ఐస్ క్యూబ్స్: 4 
  ఆరెంజ్ జ్యూస్: 2cups 
  వెన్నతీసిన పాలు: 2cups 
  అరటిపండ్లు: 4 
  పంచదార: 2-3tbsp 
  నిమ్మరసం: 1tsp 
  తేనె: 4tsp
''',
    ''' 
Step-1: మొదటగా ఆరెంజ్ తొనలు తీసి ఆరెంజ్ జ్యూస్ ని సపరేట్ చేసి పెట్టుకోవాలి. 

Step-2: తర్వాత ఆరెంజ్ జ్యూస్, పాలు, అరటిపండ్ల ముక్కలను మిక్సీలో వేసి బ్లెండ్ చేయాలి. 

Step-3: ఈ మిశ్రమానికి అర టీస్పూన్ నిమ్మరసం, పంచదార కలిపి ఒక పాత్రలో పోసి ఫ్రిజ్‌ లో ఉంచాలి. 

Step-4: బాగా చల్లబడిన తరువాత తీసి జ్యూస్ గ్లాసులలో ఈ మిశ్రమాన్ని నింపి, పైన ఒక్కోదాంట్లో రెండు టీస్పూన్ల తేనెను కలిపి అతిథులకు సర్వ్ చేయాలి. అంతే ఆరెంజ్-బనానా జ్యూస్ రెడీ. అరటి, కమలాపండ్లతో తయారు చేసిన ఈ బనానా ఆరెంజ్ ఫ్రీజ్ జ్యూస్ కొత్త రుచితో అలరించటమేగాకుండా.. తక్షణ శక్తిని ఇస్తుంది. వేసవితాపాన్ని చల్లారుస్తుంది, వడదెబ్బనుంచి కాపాడుతుంది. హాట్‌ హాట్ సమ్మర్‌ ను, కూల్ కూల్‌ చేసేస్తుంది.
'''
  ],
  [
    "మ్యాంగో మిల్క్ షెక్",
    "images/mango.JPG",
    ''' 
  మామిడిపండ్లు: 2 
  పాలు: 4cup 
  పంచదార: 1/2cup 
  యాలకుల పొడి: 1ts
''',
    ''' 
Step-1: మొదటగా మామిడి పండు పళ్ళను చెక్కు తీసి, ముక్కలుగా కోసి పక్కన పెట్టుకోవాలి. 

Step-2: తర్వాత మిక్సీ జార్ లో మామిడి ముక్కలను వేసి మెత్తగా బ్లెండ్ చేయాలి. 

Step-3: ఇప్పుడు బ్లెండ్ చేసిన మామిడి గుజ్జులో కాచి చల్లార్చిన పాలు, చక్కెర యాలకుల పొడి వేసి మళ్లీ బాగా బ్లెండ్ చేయాలి. దీనిని ఫ్రిజ్ లో ఉంచి, చల్లబడిన తర్వాత సర్వ్ చేయాలి. సర్వ్ చేసేముందు చిన్న చిన్న మామిడి ముక్కలు వేసుకుంటే మజా..మజాగా ఉంటుంది.

'''
  ],
  [
    "చాక్లెట్ బనానా మిల్క్ షేక్",
    "images/banana.jpg",
    '''
  అరటి పండు: 1 
  మామూలు చాక్లెట్ బార్: 1(సువాసన లేదా అదనపు ఆహార పదార్ధాలు లేకుండా ఉండేది) 
  పంచదార: రుచికి తగినంత 
  పాలు: మామూలు గ్లాస్ కి సరిపడా
''',
    ''' 
Step-1: అవసరమైతే బ్లేండెర్ ని ఉపయోగించవచ్చు లేదా మిల్క్ షేక్ ని చేతితోనే తయారు చేసుకోవచ్చు. 

Step-2: అరటి పండ్లని గుజ్జుగా చెయ్యండి. గుజ్జుగా చెయ్యడానికి ఫోర్క్ ని ఉపయోగించండి లేదా చేతితో చేసేటప్పుడు చేతులు నీటిగా ఉండేలా జాగ్రత్తపడండి. ఎటువంటి గడ్డలూ లేకుండా మెత్తటి గుజ్జులా చేసుకోండి. 

Step-3: మైక్రోవేవ్ లో చాక్లెట్ ని ద్రవం గా మారే వరకు కరిగించండి. అరటి పండు గుజ్జుతో దీనిని కలపండి. 

Step-4: అరటిపండు, చాక్లెట్ మిశ్రమానికి కొంచెం పంచదారని రుచి కోసం జోడించండి. మీకు ఎంత తీపి ఇష్టమో అంత పంచదార కలపండి. ఇప్పుడు కొంచెం పాలు జోడించి, ఈ మిశ్రమాన్ని బాగా కలపండి. 

Step-5: ఇప్పుడు ఈ చాక్లెట్ బనానా మిల్క్ షేక్ లో ఐస్ ముక్క లేదా ఏవైనా క్రీం లేదా మరేదైనా మీకు నచ్చిన వాటిని కలపండి.
'''
  ],
  [
    "బనాన & పీనట్ బటర్ మిల్క్ షేక్",
    "images/banana.jpg",
    ''' 
  అరటి పండు: 1(చిన్న ముక్కలుగా కట్ చేయాలి) 
  పీనట్ బటర్: 2tbsp 
  పాలు : 1cup(బాగా మరిగించి వెన్నతీసిన పాలు) 
  ఐస్ క్యూబ్స్: 4 
  ప్రోటీన్ పౌడర్: 1tbsp
''',
    ''' 
Step-1: ముందుగా ముందుగా మిక్సీ జార్ లో కొద్దిగా పాలు పోయాలి, తర్వాత అందులోనే అరటిపండును ముక్కలుగా కట్ చేసి వేయాలి. 

Step-2: ఈ రెండింటి మిశ్రమంతో రెండు సెకండ్లు గ్రైండ్ చేసుకోవాలి, అరటిపండు పూర్తిగా మెత్తబడే వరకూ బ్లెడ్ చేసుకోవాలి. 

Step-3: తర్వాత అందులోనే పీనట్ బరట్, కొద్దిగా పాలు మరియు ఐస్ క్యూబ్స్ వేసి మరోసారి అన్నింటిని గ్రైండ్ చేసుకోవాలి. 

Step-4: తర్వాత మిక్సీ మూత తీసి అందులో మిల్క్ షేక్ ప్రోటీన్ పౌడర్ వేసి మరో రెండు సెంకడ్లు బ్లెడ్ చేయాలి . ఈ మిల్క్ షేక్ మరీ చిక్కగా ఉంటే మరికొద్దిగా పాలను మిక్స్ చేసుకోవాలి. అంతే బనాన పీనట్ బటర్ మిల్క్ షేక్ రెడి.
'''
  ],
  [
    "టమోటా క్యారెట్‌ రసం",
    "images/carrot.jpg",
    ''' 
  టమోటా - 1 (చిన్న ముక్కలుగా తరిగినవి) 
   క్యారెట్లు - 1 (చిన్న ముక్కలుగా తరిగినవి)  
   పుదీనా ఆకులు - 6-7 
   అల్లం - 1/2 స్పూన్ (పొడి ముక్కలుగా తరిగి)  
   నిమ్మ - సగం (రసం తీసుకోండి)
''',
    '''
Step-1: మొదట టొమాటో, క్యారెట్, అల్లం, పుదీనా ఆకులను బ్లెండర్‌లో వేసి బాగా రుబ్బుకోవాలి. 

Step-2: తరువాత దాన్ని టంబ్లర్‌లో పోసి, సగం నిమ్మకాయ రసం పోసి మిక్స్ చేసి త్రాగాలి. ఈ రసం అల్పాహారం సమయంలో లేదా స్నాక్స్ సమయంలో తాగవచ్చు.

'''
  ],
  [
    "పైనాపిల్ జ్యూస్",
    "images/pineapple.jpg",
    ''' 
  ఒక చెంచా నల్ల మిరియాలు  
  ¼ టేబుల్ స్పూన్ ఉప్పు 
  1 కప్పు పైనాపిల్ రసం 
  1 టేబుల్ స్పూన్ తరిగిన లేదా తురిమిన అల్లం 
  1 టేబుల్ స్పూన్ తేనె
''',
    ''' 
Step-1: ఇవన్నీ పైనాపిల్ రసంతో కలపండి. మీరు ఈ మిశ్రమంలో సగం కప్పును రోజుకు మూడు సార్లు తాగాలి.
'''
  ],
  [
    "నట్స్(డ్రైఫ్రూట్స్)మిల్క్ షేక్",
    "images/mango.JPG",
    ''' 
  కాచిన పాలు: 1 glass 
  బాదం: 8-10 
  పిస్తా: 8-10 
  ఖర్జూరం: 2 
  వాల్ నట్స్: 2 
  యాలకలపొడి: 1tsp 
  పంచదార: తగినంత 
  చాక్లెట్ క్రీమ్: 1tbsp
''',
    ''' 
Step-1: ముందుగా డ్రై ప్రూట్స్ అన్నింటినీ మిక్సీలో వేసి పొడి చేసుకోవాలి. తర్వాత అందులోనే పంచదార కూడా వేసి మరొకసారి గ్రైడ్ చేసి పెట్టుకోవాలి. 

Step-2: ఇప్పుడు గ్లాసు కాచి చల్లార్చిన పాలల్లో ఈ పౌడర్ ను రెండు టేబుల్ స్పూన్లు మిక్స్ చేసి బాగా షేక్ చేసి, చాక్లెట్ క్రీమ్ గార్నిష్ చేసి చల్ల... చల్లగా సర్వ్ చేయాలి. 

Step-3: మిగిలిన పౌడర్ ను మూత గట్టిగా ఉన్న డబ్బాలో నిల్వచేసుకొని, ఎప్పుడు కావాలంటే అప్పుడు నట్స్ మిల్క్ షేక్ రెడీ చేసుకోవచ్చు. ఇది చేయడం చాలా సులభం. ఈ వేసవి కూల్ డ్రింక్ ను తాగి మరింత శక్తిని పొందండి...

'''
  ],
  [
    "పైనాపిల్ మిల్క్ షేక్",
    "images/pineapple.jpg",
    ''' 
  పైనాపిల్: 1 
  పాలు: 2cups 
  పంచదార: 1/2cup 
  వెన్నీల ఐస్ క్రీం: 1tbsp 
  ఐస్ క్యూబ్స్: 2 
  యాలకుల పొడి: 1tsp
''',
    ''' 
Step-1: పైనాపిల్ పై తొక్కును తీసివేసి చిన్న ముక్కలుగా కోసి మిక్సీలో వేసి జ్యూస్ తీసుకోవాలి. 

Step-2: తర్వాత రెండు కప్పుల పైనాపిల్ రసానికి, రెండు కప్పుల పాలు, చక్కెర కలిపి మళ్లీ మిక్సీలో వేయాలి. 

Step-3: దానిని ఓ గ్లాస్ లో పోసి అందులో వెన్నీల ఐస్ క్రీం, ఐస్ క్యూబ్స్ యాలకుల పొడిని కలిపి కంచెం సేపు ఫ్రిజ్ లో పెట్టి బాగా చల్లగా అయిన తర్వాత తాగితే వేసవి దాహం చక్కగా తీరుతుంది.

'''
  ],
];
List<List> tea = [
  [
    'అల్లం టీ',
    'లెమన్ టీ',
    'జింజర్ లెమన్ టీ',
    'గ్రీన్ టీ',
    'మసాల టీ',
    'పుదీనా టీ',
    'డాల్గోనా కాఫీ',
    'గ్రీన్ టీ విత్ తులసి',
    'ఘీ-కాఫీ (నెయ్యి కాఫీ)',
  ],
  [
    "అల్లం టీ",
    "images/tea.jpg",
    ''' 
  సన్నగా తరిగిన అల్లం ముక్కలు - 1 టీస్పూన్ 
  టీ పొడి - 1 టీస్పూన్ (ఒక కప్పుకు) 
  నీళ్లు - 3 కప్పులు 
  తేనె - 1 టీస్పూన్ 
  నిమ్మ రసం - 1 టీస్పూన్
  పాలు - అర కప్పు (మీ ఇష్టం)
''',
    '''
   Step-1: పాత్రలో 3 కప్పుల నీటిని తీసుకోవాలి. 
 
   Step-2: అందులో అల్లం ముక్కలను వేసి మరిగించాలి. నీరు బాగా మరిగాక అందులో టీ పొడి, పాలు, తేనె వేయాలి. సిమ్మర్‌లో స్టవ్‌ను ఉంచి 3-4 నిమిషాల పాటు మరిగించాలి. 
 
   Step-3: తరువాత నిమ్మరసం కలపాలి. అంతే.. అల్లం టీ తయారైనట్టే.

'''
  ],
  [
    "లెమన్ టీ",
    "images/tea.jpg",
    ''' 1 కప్పు నీరు

1 బ్లాక్ టీ బ్యాగ్ లేదా 2 టీస్పూన్ల టీ ఆకులు

1 తాజాగా పిండిన నిమ్మరసం

రుచికి చక్కెర / బెల్లం / తేనె''',
    ''' 
Step-1: ఒక గిన్నెలో 1 కప్పు నీరు ఉడకబెట్టండి.

Step-2: టీ ఆకులు లేదా టీ బ్యాగ్ వేసి సుమారు 2 నుండి 3 నిమిషాలు అలాగే ఉంచండి.

Step-3: ఒక కప్పులో వడకట్టి దానికి నిమ్మరసం కలపండి.

Step-4: చివరగా, రుచికి తీపిని జోడించండి మరియు మీ నిమ్మ టీ సిద్ధంగా ఉంది.'''
  ],
  [
    "జింజర్ లెమన్ టీ",
    "images/tea.jpg",
    ''' 
   నీరు - 1 లీటర్ 
   నిమ్మకాయ - 1  
   ఫైన్ అల్లం - 1 ముక్క  
   తేనె - 4 టేబుల్ స్పూన్లు''',
    ''' 
  Step-1: మొదట అల్లం పొట్టు తీసివేసి చిన్న ముక్కలుగా కట్ చేసుకోవాలి. 

  Step-2: తరువాత ఒక బాణలిలో నీరు పోసి దానికి అల్లం వేసి 20 నిమిషాలు ఉడకబెట్టండి. 

  Step-3: తర్వాత క్రిందికి దించండి మరియు 10 నిమిషాలు చల్లబరచండి. 

  Step-4: దీన్ని వడగట్టి చివరిలో అల్లం నిమ్మ టీతో తేనె మరియు నిమ్మరసం కలపి త్రాగండి.'''
  ],
  [
    "గ్రీన్ టీ",
    "images/tea.jpg",
    ''' 
  పుదినా ఆకులు: అర కప్పు 
  నీళ్ళు: కప్పు 
  గ్రీన్ టీ బ్యాగులు: మూడు 
  తేనే: రెండు టేబుల్ స్పూన్లు''',
    ''' 
  Step-1: ఒక కప్పు నీళ్ళు బాగా మరగబెట్టి దింపుకోవాలి. 

  Step-2: తర్వాత ఒక చిన్న చెంచాడు గ్రీన్ టీ ఆకులను అందులో వేసి 1,2 నిమిషాలు మూత పెట్టి ఉంచాలి. 

  Step-3: ప్లేవర్ కోసం ఆకులతో బాటు 1/2టీ స్పూన్ నిమ్మరసం, పంచదార తేనె కలుపుకుంటే ఆరోగ్యకరం. 

  Step-4: రెండు నిమిషాల తర్వాత వడబోసుకుని త్రాగేయటమే.
'''
  ],
  [
    "మసాల టీ",
    "images/masalatea.jpg",
    ''' 
  తాజా అల్లం  
  తులసి ఆకులు  
  తేనే 
  టీ ఆకులు లేదా నాణ్యమైన టీ పొడి
''',
    ''' 
Step-1: కాచిన నీటిలో తేనేను మినహాయించి, మిగిలిన పదార్ధాలను వేసి కొద్ది సేపు వేడి చేయాలి. 

Step-2: తయారైన టీను కప్పులు పోసుకుని తాగేముందు, ఒక టీస్పూన్ తేనేను జోడించుకోండి. 

Step-3: తాజా పరిమళంతో కూడిన 'మషాల టీ'ని రోజు సేవిస్తూ, ఆరోగ్యాన్ని పదిలపరుచుకోండి.
'''
  ],
  [
    "పుదీనా టీ",
    "images/tea.jpg",
    ''' 
  1 కప్పు వేడి నీరు 
  2 స్పూన్ పుదీనా ఆకులు (30 గ్రా) 
  మెత్తగా పొడిచేసిన ఏలకులు (15 గ్రా) 
  ఒక చెంచా తేనె (రుచికి) 
  నిమ్మరసం (రుచికి)
''',
    ''' 
 Step-1: ఒక చిన్న గిన్నెలో నీరు మరియు పుదీనా వేసి మరిగించాలి. 

 Step-2: మెత్తగా తరిగిన ఏలకుల పొడి జోడించండి. 

 Step-3: 5 నిమిషాలు ఉడకబెట్టిన తరువాత, ఈ నీటిని వడకట్టండి. 

 Step-4: కావాలనుకుంటే ఈ నీటిలో కొద్దిగా నిమ్మరసం కలపండి. తీపి రుచిని ఇష్టపడేవారికి, మీరు కొద్దిగా తేనెను జోడించవచ్చు.
'''
  ],
  [
    "డాల్గోనా కాఫీ",
    "images/coffee.jpg",
    ''' 
  (ముగ్గురు వ్యక్తులకు) 
  
  3 టేబుల్ స్పూన్లు కాఫీ 
  3 టేబుల్ స్పూన్లు చక్కెర 
  3 టేబుల్ స్పూన్లు వేడి నీరు 
  3 కప్పుల చల్లని పాలు 
  కొన్ని ఐస్ క్యూబ్ (మీకు కావాలంటే ఐస్ క్యూబ్ లేకుండా మీ డబోనా కాఫీని కూడా సిద్ధం చేసుకోవచ్చు)
''',
    ''' 
 Step-1: మీరు మొదట ఒక గిన్నె తీసుకోవాలి. కాఫీ, చక్కెర మరియు వేడినీరు వేసి బాగా బీట్ చేయాలి. మీరు హ్యాండ్ బ్లెండర్ సహాయం తీసుకోవచ్చు. 

 Step-2: అది అందుబాటులో లేకపోతే, ఈ మిశ్రమాన్ని ఒక చెంచా సహాయంతో చిక్కగా అయ్యే వరకు కదిలించు. 

 Step-3: మృదువైన ఆకృతి మిశ్రమం త్వరలో సిద్ధంగా ఉంటుంది. ఇప్పుడు మిశ్రమం సిద్ధమైన తర్వాత, సర్వింగ్ గ్లాస్ తీసుకొని దానికి ఐస్ జోడించండి. 

 Step-4: ఇప్పుడు గాజులో చల్లని పాలు పోయాలి. ఇప్పుడు ఒక చెంచా సహాయంతో దానిపై కాఫీ మిశ్రమాన్ని పోయాలి. మీ దల్గోనా కాఫీ (మేఘావృతమైన కాఫీ) సిద్ధంగా ఉంది.
'''
  ],
  [
    "గ్రీన్ టీ విత్ తులసి",
    "images/tea.jpg",
    ''' 
  నీళ్లు - 2 కప్పులు 
  గ్రీన్ టీ + తులసి టీ బ్యాగులు - 2 
  పంచదార - 2 టీ స్పూన్లు
''',
    ''' 
  Step-1: నీళ్లను మరిగించాక, అందులో టీ బ్యాగ్ వేసి రెండు మూడు నిమిషాలు ముంచి తీస్తూ చేయాలి. 

  Step-2: అలా చేయడం వలన వాటిలో ఉండే ఫ్లేవర్ టీ లోకి వస్తుంది. (వీటిని నీటితో కలిపి మరిగించకూడదు. సాధారణంగా ఒక కప్పు టీ కి ఒక బ్యాగ్ సరిపోతుంది). 

  Step-3: పంచదార జత చేయాలి. ఇష్టపడేవారు పాలు కూడా కలుపుకోవచ్చు.
'''
  ],
  [
    "ఘీ-కాఫీ (నెయ్యి కాఫీ)",
    "images/coffee.jpg",
    '''నీళ్లు - 1 కప్పు 
     పంచదార - 2 tsp
     3 టేబుల్ స్పూన్లు కాఫీ 
     1 లేదా 2 టీస్పూన్ల నెయ్యి ''',
    ''' 
     Step-1: మీరు మొదట ఒక గిన్నె తీసుకోవాలి. కాఫీ, చక్కెర మరియు వేడినీరు వేసి బాగా బీట్ చేయాలి.

     Step-2: కాఫీ తయారు చేసి, కప్పులో పోసి, 1 లేదా 2 టీస్పూన్ల(మీరు తీసుకునే కాఫీ పరిమాణం ఆధారితం) నెయ్యిని జోడించి బాగుగా కలపండి.
'''
  ]
];
List<List> pindi = [
  [
    'రవ్వ కేసరి',
    'మామిడి రవ్వ లడ్డులు',
    'మలై లడ్డు',
    'కోవా క్యారెట్ లడ్డు',
    'నెయ్యి మురుకులు',
    'పొటాటో బజ్జీ',
    'రవ్వ బొబ్బట్లు',
    'పూర్ణం భక్షాలు',
    'మినప -నేతి గారెలు',
    'సాబుదాన(సగ్గు బియ్యం) వడలు',
    'బాదం పాయసం',
    'స్వీట్ అరిసెలు',
    'కాకినాడ కాజాలు',
    'జిలేబి',
    'కలకండ్',
    'బాదూషా',
  ],
  [
    "రవ్వ కేసరి",
    "images/ravapuli.jpg",
    ''' 
నెయ్యి : 3tbsp 
రవ్వ: 1cup 
పంచదార పౌడర్: 1cup 
కేసరి పౌడర్/ఫుడ్ కలర్: 1/2tsp 
నూనె: 3tsp 
జీడిపప్పు: 10 
యాలకులు: 4(పొడి చేసుకోవాలి) 
నీళ్ళు : 2cups
''',
    ''' 
Step-1: ముందుగా 1టేబుల్ స్సూన్ నూనెను డీప్ బాటమ్ పాన్ లో వేసి వేడి చేయాలి. నెయ్యి కరగగానే అందులో రవ్వ వేసి బాగా వేగించుకోవాలి.

Step-2: రవ్వ బ్రౌన్ కలర్ వచ్చేంత వరకూ తక్కువ మంట మీద వేగించుకోవాలి. 

Step-3: తర్వాత రవ్వను ఒక బౌల్లోనికి తీసుకొని, అదే పాన్ ను తిరిగి స్టౌ మీద పెట్టాలి. 

Step-4: ఇప్పుడు నీళ్ళను పాన్ లో పోసి బాగా మరిగించాల. నీరు మరిగే సమయంలో అందులో కేసరి పౌడర్ లేదా ఫుడ్ కలర్ వేయాలి. మూత పెట్టి మరో రెండు నిముషాలు బాగా మరిగించాలి.

Step-5: ఇప్పుడు అందులో ముందుగా నెయ్యిలో ఫ్రై చేసి పెట్టుకొన్న రవ్వను వేసి నిదానంగా మిక్స్ చేయాలి. 

Step-6: రవ్వ వేయగానే చిక్కబడటం మొదలవుతున్న సమయంలో పంచదార పౌడర్ ను కూడా వేసి బాగా మిక్స్ చేయలి. 

Step-7: పంచదార పౌడర్, రవ్వ రెండు నీళ్ళతో బాగా మిక్స్ అయ్యే వరకూ కలియబెడుతుండాలి. తర్వాత మూత పెట్టి మరో రెండు నిముషాలు ఉడికించుకోవాలి.

Step-8: అంతలోపు పాన్ లో నూనె వేసి వేడి చేసి అందులో జీడిపప్పు పలుకులు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకూ వేగించుకోవాలి. 

Step-9: తర్వాత నెయ్యి మరియు పొడిచేసుకొన్న యాలకులను ఉడుకుతున్న కేసరిలో వేసి బాగా మిక్స్ చేయాలి. 

Step-10: చివరగా నెయ్యిలో వేగించుకొన్న జీడిపప్పు పలుకులను గార్నిష్ చేయాలి. వేడి లేదా చల్లగా కూడా సర్వ్ చేయవచ్చు. అంతే రవ్వ కేసరి రెడీ.. 
'''
  ],
  [
    "మామిడి రవ్వ లడ్డులు",
    "images/laddu.jpg",
    ''' 
  బొంబాయి రవ్వ: 1/2kg 
  మామిడిపండ్లు: 2 
  యాలకుల: 2 
  జీడిపప్పు, కిస్ మిస్: గుప్పెడు 
  నెయ్యి: 2tbsp 
  పచ్చి కొబ్బరి తురుము: 2cups 
  పంచదార: 200grm
''',
    ''' 
Step-1: ముందుగా బొంబాయి రవ్వను వేయించి పెట్టుకోవాలి. అలానే కొబ్బరిని కూడా తురిమి పెట్టుకోబాలి. 

Step-2: తర్వాత స్టౌ మీద పాన్ పెట్టి కొద్దిగా నీరు పోసి బొంబాయి రవ్వ ను బాగా మొత్తగా ఉడికించాలి. అందులోనే పంచదార పోసి మరి కాసేపు ఉడికించి కొద్దిగా నెయ్యి వేసి బాగా కలియబెట్టాలి. 

Step-3: స్టౌ ఆఫ్ చేసి పచ్చికొబ్బరి తురుము కూడా వేసి జీడిపప్పు, కిస్ మిస్ లు నేతిలో వేయించి ఇందులో కలుపుకోవాలి. 

Step-4: తర్వాత కొద్దిగా చల్లారాక మామిడిపండు రసం కూడా పోసి బాగా తిప్పాలి. యాలకుల పొడిని ఇందులో వేసి మిశ్రమం గట్టిపడ్డాక నిమ్మకాయ పరిమాణంలో ఉండల్లా చేసుకొని ప్లేటులో అమర్చుకోవాలి. అంతే కమ్మని రవ్వతో కలిసిన మామిడి రవ్వలడ్డూలు మరింత రుచిగా ఉంటాయి.
'''
  ],
  [
    "మలై లడ్డు",
    "images/laddu.jpg",
    ''' 
  మైదాపిండి: 1/2kg 
  నెయ్యి: 400grm 
  పంచదార పొడి: 1kg 
  జీడిపప్పు: 1/4kg 
  హార్లిక్స్: 200grm 
  అమూల్ స్ప్రే: 800grm 
  జాజికాయ, జాపత్రి: 5grm 
  యాలకుల పొడి: 10grms 
  కిస్‌మిస్: 50grms 
  పిస్తాపప్పు: 100 
  బాదంపప్పు: 100grms
''',
    ''' 
Step-1: ముందుగా స్టౌ మీద పాన్ ఉంచి నెయ్యి వేసి అది వేడెక్కాక అందులో మైదాపిండి వేసి సన్నటి మంటపై వేయించాలి. మైదా వేగిందో లేదో తెలియాలంటే ఒక నీటి చుక్క మైదాపిండిపై వేయాలి. అది పొంగితే మైదాపిండి వేగిందని అర్థం. ఇలా వేగిన మైదాను ఒక గిన్నెలోకి తీసి చల్లార్చాలి. 

Step-2: తర్వాత పూర్తిగా చల్లారాక అందులో అమూల్ స్ప్రే, హార్లిక్స్, పంచదార పొడి వేసి బాగా కలపాలి. ఒకవేళ పిండి బాగా మెత్తగా ఉంటే పంచదార పొడి మరికొంత వేసుకోవచ్చు. 

Step-3: తర్వాత జీడిపప్పు, పిస్తాపప్పు, బాదంపప్పు చిన్న చిన్న ముక్కలుగా కోసి నేతిలో వేయించి ఈ పిండిలో వేయాలి. కిస్‌మిస్, యాలకుల పొడి, జాజికాయ, జాపత్రి కూడా చేర్చి నెమ్మదిగా కలపాలి. 

Step-4: ఇలా తయారైన లడ్డు పిండి కాసేపు ఆరాక అరచేతికి నెయ్యిగాని నూనెగాని రాసుకుని కొద్ది కొద్దిగా పిండి తీసుకుంటూ లడ్డూలుగా చుట్టుకోవాలి. అంతే మలై లడ్డు రెడీ..
'''
  ],
  [
    "కోవా క్యారెట్ లడ్డు",
    "images/laddu.jpg",
    ''' 
  కోవా : 1/2kg 
  కేరట్: 4 
  కొబ్బరి :సగం చిప్ప 
  పంచదార: 1/2 cup 
  నెయ్యి : 4 tsp 
  జీడిపప్పు: 8 
  బాదంపప్పు: 8 
  కిస్మిస్: 8 
  ఏలకులపొడి: 1tsp
''',
    ''' 
Step-1: ముందుగా క్యారెట్,కొబ్బరి తురుము కోవాలి స్టౌ , మీద బాణలి పెట్టి రెండు చెంచాల నెయ్యి వేసిజీడిపప్పు,బాదంపప్పు,కిస్మిస్ వేయించి కేరట్ పచ్చి వాసన పోయేదాకా వేయించుకోవాలి. 

Step-2: దీనికి కొబ్బరితురుము పంచదార కలిపి దగ్గరయ్యే వరకు తిప్పుతూ ఉండాలి. 

Step-3: జీడిపప్పు,బాదంపప్పు,కిస్మిస్ ఏలకులపొడి కలిపి స్టవ్ ఆఫ్ చెయ్యాలి ఇప్పుడు చేతికి నెయ్యి రాసుకుని కోవా చిన్న ఉండ తీసుకుని చేతిలో పరుచుకుని మద్యలో కేరట్ ఉండపెట్టి కప్పెయ్యాలి అన్ని ఆలాచేసుకుంటే క్యారెట్ కోవా లడ్డు రెడి.
'''
  ],
  [
    "నెయ్యి మురుకులు",
    "images/palahar2.jpg",
    ''' 
  బియ్యం పిండి: 4cups 
  శెనగపిండి: 2cups 
  కారం: 3tbsp 
  వాము: 1tsp 
  తెల్ల నువ్వులు: 2 లేదా 3tbsp 
  ఉప్పు: రుచికి సరిపడా 
  జీలకర్ర: 2tbsp 
  బేకింగ్ సోడా: చిటికెడు 
  నెయ్యి: 2టేబుల్ స్పూన్లు 
  నూనె: చిన్న కప్పుతో ఒక కప్పు(పిండిలో కలుపుకోవడానికి) 
  నూనె : వేగించడానికి సరిపడా
''',
    ''' 
Step-1: ముందుగా ఒక మిక్సింగ్ బౌల్ తీసుకొని, అందులో బియ్యం పిండి, శెనగపిండి, బేకిండ్ సోడా, ఉప్పు, కారం, వాము, జీకలర్ర, కొద్దిగా వేడిచేసిన నెయ్యి మరియు నూనె ఒకదానికి తర్వాత ఒకటి వేసుకోవాలి. 

Step-2: ఇప్పుడు ఈ మొత్తం మిశ్రమాన్ని బాగా మిక్స్ చేయాలి. 

Step-3: ఇలా బాగా మిక్స్ చేసిన తర్వాత అందులో సరిపడా నీళ్ళు పోసి, పిండిని మృదువుగా కలుపుకోవాలి. కలుపుకొన్న తర్వాత పిండి మీద కొద్దిగా నూనె చిలకరిస్తే త్వరగా డ్రై అవ్వకుండా ఉంటుంది. 

Step-4: తర్వాత స్టౌ మీద పాన్ పెట్టి, నూనె వేసి వేడయ్యాక అందులో జంతికల గొట్టంలో పిండిని నింపి, తర్వాత ప్లాస్టిక్ పేపర్ మీద వేసుకొని తర్వాత కాగే నూనెలో వేసి లైట్ బ్రౌన్ కలర్ వచ్చే వరకూ వేగించుకోవాలి. అంతే నెతి మురుకులు రెడీ. కాస్త శ్రమపడితే రుచికరమైన, నోట్లో వేసుకోగానే కరిగిపోయే జంతికలు సిద్దమవుతాయి.
'''
  ],
  [
    "పొటాటో బజ్జీ",
    "images/badusha.jpg",
    ''' 
  పొటాటో - 3 (సన్నగా స్లైస్ గా కట్ చేసుకోవాలి) 
  శనగ పిండి పిండి - 1 ½cup 
  నీరు - 1cup 
  కారం - 1tsp 
  గరం మసాలా పొడి - 1/2tsp 
  బేకింగ్ సోడా - చిటికెడు 
  ఉప్పు : రుచికి సరిపడా 
  నూనె: వేయించడానికి తగినంత 
  ఇంగువ: చిటికెడు
''',
    ''' 
Step-1: ముందుగా బంగాళదుంపకు పీలర్ తో పొట్టు తీసేయాలి. తర్వాత బంగాళదుంపలను నీటిలో వేసి శుభ్రంగా వాష్ చేయాలి. తర్వాత వాటని సాల్ట్ వాటర్ లో వేసి 15నిముషాలు నానబెట్టుకోవాలి. 

Step-2: ఇప్పుడు ఆ నీటిని వంపేసి, బంగాళదుంపలను సన్నని స్లైస్ గా కట్ చేసుకోవాలి. 

Step-3: తర్వాత ఒక ఒక మిక్సింగ్ బౌల్ తీసుకొని అందులో శెనగపిండి, కారం, గరం మసాలా, బేకింగ్ సోడా, ఇంగువ మరియు ఉప్పు వేసి బాగా మిక్స్ చేయాలి. అన్ని కలిసిపోయే వరకూ మిక్స్ చేసుకోవాలి. 

Step-4: ఇప్పుడు అందులోనే నీళ్ళు పోసి చిక్కగా మరియు జారుడుగా పిండిని కలుపుకోవాలి. ఉండలు లేకుండా చేత్తో కలుపుకోవాలి. 

Step-5: పిండి రెడీ చేసుకొన్న తర్వాత, అందులో ముందుగా కట్ చేసి పెట్టుకొన్న బంగాళదుంప ముక్కలు కూడా వేసి మొత్తం బాగా మిక్స్ చేయాలి. బంగాళదుంప స్లైస్ కు పూర్తిగా శెనగిపిండి మిశ్రమం పట్టేలా చూసుకోవాలి. 

Step-6: ఇప్పుడు డీప్ ఫ్రైయింగ్ పాన్ తీసుకొని అందులో ఒక స్పూన్ నూనె వేసి వేడయ్యాక అందులో మీడియం మంటకు తగ్గించాలి. 

Step-7: నూనె వేడిగా కాగుతున్నప్పుడు అందలో శెనగపిండి మిశ్రమంలో కలిపి పెట్టుకొన్న బంగాళదుంపస్లైస్ ను కాగే నూనెలో వేయాలి. 

Step-8: బంగాళదుంపలను అన్ని వైపులా బ్రౌన్ కలర్ వచ్చే వరకూ డీఫ్ ఫ్రై చేసుకోవాలి. 

Step-9: బాగా ఫ్రై అయిన తర్వాత పొటాటో బజ్జీలను ఒక ప్లేట్ మీద బ్లోటింగ్ పేపర్ పరిచి, దానిమీద పొటాటో బజ్జీలను వేయాలి. ఇది అదనపు ఆయిల్ ను పీల్చుకుంటుంది. అంతే పొటాటో బజ్జీ రెడీ వీటిని టమోటో సాస్ లేదా చిల్లీ సాస్ తో తినవచ్చు.
'''
  ],
  [
    "రవ్వ బొబ్బట్లు",
    "images/purnalu.JPG",
    '''
   రవ్వ: 1cup 
   మైదా: 2cups 
   గోధుమ పిండి: 1/2cup 
   పంచదార: 2cups 
   సోడా: చిటికెడు 
   నెయ్యి: 2tsp
   నూనె: 1/2cup
''',
    '''
Step-1: ముందుగా మైదా, గోధుమపిండి రెండింటినీ సమపాళ్ళలో తీసుకొని కలపాలి. దానిలో తగినన్ని నీళ్లు, వంట సోడా వేసి పూరీ పిండిలా కలిపి మూతపెట్టి ఉంచాలి. 

Step-2: తర్వాత పాన్ లో నెయ్యి వేసి రవ్వను దోరగా వేయించి ఉంచాలి. 

Step-3: అడుగు మందంగా ఉన్న గిన్నెలో 3 కప్పుల నీళ్లు పోసి స్టౌ మీద పెట్టాలి. నీళ్లు బాగా మరుగుతుండగా వేయించిన రవ్వ వేసి ఉండలు కట్టకుండా కలుపుతూ ఉడికించాలి. 

Step-4: రవ్వ ఉడికిందనుకున్న తరవాత పంచదార, యాలకులపొడి వేసి కలపాలి. ఇది పూర్ణం చేయడానికి సరిపడా చిక్కబడిన తరువాత పక్కకు దింపుకొని నిమ్మకాయ సైజులో ఉండలు చేసుకోవాలి. 

Step-5: ఇప్పుడు మైదా పిండిని చిన్న సైజు పూరీలా ఒత్తి మధ్యలో రవ్వ పూర్ణాన్ని పెట్టి చుట్టూతా పూరీతో మూసేసి మళ్లీ దాన్ని కర్రతో లేదా చేత్తో బొబ్బట్టులా ఒత్తి పెనం మీద నూనె లేదా నెయ్యి వేస్తూ రెండువైపులా కాల్చి తీయాలి.
'''
  ],
  [
    "పూర్ణం భక్షాలు",
    "images/purnalu.JPG",
    ''' 
  శెనగపప్పు: 1/2cup, 
  మైదా: 1/2kg, 
  ఏలకులు: 6, 
  నెయ్యి: 1cup, 
  వంటసోడా: చిటికెడు, 
  పాలిథీన్‌ కవర్‌: 1, 
  బెల్లం: 1/2kg, 
  నూనె: సరిపడా, 
  ఉప్పు: చిటికెడు
''',
    ''' 
Step-1: ముందుగా వెడల్పుగా ఉన్న ప్లేట్ లో మైదా జల్లించి దానికి వంటసోడా, ఉప్పు కలపాలి. అందులో నెయ్యి వేసి నీళ్లు పోసి జారుగా కలపాలి.

Step-2: ఈ మైదాకు మధ్యలో గుంట చేసి కప్పు నూనె పోసి ఆకు మూత పెట్టాలి. 

Step-3: నీరు మరిగించి శనగపప్పుకి బెల్లం, ఏలకుల పొడి కలిపి మెత్తగా రుబ్బాలి. 

Step-4: ఈ ముద్దని మనకి నచ్చినంత సైజు ఉండలు చేయాలి. నానిన మైదా ముద్దని నూనె పూసిన పాలిథీన్‌ కవరు మీద పరిచి, శెనగపప్పు బెల్లం ముద్దని మధ్య పెట్టి చుట్టూ మూసి భక్ష్యాన్ని పల్చగా వత్తి దళసరిపెనం మీద నెయ్యితో మాడకుండా కాల్చాలి. అతిధులకు ఇవి వడ్డిస్తే తినేందుకు ఎంతో రుచికరంగానూ వుంటాయి. అయితే వీటిని మాడనివ్వకుండా శ్రద్ధ వహించాలి.
'''
  ],
  [
    "మినప -నేతి గారెలు",
    "images/vada.JPG",
    ''' 
  మినపపప్పు: 4cup, 
  పచ్చిమిర్చి: 10, 
  పచ్చికొబ్బరి తరుము: 1tsp‌, 
  అల్లం పేస్టు: 5tsp, 
  నూనె: సరిపడ, 
  దాల్చిన చెక్క: 4ముక్కలు, 
  లవంగాలు: 2, 
  ఉప్పు: తగినంత, 
  బ్లాక్ పెప్పర్: 1tsp‌, 
  జీలకర్ర: 5tsp.
''',
    ''' 
Step-1: ముందుగా మినపపప్పును మూడు గంటల పాటు నీళ్ళలో నానపెట్టాలి. తరువాత ఈ మినపపప్పును మిక్సీలో వేయండి. 

Step-2: ఇందులో నూనె తప్ప మిగతా పదార్థాలన్నింటినీ వేసి మెత్తగా గ్రైండ్ చేసుకోవాలి. అనంతరం స్టౌ వెలిగించి పాన్ పెట్టి తగినంత నూనె వేయండి. 

Step-3: నూనె కాగిన తరువాత ప్లాస్టిక్‌ పేపర్‌పై మినపపప్పు మిశ్రమాన్ని వేసి గారెలుగా చేసి నూనెలో వేయండి. బంగారు వర్ణం వచ్చేంత వరకు వేయించుకోవాలి.
'''
  ],
  [
    "సాబుదాన(సగ్గు బియ్యం) వడలు",
    "images/vada.JPG",
    ''' 
  సాబుదానా (సగ్గుబియ్యం): 1cup, 
  ఆలూ: 1(ఉడికించి పొట్టుతీసినది), 
  పచ్చిమిర్చి: 8, 
  ఉప్పు: రుచికి సరిపడ, 
  నూనె: వేయించడానికి సరిపడ.
''',
    ''' 
 Step-1: ముందుగా సగ్గుబియ్యంలో నీళ్లు పోసి కడగాలి. తరువాత అందులో నీళ్లు పోసి 2-3 గంటలు నాననివ్వాలి. 

 Step-2: నానిన తరువాత సగ్గుబియ్యం, ఆలూ, పచ్చిమిర్చి ముక్కలు, ఉప్పు అన్నీ ఒక బౌల్‌ లో వేసి బాగా కలుపుకోవాలి. నూనె వేడి చేయాలి. 

 Step-3: సగ్గుబియ్యం మిశ్రమాన్ని చిన్న చిన్న వడలుగా చేతితో వత్తు కోవాలి. సన్నని మంట మీద నూనెను వుంచి వీటిని అందులో వేసి నెమ్మదిగా బంగారు రంగు వచ్చేవరకు వేయించుకోవాలి. ప్లేటులో పేపర్‌ నాప్‌కిన్‌ వేసి దానిపై వేయించిన వడలు వేసుకోవాలి. ఎక్కువగా వున్న ఆయిల్‌ అది పీల్చుకుంటుంది.
'''
  ],
  [
    "బాదం పాయసం",
    "images/mango.JPG",
    ''' 
  బాదం పప్పులు: 1cup, 
  పాలు: 6cups, 
  పంచదార: 1cup, 
  కుంకుమ పువ్వు: కొద్దిగా, 
  నీళ్లు: ఒక గ్లాసు.
''',
    ''' 
Step-1: ముందుగా బాదం పప్పులను వేడి నీటిలో వేసి ఒక గంట పాటు నాననివ్వాలి. తరువాత నీటిని వంచి బాదం గింజలపై వుండే పొట్టును తీసేయాలి. 

Step-2: తర్వాత బాదం పప్పులను మిక్సీలో వేసి, మెత్తటి పేస్టులాగా చేసుకోవాలి. అవసరం అయితే పాలు వేసుకోవాలి. 

Step-3:  తరువాత బాదం పేస్టును పాన్‌లో వేసి 5- 10 నిమిషాలు వేడి చేయాలి. తరువాత అందులో చక్కెర వేసి ఇంకొంచెం సేపు వుంచాలి. 

Step-4: అది చిక్కగా అయిన తరువాత పాలు మొత్తం వేసి ఉడికించాలి. దీనిపైన కుంకుమపువ్వుతో అలంకరించాలి. రుచికరమైన బాదం పాయసం రెడీ..
'''
  ],
  [
    "స్వీట్ అరిసెలు",
    "images/purnalu.JPG",
    ''' 
  బియ్యం: 1kg 
  బెల్లం తరుము: 1/2kg 
  నువ్వులు: 100grms 
  నీరు: 1cup(తగినంత) 
  యాలకులు: 2-4(మెత్తగా పొడిచేసుకోవాలి) 
  నెయ్యి: 1/2cup 
  నూనె: వేయించడానికి సరిపడా
''',
    ''' 
Step-1: ముందుగా బియ్యాన్ని శుభ్రంగా కడిగి 24 గంటలు నానబెట్టుకోవాలి. ఉదయం చిల్లులగిన్నెల్లో వడవేసి పిండి పట్టించుకోవాలి. పిండి తడి ఆరిపోకుండా మూత పెట్టి ఉంచుకోవాలి. 

Step-2: తర్వాత స్టౌ మీద మందపాటి గిన్నె పెద్దది పెట్టుకుని అందులో చిదిమిన బెల్లాన్ని వేసి కొద్దిగా నీరు పోసి పాకం పట్టుకోవాలి. (అరిసెలు గట్టిగా కావాలంటే ముదురుపాకం, మెత్తగా కావాలంటే లేతపాకం) పాకం రాగానే నువ్వులు, నెయ్యి, యాలకుల పొడి వేసి కలుపుకోవాలి. 

Step-3: తర్వాత బియ్యం పిండి ఒకరు వేస్తుంటే మరొకరు ఉండ చుట్టకుండా కలపాలి. ఉండలు చేసుకోవడానికి వీలుగా ఉండేంతవరకూ పిండి వేసి కలపాలి. 

Step-4: ఇలా పిండి పాకంతో తయారు చేసుకొన్న తర్వాత స్టౌ ఫ్రైయింగ్ పాన్ పెట్టుకోవాలి. అందులో నూనె వేసి కాగనివ్వాలి. ఈలోపు పిండిని చిన్న చిన్న ఉండలు చేసుకొని ప్లాస్టిక్‌ కవర్‌ మీద అరిసెలు వత్తుకొని కాగిన నూనెలో వేసి వేయించుకోవాలి. 

Step-5: బంగారు వన్నె రాగానే వాటిని తీసి అరిసెల పీటపై (గరిటెలు కూడా ఉంటాయి) ఉంచి వత్తుకోవాలి. దీనివల్ల అరిసెల్లో అదనంగా ఉన్న నూనె పోతుంది. వీటిని ఆరబెట్టుకోవాలి. ఆరిన తర్వాత భద్రపచుకోచ్చు. ఇవి ఒక నెల రోజుల పాటు నిలవ ఉంటాయి. అంతే నోరూరించే అరిసెలు రెడీ..!
'''
  ],
  [
    "కాకినాడ కాజాలు",
    "images/kaja.jpg",
    ''' 
  మైదా పిండి - 1/2 kg 
  ఉప్పు - రుచికిసరిపడ 
  నూనె - వేయించడానికి తగినంత 
  బెల్లం లేదా పంచదార - 1/2 kg
   కారం - 2 tsp 
   యాలకలు - 2
''',
    ''' 
Step-1: ముందుగా మైదా పిండి తీసుకొని కొద్దిగా కాచిన నూనె వేసి కలుపుకోవాలి. దీనికి తగినన్ని నీరు పోసి చపాతి పిండిలాగా కలుపుకోవాలి. 

Step-2: ఇప్పుడు పెద్ద పెద్ద ఉండలు చేసి పెద్ద చపాతీ లాగా వత్తుకోవాలి.ఆ చపాతీని ముందు నిలువుగా తరువాత అడ్డంగా చాకుతో కోసుకోవాలి డైమెండ్ ఆకారం లో ఇప్పుడు అలా కోసిన వాటిని కాగిన నూనెలో దోరగా వేయించుకోవాలి. 

Step-3: కారం ను ఇష్టపడేవారు కమ్మటివి కావాలనుకుంటే కొంచెం ఉప్పు కారం ఆ కాజాల మీద చల్లుకుని ఒక డబ్బాలో నిలువ ఉంచుకోవచ్చు. 

Step-4: తియ్యటివి కావాలనుకుంటే పంచదార లేదా బెల్లం ముదురు పాకం పట్టి అందులోయాలకల పొడి వేసి వేయించిన కాజాలు వేసి బాగా కలుపుకోవాలి, పాకం అన్ని కాజాలకి పట్టేలాగా. చల్లారిన తరువాత ఒక డబ్బాలో నిలువ చేసుకోవాలి.
'''
  ],
  [
    "జిలేబి",
    "images/jilebi.jpg",
    ''' 
  మైదా - 1 కప్పు 
  శనగ పిండి - 1 టేబుల్ స్పూన్ 
  తాజా పెరుగు - 1 కప్పు 
  చక్కెర - 1 కప్పు 
  నీరు - 4 కప్పులు 
  కుంకుమ పువ్వు - 4-5 రేకలు 
  ఫ్రూట్ సాల్ట్ - చిటికెడు 
  కుంకుమ పువ్వు రంగు - చిటికెడు 
  నెయ్యి - 1 కప్పు
''',
    ''' 
Step-1: బౌల్ లోకి మైదా పిండి తీసుకోవాలి. 

Step-2: దానికి శనగపిండి మరియు తాజా పెరుగు కలపాలి. 

Step-3: ఉండలు లేకుండా మందపాటి పేస్ట్ గా కలపాలి. 


Step-4: కలిపిన పిండిని 10 నిమిషాల పాటు కదపకుండా ఆలా ఉంచాలి. 

Step-5: ఈ లోపు పొయ్యి మీద పాన్ పెట్టి పంచదార వేయాలి. 

Step-6: పంచదారలో నీరు పోయాలి. 

Step-7: పంచదార కరిగే వరకు 3 నుంచి 5 నిమిషాల వరకు కలుపుతూ ఉండాలి. 

Step-8: కుంకుమ పువ్వు మరియు ఫుడ్ కలర్ కలపాలి. 

Step-9: తక్కువ మంట మీద బాగా కలపాలి. 

Step-10: పిండిలో చిటికెడు ఫ్రూట్ సాల్ట్ కలపాలి. 

Step-11: ప్లాస్టిక్ స్క్వీజ్ బాటిల్ తీసుకోండి. మూత తెరిచి పై భాగంలో ఒక గరాటు ఉంచండి. 

Step-12: బాటిల్ లోకి పిండిని గరాటు ద్వారా వేసి బాటిల్ కి నాజిల్ ఉన్న మూతను పెట్టాలి. 

Step-13: పొయ్యి మీద పాన్ పెట్టి నెయ్యి పోసి కరిగించి రెండు నిముషాలు వేడి చేయాలి. 

Step-14: నెయ్యి వేడెక్కాక పిండి వేసుకున్న బాటిల్ తీసుకొని బాటిల్ ని నొక్కుతూ జిలేబి ఆకారం వచ్చేలా వేయాలి. 

Step-15: జిలేబి రౌండ్స్ ఒకదాని తర్వాత ఒకటి వచ్చేలా జాగ్రత్తగా వేయాలి. 

Step-16: రెండు వైపుల గోల్డ్ కలర్ వచ్చేవరకు జాగ్రత్తగా వేగించాలి. 

Step-17:. బాగా వేగిన జిలేబిని ఒక ప్లేట్ లోకి తీసుకోవాలి. 

Step-18: ఆ జిలేబి మీద పంచదార పాకాన్ని పోసి 30 సెకన్ల పాటు అలానే ఉంచాలి. 

Step-19: వేడి వేడి జిలేబీలకు సర్వ్ చేయండి. 

INSTRUCTIONS :

1. పెరుగు పుల్లగా లేకుండా తాజాగా ఉండాలి. 
2. జిలేబి పుల్లగా కావాలని అనుకుంటే పిండిని 6 నుంచి 7 గంటలు పులియబెట్టాలి. 
3. పుల్లని జిలేబి త్వరగా కావాలంటే జిలేబి పిండిలో కొన్ని చుక్కల నిమ్మరసం కలపండి. 
4. మైదా పరిమాణం పంచదార పరిమాణం రెండు సమానంగా ఉండాలి. 
5. జిలేబిలు వేగించినప్పుడు ఉబ్బాలంటే ఫ్రూట్ సాల్ట్ ఉపయోగించాలి.
'''
  ],
  [
    "కలకండ్",
    "images/kalakand.jpg",
    ''' 
  పాలు: 1ltr 
  ఫ్రెష్ పనీర్: 1kg 
  పంచదార : 1cup 
  బాదం, పిస్తా : గుప్పెడు(ముక్కలుగా చేయాలి) 
  యాలకుల పొడి ''',
    ''' 
  Step-1: ముందుగా మందగా ఉన్న పాన్ తీసుకొని అందులో పాలు పోసి బాగా కాచాలి. పాలు చిక్క బడేవరకు బాగా కాచాలి. మరియు మద్యమద్యలో కలియబెడుతుండాలి. పాలు మరుగుతున్నప్పుడే అందు తాజా పన్నీర్ ముక్కల చిదిమి, పాలలో మిక్స్ చేయాలి. 
  Step-2: తర్వాత అందులోనే, పంచదార, యాలకుల పొడి వేసి, ఈ మిశ్రమం గట్టిపడే వరకూ కంటిన్యూగా కలియబెడుతుండాలి. 
  Step-3: ఇప్పుడు ఈ మిశ్రమం కొద్దిగా గట్టిపడ్డాక ఈ మిశ్రమాన్ని ఒక ప్లేట్ కు బట్టర్ బాగా రాసి అందలోకి మార్చుకోవాలి. తర్వాత వాటి మీద బాదం, పిస్తా పలుకులతో గార్నిష్ చేయాలి. అంతే టేస్టీ కలకండ రెడీ
'''
  ],
  [
    "బాదూషా",
    "images/badusha.jpg",
    ''' 
  మైదా-ఒక కప్పు 
  నెయ్యి-రెండు టీస్పూన్లు 
  బేకింగ్ సోడా-చిటికెడు 
  పెరుగు/యోగర్ట్-అర కప్పు 
  పంచదార- ఒక కప్పు 
  నీళ్ళు-ఒక కప్పు 
  ఏలకుల పొడి-చిటికెడు 
  నూనె-వేయించడానికి సరిపడా
''',
    ''' 
Step-1: ఒక బౌల్ తీసుకుని దానిలో పెరుగు/యోగర్ట్,నెయ్యి, బేకింగ్ సోడా వేసి బాగా కలపాలి.

Step-2: ఒక వెడల్పాటి గిన్నెలో మైదా వేసి దానిలో మెల్లిగా పెరుగు వేస్తూ చపాతీ పిండిలా కలపాలి.

Step-3: 3.ఈ కలిపిన పిండిని పది నిమిషాలు నాననివ్వాలి. 

Step-4: గిన్నెలో నీళ్ళు తీసుకుని దానిలో పంచదార వేసి పంచదార పాకం వచ్చేంతవరకూ మరిగించాలి.పాకం తయారీలో స్టౌ మంట సన్నగా ఉండాలి.పల్చటి సిరప్ లా అయ్యేవరకూ నీళ్ళూ పంచదార మీశ్రమాన్ని స్టౌ మీద ఉంచాలి.

Step-5: పాకం వచ్చాకా స్టౌ కట్టేసి ఏలకుల పొడి కలపాలి. 

Step-6: కలిపి పెట్టుకున్న మైదా పిండిని చిన్న చిన్న ఉండలుగా చేసి ప్యాటీస్ లాగ చెయ్యాలి.కావాలనుకుంటే ప్యాటీల చివర్లు లోపలకి మడిచి అందంగా కూడా తయారుచేసుకోవచ్చు

Step-7: మూకుడులో నూనె వేడి చేసి,ఈ ప్యాటీలని మెల్లిగా నూనెలో వెయ్యాలి.

Step-8: సన్నని సెగ మీద బాదూషా పూర్తిగా వేగేవరకూ వేయించుకోవాలి.

Step-9: బ్రౌన్ కలర్ వచ్చాకా బాదూషా ని నూనెలో నుండి తీసి 2-3 నిమిషాలు పక్కన ఉంచాలి. 

Step-10: పక్కన పెట్టుకున్న బాదుషాలని పంచదార పాకంలో వేసి రాత్రంతా నాననివ్వాలి. 

Step-11: మరునాడు డ్రై ఫ్రూట్స్ తో అలకరించుకుని నోరూరించే ఈ బాదుషాని ఆస్వాదించండి. 

'''
  ]
];
